{
  "data":[
{"employer_url": "https://www.seek.com.au/companies/oreillys-rainforest-retreat-814667", "employer_name": "O`Reilly`s Rainforest Retreat", "employer_info": "O’Reilly’s Rainforest Retreat has been a sanctuary for bird and other animal lovers since the early part of last century, and enjoys international recognition as one of the premier birdwatching locations in Australia. There is countless wildlife at Lamington National Park. More than 160 species of sub-tropical birds and other native wildlife make their home in the rainforest.\nCall 1800 688 722 to enquire about seeking out these rare creatures with the help of our expert guides.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/oceanic-offshore-943724", "employer_name": "Oceanic Offshore", "employer_info": "Oceanic Offshore was established in March 1997 by Kevin Nuttall who began diving off the Pilbara coast in 1972 and is now managed by his sons Troy and Glen Nuttall. After starting out as a small family business operating out of a sea container and donger at Mermaid Marine with a 3 man dive team and one receptionist, Oceanic Offshore has grown from strength to strength. Today Oceanic Offshore employs 6 full time office staff and operates with multiple Dive Teams from locations across the Pilbara, Gascoyne and Kimberley Regions.\nFrom humble beginnings, Oceanic Offshore has expanded exponentially and acquired one of the last independent lease areas in the Dampier Port Authority securing its future in the Port of Dampier. Located next to Woodside, Pluto, Mermaid Marine and Chevron Oceanic Offshore has developed and constructed a purpose built Shed and Office Complex to facilitate all aspects of commercial air diving, HRF management, emergency response and vessel support services.\nOceanic Offshore has an excellent working relationship with their Clients based on trust, honesty and a “can do attitude”. We are able to also offer our knowledge and expertise from working in the Pilbara region and on other Offshore Projects.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/oceaneering-434701", "employer_name": "Oceaneering", "employer_info": "Oceaneering is a global oilfield provider of engineered services and products primarily to the offshore oil and gas industry, with a focus on deepwater applications. Through the use of its applied technology expertise, Oceaneering also serves the defense, entertainment, and aerospace industries. Oceaneering’s business offerings include remotely operated vehicles, built-to-order specialty subsea hardware, deepwater intervention and manned diving services, non-destructive testing and inspection, and engineering and project management.\n\nSource: this is an extract from the company’s own website"},
{"employer_url": "https://www.seek.com.au/companies/oceania-aviation-816792", "employer_name": "Oceania Aviation", "employer_info": "Oceania Aviation is an Australian owned Ground Handling Services Company. We provide professional, efficient ground handling services to leading airlines and supply, maintain & manufacture innovative ground handling equipment.\n\nOceania Aviation first commenced ground handling operations in June 1996 and now have over 250 staff in 9 locations across Australia and the Pacific.\n\nOur Company combines the latest technology and equipment, expert staff and a confident hands-on management style to deliver practical and high quality services.\nSource: this is an extract from the company’s own website"},
{"employer_url": "https://www.seek.com.au/companies/ocean-wave-medical-943773", "employer_name": "Ocean Wave Medical", "employer_info": "PSYCHOLOGIST, PHYSIOTHERAPIST, PODIATRIST, DIETITIAN,\nQML PATHOLOGY & CUSTOM DENTURE CLINIC ALL HERE ON SITE\n \nOcean Wave Medical (formerly known as Currimundi Medical Centre) is in Caloundra on the Sunshine Coast and was established in 1990.    All your regular Doctors have moved from the Currimundi Centre to our new purpose built medical centre here in Caloundra.    Our experienced team of 10 female and male Doctors are here to take care of all your medical needs offering a professional and high quality service in a personal, friendly and relaxed atmosphere. Our Team can provide medical care for the whole family from newborn babies through to the elderly.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/ocean-software-801282", "employer_name": "Ocean Software", "employer_info": "Ocean Software designs, develops, and delivers Enterprise Software solutions for military, government, and corporate customers around the world.\n\nOur solutions are widely regarded as the gold standard in their respective classes due to their completeness, levels of support, ongoing development, training and documentation. Our products form the core systems behind highly complex operating environments including; Command and Control, Situational Awareness, Healthcare, Supply Chain Management, and eCommerce.\n\nWe are one of the key business units within the Meydan Group‘s retail and technology services divisions, and are part of a team that comprises more than 1200 employees worldwide, with turnover in excess of $300m annually.\n\nSource: this is an extract from the company’s own website."},
{"employer_url": "https://www.seek.com.au/companies/oceana-gold-435297", "employer_name": "Oceana Gold", "employer_info": "OceanaGold is a global gold mining company with a strong presence in Philippines, New Zealand and United States\n\nOceanaGold Corporation is a mid-tier, low-cost, multinational gold producer with assets located in the Philippines, New Zealand and the United States.\n\nThe Company’s assets encompass its flagship operation, the Didipio Gold-Copper Mine located on the island of Luzon in the Philippines. On the north island of New Zealand, the Company operates the high-grade Waihi Gold Mine. On the south island of New Zealand, OceanaGold operates the largest gold mine in the country at the Macraes Goldfield, which is made up of a series of open pit mines and the Frasers underground mine.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/ochre-health-medical-centres-813527", "employer_name": "Ochre Health Medical Centres", "employer_info": "At our core is the belief that everyone should enjoy what they do within a friendly and caring environment. That original family feel has grown to include the whole Ochre Health clan. Each year we all gather together with our families and friends for a big Ochre party weekend, to renew friendships, share stories, and of course, to celebrate another year of success. We look forward to new centres in new towns and faraway places, and continuing the Ochre Health story into the future, but above all we look forward to helping new medical friends from here and overseas create their own amazing stories across this wide brown land.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/ocean-view-college-801285", "employer_name": "Ocean View College", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/ocean-shores-public-school-872615", "employer_name": "Ocean Shores Public School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/ocean-road-primary-school-872614", "employer_name": "Ocean Road Primary School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/alh-group-432530?child=436124", "employer_name": "Ocean Beach Hotel, Umina", "employer_info": "ALH Group helps people live it up at our leading portfolio of pubs across Australia. We offer a diverse hospitality experience including electronic gaming, sports bars, bistros, restaurants, cafes, retail liquor, accommodation, nightclubs and wagering. Our facilities are located in capital cities and urban and regional centres across Australia.\n\nWe employ over 15,500 people across Australia at more than 320 licensed venues and in excess of 550 retail liquor outlets.\n\nSource: this is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/ocean-reef-senior-high-school-872613", "employer_name": "Ocean Reef Senior High School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/ocean-grove-primary-school-872611", "employer_name": "Ocean Grove Primary School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/ocean-hotels-and-tourism-814224", "employer_name": "Ocean Hotels and Tourism", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/ozshut-814911", "employer_name": "OzShut", "employer_info": "WA owned & operated\n\nOzShut® Rollershutters is a wholly owned and operated WA company located in Malaga, Western Australia. With custom and purpose built professional offices and a massive 1200 sq metre production facility conveniently located in the Perth metro area, OzShut® brings the very best in quality and service for maximum customer satisfaction.\n\nEnjoy a 10 year product guarantee\n\nWhilst many roller shutter operations have come and gone, OzShut® leads the industry with a 10 year product guarantee, free from loopholes, shortcuts or hidden after sales call out fees (exclusions/conditions apply)***.\n\nAfter all, you have to offer the best product if you have the best guarantee right?\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/ozmosis-432886", "employer_name": "Ozmosis", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/ozford-college-of-business-816794", "employer_name": "Ozford College of Business", "employer_info": "Ozford is committed to providing quality educational programs for students to achieve their educational and personal goals and embrace lifelong learning. Ozford fosters a personalised environment where students can develop skills and values to enable them to participate effectively in their chosen career field and the wider community.\n\n\nOur purpose is to create an innovative educational institution in the heart of Melbourne with the best possible opportunities offered to students to excel academically and maximise their potential.\n\nOur vision is to provide every student with the opportunity to practice skills attained by undertaking real life learning based on global needs and values. Our dedicated staff provide a student-focused approach to ensure a supportive, individualised and innovative learning experience.Ozford is committed to the achievement of excellence in education. A student’s success is Ozford’s success.\nSource: this is an extract from the company’s own website"},
{"employer_url": "https://www.seek.com.au/companies/ozsale-435212", "employer_name": "OZsale", "employer_info": "OZSALE is Australia’s number 1 members-only online shopping club and your doorway to affordable designer fashion.\n\nOZSALE (www.ozsale.com.au) is a website operated by OZSALE Pty Limited (ABN 11 118 610 987), a company registered in Australia.\n\nEach day, members receive a personal invitation to the most exclusive sales events for men, women, kids, home, beauty, wine and more – at up to 80% off retail. \n\nMembership is free and everyone is welcome to join! \n\nSource: This is an extract from the company's own website"},
{"employer_url": "https://www.seek.com.au/companies/ozescribe-861011", "employer_name": "Ozescribe", "employer_info": "OzeScribe provides accurate and cost-effective medical transcription services, and returns document by the next business day.\n\nGuaranteed Accuracy\n\nAt OzeScribe we focus on accuracy above anything else. We understand that when Physicians have to waste time editing, money and time is wasted. The OzeScribe verifiable accuracy rate is unmatched in the industry. We conduct a formal post-delivery quality assurance program that provides impressive and industry standard exceeding verifiable accuracy rates.\n\nIf you're tired of having poor TAT or transcription blanks in your work, switch to OzeScribe now and experience near faultless, on-time transcription.\n\nPrivate and secure\n\nClearly there is a need to ensure absolute privacy and secure confidentiality when dealing with patient notes and medical files. In order to guarantee this, we only work with appropriately trained and experienced medical transcriptionists. We ensure that transcription carried out by OzeScribe is compliant with the Australian National Privacy legislation NPP.9\nSource: this is an extract from the company’s own website."},
{"employer_url": "https://www.seek.com.au/companies/ozcare-433074", "employer_name": "Ozcare", "employer_info": "Ozcare is a leading not-for-profit organisation of professional and caring individuals. For the past 18 years the organisation has delivered innovative and superior health and human services to the Queensland community.  Their commitment is to provide clients with the highest standard of care. Every day Ozcare provides aged care and community care, including health and support services, to over 15,000 Queenslanders. They are Catholic in character and demonstrate their Christian values through trust, respect, accountability, innovation and teamwork.                         \nSource: this is an extract from the company's own website "},
{"employer_url": "https://www.seek.com.au/companies/ozhelp-foundation-945565", "employer_name": "Ozhelp Foundation", "employer_info": "OzHelp was founded in 2001 after the suicide of young Canberra man, David O’Bryan. David’s mother Lorraine worked with local organisations to put in place support services targeted at young men working in the construction industries, to help prevent other families experiencing the same loss.\n\nOur focus is still male-dominated industries such as building and construction, along with mining, trades and automotive industries. It is precisely because men are traditionally less likely to seek help that we seek them out and provide mental health support and training in their workplace, along with counselling.\n\nWe meet in an informal way with workers at work sites through barbeques and field visits. These visits are designed to let workers know what support is available if they’re having a tough time, and also to give advice about how to help a mate if they’re struggling.\n\nWe also offer a range of support services and training to both men and women in workplaces, including Employee Health and Wellbeing Programs.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/ocean-reef-primary-school-872612", "employer_name": "Ocean Reef Primary School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/oz-green-homes-806129", "employer_name": "Oz Green Homes", "employer_info": "OZ GREEN HOMES Pty Ltd strategically constructs branding and positively influences its future succession rather than merely creating a short term sales effect. Oz Green Homes is integrated marketing with a difference, encompassing all aspects of marketing including communication and sales channels such as telemarketing, email & fax Marketing and many other impacting strategies which in turn have proven to deliver a high return on investment. \n\nSource: This is an extract from the company’s own website."},
{"employer_url": "https://www.seek.com.au/companies/oyster-bay-public-school-872685", "employer_name": "Oyster Bay Public School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/alh-group-432530?child=995527", "employer_name": "ALH Group", "employer_info": "ALH Group helps people live it up at our leading portfolio of pubs across Australia. We offer a diverse hospitality experience including electronic gaming, sports bars, bistros, restaurants, cafes, retail liquor, accommodation, nightclubs and wagering. Our facilities are located in capital cities and urban and regional centres across Australia.\n\nWe employ over 15,500 people across Australia at more than 320 licensed venues and in excess of 550 retail liquor outlets.\n\nSource: this is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/oz-minerals-434002", "employer_name": "OZ Minerals", "employer_info": "OZ Minerals, formerly Oxiana Limited, was renamed following the merger of Oxiana with fellow Australian based miner Zinifex Limited in June 2008. The name OZ Minerals drew on the strong heritage of both companies. OZ Minerals is an Australian based modern mining company with a focus on copper. OZ Minerals' strategy is to create value for our shareholders and other stakeholders, with a focus on four areas: lean business, multiple assets, copper core and customer focus. OZ Minerals owns the Prominent Hill copper-gold mine and Carrapateena copper-gold project, both situated in South Australia.                                            Source: this is an extract from the company's own website"},
{"employer_url": "https://www.seek.com.au/companies/oxworks-814154", "employer_name": "Oxworks", "employer_info": "Oxworks manufactures and supplies factory direct fencing, gates, screens and balustrade. We stock a huge range of products & fencing supplies from DIY to Commercial projects. We specialise in the manufacture of glass, aluminium & steel products for home improvement and major project works.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/oxley-vale-public-school-872684", "employer_name": "Oxley Vale Public School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/oz-design-furniture-436302", "employer_name": "OZ Design Furniture", "employer_info": "We’ve been selling furniture and accessories to fit the Australian lifestyle for over 30 years.\n\nFrom fabric to leather sofas, entertainment units, dining tables, dining and bar chairs, occasional tables, storage and homewares, OZ Design's range of quality furniture is stylish and affordable, making decorating your home as easy and as rewarding as it should be.\n\nWe customise our gorgeous sofas to suit your style and fit your space. Our stylish dining settings are made to mix and match and there are hundreds of beautiful accessories to add colour and life.\n\nSource: This is an extract from the company's own website"},
{"employer_url": "https://www.seek.com.au/companies/oxley-state-school-819931", "employer_name": "Oxley State School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/oxley-park-public-school-872681", "employer_name": "Oxley Park Public School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/oxley-home-care-801442", "employer_name": "Oxley Home Care", "employer_info": "Oxley Home Care is an award-winning, nationally accredited family owned and operated business, based locally in Belrose NSW. For the last 10 years Oxley Home Care’s staff have been providing Private Care, Home Care, Nursing, Allied Health and Disability Support that enables people, regardless of their age, to live independently in their own home throughout the Sydney Metropolitan area.\n\nAs a Registered Nurse with over 30 years’ experience, founder Gilian Douglass is passionate about delivering a person centred approach to care, ensuring that her clients enjoy a better quality of life and maintain their social and community connections.\nOxley Home Care’s team of professional staff undergo a rigorous screening and training program to ensure they are qualified to care for our clients to the high standard we find acceptable. We take the time to get to know our clients so they can be matched with Care Workers perfectly suited to their needs and we pride ourselves on our ability to provide consistently reliable, punctual and professional services. \nSource: This is an extract from the company's own website"},
{"employer_url": "https://www.seek.com.au/companies/oxley-primary-school-872683", "employer_name": "Oxley Primary School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/oxley-high-school-872679", "employer_name": "Oxley High School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/oxley-college-801441", "employer_name": "Oxley College", "employer_info": "Mission Statement: Oxley Christian College is a Christian school committed to excellence of teaching and learning through which students develop their unique abilities in a secure yet stimulating environment. Each student is nurtured towards a personal faith in Christ, an understanding of Christian values and a commitment to serve God and His world.”\n\nOxley Christian College is a coeducational Christian day school with a total enrolment of around 1000 students. The Junior School includes the Early Childhood Centre; Kinderoo (3 Year olds) and Pre-School (4 Year Olds) through to Year 6; the Senior School encompasses Years 7 through 12.  Students in Years 7-9 are part of the ‘Middle Years’, while students in Years 10-12 are part of the ‘Senior Years’.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/oxley-island-public-school-872680", "employer_name": "Oxley Island Public School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/oxford-university-press-435419", "employer_name": "Oxford University Press", "employer_info": "Oxford is a world-leading centre of learning, teaching and research and the With more than 22,000 students, 13,000 staff and 230,000 alumni around the world, people are what make Oxford an internationally renowned university.oldest university in the English-speaking world.  \nThe University is committed to ensuring that our undergraduate admissions processes identify students with outstanding academic potential and the ability to benefit from an Oxford course whatever their background.  \nOxford's international profile rivals that of any university in the world, highlighted by the breadth and depth of its research collaborations and a truly global student body and academic staff.  \nSource: this is an extract from the company’s own website."},
{"employer_url": "https://www.seek.com.au/companies/oxigen-fitness-801440", "employer_name": "Oxigen Fitness", "employer_info": "START YOUR OWN OXIGEN CLUB OR REBRAND YOUR EXISTING CLUB\nclick here\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/oxley-christian-college-834632", "employer_name": "Oxley Christian College", "employer_info": "Oxley College is a coeducational Christian school, located in Chirnside Park, Melbourne. Oxley caters for preschool (3 Year Old Kinder) to Year 12 VCE, in preparation for University. \n\nOUR VISION: As a co-educational, multi-denominational Christian school, Oxley will provide Christ-centred education that has its foundations in Biblical truth. It will offer excellent educational opportunities from Pre-School to Year 12 through an academically sound, balanced and stimulating curriculum. The spiritual life of the College will nurture students towards maturity in Christ.”\n\nOXLEY CHRISTIAN COLLEGE was founded in 1979 with two key objectives: to achieve the highest academic standards and to do so within a non-denominational, distinctively Christian environment.  Still deeply committed to its founding principles, Oxley is widely recognised both for the excellence of its teaching and for the outstanding academic performance of its Year 12 students, of whom the majority gain entry each year into the university programs of their choice. \nSource: this is an extract from the company’s own website."},
{"employer_url": "https://www.seek.com.au/companies/alh-group-432530?child=995526", "employer_name": "ALH Group", "employer_info": "ALH Group helps people live it up at our leading portfolio of pubs across Australia. We offer a diverse hospitality experience including electronic gaming, sports bars, bistros, restaurants, cafes, retail liquor, accommodation, nightclubs and wagering. Our facilities are located in capital cities and urban and regional centres across Australia.\n\nWe employ over 15,500 people across Australia at more than 320 licensed venues and in excess of 550 retail liquor outlets.\n\nSource: this is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/oxford-falls-grammar-school-801439", "employer_name": "Oxford Falls Grammar School", "employer_info": "We are a Kindergarten to Year 12, co-educational, independent Christian school, set in a picturesque, semi-rural location on the Northern Beaches of Sydney.\n\nWe are dedicated to providing quality education within a caring, nurturing and empowering learning environment from Kindergarten to Year 12; one underpinned by a solid Christian foundation.\n\nWe focus on the development of the whole child – body, mind and spirit. We believe that an education encompasses more than academics and includes character and spiritual growth.  In partnership with you, we aim to produce educated young men and women who are tomorrow’s leaders; confident and self-motivated learners with the skills to discover and achieve their full potential in all areas of life.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/alh-group-432530?child=806122", "employer_name": "ALH Group", "employer_info": "ALH Group helps people live it up at our leading portfolio of pubs across Australia. We offer a diverse hospitality experience including electronic gaming, sports bars, bistros, restaurants, cafes, retail liquor, accommodation, nightclubs and wagering. Our facilities are located in capital cities and urban and regional centres across Australia.\n\nWe employ over 15,500 people across Australia at more than 320 licensed venues and in excess of 550 retail liquor outlets.\n\nSource: this is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/oxford-cold-storage-435684", "employer_name": "Oxford Cold Storage", "employer_info": "Oxford is Australia’s largest privately owned cold storage operator the the 20th largest cold storage operator in the world (by capacity).\n\nOxford is Australia’s leading privately owned cold storage company.\n\nOxford is a member of the (Oxford Logistics Group).\n\nMember companies specialise in operations, warehousing and transport based data capture hardware (Radio Terminal Systems) and shipping container storage services (Oxford Container Services).\n\nOxford is committed to providing quality warehousing and distribution solutions, at the best value, while still providing the highest level of customer service.\n\nSource: This is an extract from the company’s own website."},
{"employer_url": "https://www.seek.com.au/companies/oxfam-434589", "employer_name": "Oxfam", "employer_info": "We believe that poverty is unjustifiable and preventable, that the present state of inequality and injustice must be challenged, and that with the right help, poor people can change their lives for the better.\n\nOur vision\n\nOxfam’s vision is a just world without poverty. We envisage a world in which people can influence decisions that affect their lives, enjoy their rights, and assume their responsibilities—a  world in which everyone is valued and treated equally.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/oxford-436127", "employer_name": "Oxford", "employer_info": "Oxford was first established in 1978. The first store was opened in Sydney at Bondi Junction in Sydney's Eastern suburbs. The concept was initially conceived to provide a bridge between designer clothing and an overcrowded middle market that characterized Sydney retailing at the time. The brand successfully developed throughout the 1980's earning a reputation as an innovative, and sometimes 'quirky', alternative to many higher priced brands.\n\nBy 1990, the company opened a further 5 stores in Sydney that were located in the downtown area, as well as in the northern and eastern suburbs. Capitalizing on Oxford's enviable reputation for progressive and creative design, and now under new management, the company decided to pursue a growth strategy by opening an additional 20 stores in the new geographical markets of Melbourne, Canberra and Brisbane.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/ovolo-hotels-806402", "employer_name": "Ovolo Hotels", "employer_info": "We are a dynamic lifestyle hospitality company that provides guests with the BEST in effortless living because we know it’s all about YOU! We design and service our hotels from a traveler’s point of view with smartly spaced interiors full of the latest tech, luxury hotel amenities and fresh fun-loving features.\n\nBest of all, they are all free! That’s right, everything from the breakfast, mini-bar, Wi-Fi and even happy hour is all covered when you stay with Ovolo Hotels… And The Best Rates are all here on our website. Because we love you, man!\n\nSource: This is an extract from the company’s own website."},
{"employer_url": "https://www.seek.com.au/companies/oxenford-state-school-819787", "employer_name": "Oxenford State School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/ox-engineering-806121", "employer_name": "Ox engineering", "employer_info": "With over 15 years experience in drilling and mining, Ox Engineering provide design expertise, equipment, consulting and services to cover all areas of mineral drilling, earthmoving and general industry - large or small. \n\n1/3\n\n\n\nWith an innovative approach, extensive product line and fully equipped workshop, Ox engineers have the ability to redesign or custom build equipment to individual requirements that can improve productivity and ultimately lower your bottom line costs.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/overport-primary-school-872676", "employer_name": "Overport Primary School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/owen-primary-school-872678", "employer_name": "Owen Primary School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/overnewton-anglican-community-college-801436", "employer_name": "Overnewton Anglican Community College", "employer_info": "Overnewton college is divided in to four schools, Junior School for Pre to Year 4 conducted at both Taylors Lakes and Keilor. Middle School for Year 5 to Year 8 Students at both Taylors Lakes and Keilor, a transitional Year 9 program conducted at the 'Canowindra Centre' located at the Taylors Lakes campus and Senior School for Year 10 through to VCE located at the Keilor Campus. Class sizes from 24 in Junior School to 26 in Middle School, the small class sizes and four school approach provides ideal learning conditions for each development level and a smooth transition from prep through to VCE.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/overflow-group-435792", "employer_name": "Overflow Group", "employer_info": "The store with more than you bargain for!\nSource: this is an extract from the company’s own website."},
{"employer_url": "https://www.seek.com.au/companies/ouyen-p-12-college-875274", "employer_name": "Ouyen P-12 College", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/outotec-433527", "employer_name": "Outotec", "employer_info": "\r\n\r\n"},
{"employer_url": "https://www.seek.com.au/companies/outware-mobile-815199", "employer_name": "Outware Mobile", "employer_info": "SPECIALISTS IN CUSTOM MOBILE SOFTWARE DESIGN & DEVELOPMENT\n\nOur Vision is to make a difference through creating mobile experiences that are intuitive, effective and engaging.\n\nOur Mission is to turn good ideas into great mobile experiences by building robust partnerships with great clients and nurturing our team’s technical and creative skills.\n\nWe’re passionate about building great apps for our clients, with a focus on user experience design and technical excellence. We use the latest software engineering methodologies to ensure that every app we build is of the highest quality and that every project is delivered on-time and on-budget.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/outer-metropolitan-multi-purpose-correctional-centre-windsor-875273", "employer_name": "Outer Metropolitan Multi-Purpose Correctional Centre Windsor", "employer_info": "Outer Metropolitan Multi-Purpose Correctional Centre is a minimum security institution for male offenders that is within the John Morony Correctional Complex located 5 kilometres south of Windsor.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/outback-stores-867915", "employer_name": "Outback Stores", "employer_info": "Outback Stores was set up by a group of retailers from large supermarket businesses, such as Coles and Woolworths, with the support of Indigenous Business Australia and began trading in November 2006.  The company emerged from a need to improve the health of Indigenous people in remote Australia by addressing nutrition-related health problems, unreliable food supplies, stores closing because of poor management and build-up of debt.\n\nOnce the stores are commercially self-sufficient, the store owners work with the store committee to decide how to spend the profits for the benefit of the community, in line with the rules of individual Store Corporations.\n\n\nThe first official Outback Stores’ managed store opened at Canteen Creek in May 2007 and in June 2007 the Federal Government introduced its Northern Territory Emergency Response Bill to Parliament. As part of the intervention, Outback Stores was funded to support stores that were badly needed in communities but were facing closure due to poor management and build-up of debt. \n\nThe funding ensured these remote stores remained open to provide food security, keep local jobs and, if needed, upgrade the store’s infrastructure.  In 2009, Outback Stores was funded to support remote stores outside of the Northern Territory. The company now manages stores across the Northern Territory as well as in Western Australia and South Australia.\nSource: This is an extract from the company's own website"},
{"employer_url": "https://www.seek.com.au/companies/outdoor-fabrications-945338", "employer_name": "Outdoor Fabrications", "employer_info": "Outdoor Fabrications commenced trading in January 2000, when Managing Director, Derek Bayliss realised the need for a specialist outdoor advertising sign construction company. Up until this point, most if not all outdoor advertising signs were built by general steel fabricators and being designed by engineers having little to no experience with the intricate workings and needs of safe sign installation.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/outback-travel-centre-801426", "employer_name": "Outback Travel Centre", "employer_info": "Our story here in Western Australia began back in 2010, when the very poor quality of roadhouses and service stations was identified.  It was recognised that there needed to be better support for the professional road freight transport drivers, particularly on the long haul routes to the North West.\n \nAn exclusive partnership agreement with BP was founded to develop world class travel centres at regional locations; retailing fuel using the BP brand.\n \nThe Outback Travel Centre network began in Newman – when the ‘Capricorn Roadhouse’ or ‘Cappy’ as locals affectionately know it, was acquired. The roadhouse underwent an extensive redevelopment and is a major refuelling point for the transport industry in the Pilbara –boasting a full range of modern facilities and services.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/outliving-814283", "employer_name": "Outliving", "employer_info": "Founded in 2003, Outliving has become internationally renowned as a market leader in the gift and homewares industry. With a combination of products created and designed in-house, and a strong distribution model of segment leading global brands, we are key supply partners for retailers in Australia, United States, United Kingdom, Canada and New Zealand. \n \nOutliving’s customer base include most mid to high end major retailers, including Department stores (eg…Bloomingdales, John Lewis, Myer, David Jones, etc), apparel chains, giftware chains, stationery chains, plus literally thousands of boutique gift stores. We focus our time and effort in designing and sourcing the best products and offering the friendliest most efficient customer service.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/outback-steakhouse-433141", "employer_name": "Outback Steakhouse", "employer_info": "At Outback Steakhouse® we’re committed to providing you the best steak experience. We set our standards high and rigorously follow them. Our steaks are “wet-aged” in a controlled environment to ensure tenderness and seasoned with a secret blend of 17 herbs and spices.\n\nOur chefs understand the nuances of beef and are expertly trained to prepare a perfectly grilled steak. It’s how Outback can deliver a great tasting steak, every time.\n \nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/outback-jacks-433544", "employer_name": "Outback Jacks", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/ouse-district-school-872675", "employer_name": "Ouse District School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/ourimbah-public-school-872674", "employer_name": "Ourimbah Public School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/our-media-945272", "employer_name": "Our Media", "employer_info": "OurMedia isn’t your run of the mill media agency. We’re set up to be your media department – a flexible, hardworking extension of your business. \nThe 21st century media landscape is crowded, cluttered and chaotic. \n\nWhere others see a confusing kaleidoscope\nof media options... we see patterns, insights and strategies.\nWe work with agencies or direct with clients. Both ways get results thanks to our cutting-edge research and knowledge of the media landscape. \n\nWe’re small but not too small. Independent and robust.\n\nOur size helps us to adapt to any situation, with a tight-knit team willing to go the extra mile.\nWe're down to earth and easy to deal with. Experienced and smart. We work the way you like to work: on time, on budget and on target. \n\nOur senior team can work with you directly from start to finish, providing the expertise you need to reach your potential.\nSource: This is an extract from the company's own website"},
{"employer_url": "https://www.seek.com.au/companies/outback-logistics-806110", "employer_name": "Outback Logistics", "employer_info": "Outback Logistix Pty Ltd. has its headquarters in Adelaide, South Australia with offices in Moomba and Laura (SA) and Eromanga (Qld)\n\nOur vehicles service the complete needs of our customers, including their warehousing and distribution, mechanical repairs (in well-equipped workshops), dangerous goods transport (crude oil), fuel distribution, water transport, linehaul nationally on request, hot shots for the mining and exploration industry and providing labour hire as truck drivers and service personnel.\n\nThe Owner/Founder started working in Cooper Basin in 1996 managing workshops that serviced and maintained equipment for one of the country’s largest transport companies.\n\nIn August 2005 Outback Logistix was formed and commenced transporting for various companies nationally. In time Outback Logistix evolved and grew into a successful well respected company that has a core business of road trains transporting dangerous goods, as well as general transport and plant hire in the remote areas of SA and Qld.\n\nOur customer’s transport requirements are met in some of the most remote & harshest environment in the country. \n\nOur fleet includes modern prime movers, crude & water tanker trailers, drop deck trailers, side loader container lifter (20′ – 40′), flat top tri axle trailers, hire equipment includes, fork lifts, generators, containerised workshops, office/smoko/ablution blocks delivered to site. Outback Logistix is an EPA licenced company and has vacuum trailers available for clean-up tasks, pond skimming and tank emptying etc.\n\nOutback Logistix trucks are equipped to handle the toughest of conditions in the remote Australian Outback. Our fleet is also fitted with satellite tracking. This modern safety technology enables us to locate vehicles, monitor fuel usage, fleet servicing status, driver behaviour as well as giving us the ability to supply our customers with accurate arrival times and advise of any delays\nSource: this is an extract from the company’s own website."},
{"employer_url": "https://www.seek.com.au/companies/our-lady-of-the-sacred-heart-thamarrurr-861108", "employer_name": "Our Lady of the Sacred Heart Thamarrurr", "employer_info": "Our Lady of the Sacred Heart Thamarrurr Catholic\nSchool (OLSHTCS) is located at Wadeye (Port Keats) about 400kms SW of Darwin. Wadeye is an Indigenous community of 2500 people who come from 20 clan groups and make up 3 broad ceremonial groups across\na broad geographical area known as the Thamarrurr region.  \nPrimary and Secondary education are delivered on two campuses situated in close proximity and boasting a number of new, refurbished and proposed classrooms and facilities, including library, manual arts building, mechanical workshop, hospitality centre, science block, IT laboratory and art room. \nSource: this is an extract from the company’s own website."},
{"employer_url": "https://www.seek.com.au/companies/otway-health-795740", "employer_name": "Otway Health", "employer_info": "Otway Health is located in the picturesque harbour town of Apollo Bay, some 190km south west of Melbourne. We are block funded as a Multi-purpose Service (MPS) providing a wide range of clinical and community services to the catchment area from Lavers Hill to Wye River.\nThe diversity of our region and the challenges presented with offering services to cater for the 3,500 residents in the area (swelling to around 20,000 during the summer months) means the flexibility offered by our service is well-suited to this region.\nOur main challenge is our geographically isolated location. Apollo Bay is surrounded by the steep hills of the Otway Ranges and access to and from major towns is time consuming due to the steep terrain and winding road access. Travel times to Geelong are up to two hours in off peak times and are considerably longer during peak tourist times. Inland, the closest town is Colac, which is over an hours travel time, being 75 kilometres away. A lack of public transport, for all the communities in the southern part of the Colac Otway Shire, contributes to the geographic remoteness of the community.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/our-town-fencing-834410", "employer_name": "Our Town Fencing", "employer_info": "Our Town Fencing is a large corporation with a small town philosophy, with a strong community focus.\n\n\nWe have grown from humble beginnings, continually expanding and improving. We currently have a combined site area across our stores, and factories of over 8 acres (or 25 Olympic Swimming Pools*).\nWe believe strongly in fostering local talent, and employ over 60 staff at our many store locations. We have a commitment to equipping our dedicated staff with the latest skills, with comprehensive in house training programs, and a number of TAFE apprenticeships. We currently employ a diverse range of skilled staff including Boilermakers, Spray Painters, Welders, Freight Logistics Personnel, Managers, Human Resources Managers, IT Specialists, Professional Sales, and Customer Service Representatives.\nIn an effort to maintain our core values of high quality fencing products available to all Australians at a price that all can afford, we have established a large network of ever growing company stores, and distributors.\nMission Statement\nWe will continue to develop innovative fencing solutions for today & tomorrow by taking a leading role in our industry and setting the standards for quality, service & affordability.\n\n\n\nCore Values\n\n◦To be a better company tomorrow than we are today\n◦Offer industry leading service & value\n◦Manufacture & supply quality fencing products at competitive pricing\n\n\n\nProduct and Service Commitment\n\n◦We seek to make the Our Town Fencing purchasing experience unique in our market\n◦We aim to supply Australia's largest range of fencing material & accessories in stock today\n◦We will always seek to support the local economy by selecting Australian made raw material\n\n\n\nOur Responsibilities\n\n◦To our Customers: We believe we have a responsibly to our customers to ensure that the service and products we offer is leading our field\n◦To our Staff: Are the most important asset in our company and we always strive to make our work place safer & offer security of employment for now and the future\n◦To the Environment: We endeavour to use Environmental friendly material doing our small part in making Australia a safe place to live now and for our children\n\n\n\nOur Vision\n\n◦Build a visionary company that it continues to grow for generations to come\n◦Continually set new standards for customer service through teamwork and planning\n◦Foster an environment in our company, business partners, and beyond that encourages innovation in the workplace, industry, environment, and the community\nSource: this is an extract from the company’s own website."},
{"employer_url": "https://www.seek.com.au/companies/our-lady-of-the-visitation-school-taperoo-875270", "employer_name": "Our Lady of the Visitation School Taperoo", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/our-vacation-centre-813289", "employer_name": "Our Vacation Centre", "employer_info": "Imagine having the power and appeal of vacations through fully branded travel and cruise programs - with access to flights, cruises, hotels, resorts, tours, car rental and packaged products. Through our proven e-commerce platform, partnered with a full-service, state of the art call centre, customer service and fulfillment operations, OVC can give you that power.\n\nOVC continually cultivate powerful, long-standing relationships with every major cruise line across the globe, and further strengthen its product lines with the addition of more than 30,000 high quality resort and hotel options and a broad range of worldwide experiential tours.\n\nWith the implementation of innovative sales and marketing programs together we can deliver the dream of cruising to your consumers and vacationers worldwide.\n\nSource: This is an extract from the company’s own website."},
{"employer_url": "https://www.seek.com.au/companies/ottoway-fabrication-945229", "employer_name": "Ottoway Fabrication", "employer_info": "To be Australasia’s leading service provider of integrated manufacturing services to key industries including heavy engineering, mining, defence, water, energy and renewable resources sectors; \n \nTo use our expertise as a prime contractor to deliver value to our customers in design, engineering, manufacturing, project management, procurement and on-site services; \n \nTo create stakeholder value through our skilled and dedicated workforce and shared commitment to safety, quality and the environment.\n\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/ottoway-engineering-434185", "employer_name": "Ottoway Engineering", "employer_info": "The company operates its own fabrication workshops which support the construction installation and commissioning teams.  This enables the company to offer complete project management from design through to commissioning.  Ottoway Engineering has successfully completed a range of projects throughout Australia and maintains a permanent presence in the Cooper Basin servicing long term customers Santos and Beach Petroleum, in the Oil and Gas Industry.  The company has a strong focus on working safely, maintaining ongoing training in safe work practices and a proactive approach to environmental and risk management.\n\nSource: this is an extract from the company's own website"},
{"employer_url": "https://www.seek.com.au/companies/otraco-436655", "employer_name": "Otraco", "employer_info": "Otraco International  (Otraco) is the world leader in off-the-road (OTR) tyre management. Our credentials are based on a proven ability to deliver maximum value for our clients’ operations by reducing tyre operating costs, increasing productivity and enhancing safety. \n\nWe are a truly global company, with over 40 tyre management service contracts in Australia, New Zealand, South America, Southern Africa and Asia. Our clients include Rio Tinto, BHP Billiton, Anglo American , Debswana, Codelco, Fortescue Metals, BMA Coal, Newcrest, Newmont, Barrick and Peabody Energy. \n\nWe work with the world’s leading mining businesses at both site and head office levels – helping them reap the multiple benefits of excellence in tyre management.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/otto-restaurant-801410", "employer_name": "Otto Restaurant", "employer_info": "Modern \nItalian cuisine\n\nOTTO REINVENTS the flavours of Italy in stylish new forms.\n\nOTTO is committed to providing exceptional service and a beautiful dining experience through a talented team of management, chefs, sommeliers, and wait staff.\n\nSource: this is an extract from the company’s own website."},
{"employer_url": "https://www.seek.com.au/companies/otoc-436803", "employer_name": "OTOC", "employer_info": "OTOC Limited is the parent company of Bosco Jonson, Geo-Metric, OTOC Australia, THG and Whelans. Together, these companies form the OTOC Group.\n\nWith offices across Australia, the Group has the expertise and experience to support and satisfy clients throughout Australia; ensuring the best possible quality and consistency of service.\n\nOur primary objective is to provide increased value to stakeholders of the Group; including our clients, shareholders, employees and the communities in which we work.\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/ostara-australia-437042", "employer_name": "Ostara Australia", "employer_info": "\r\n\r\n"},
{"employer_url": "https://www.seek.com.au/companies/osullivan-beach-primary-school-872671", "employer_name": "O'Sullivan Beach Primary School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/otis-elevator-company-435831", "employer_name": "OTIS Elevator Company", "employer_info": "Otis is the world's largest manufacturer and maintainer of people-moving products, including elevators, escalators and moving walkways. Founded more than 160 years ago by the inventor of the safety elevator, Otis offers products and services through its companies in more than 200 countries and territories, and maintains approximately 1.9 million elevators and escalators worldwide. Otis is a unit of United Technologies Corp., a leading provider to the aerospace and building systems industries worldwide.\n\nSource: This is an extract from the company's own website"},
{"employer_url": "https://www.seek.com.au/companies/ossa-services-814056", "employer_name": "OSSA Services", "employer_info": "OSSA Services is a fully Australian owned and operated company that offers a unique, low cost, one-stop building service. With over 20 years experience we are one of Australia and New Zealand’s leading providers of quality building and asset maintenance services. OSSA Services can be of service to businesses by making property services and maintenance of sites easy and efficient to manage.\n\nOur unique software system and operational processes are proven, yet entirely flexible and we are able to offer our clients as much or as little assistance as they may require. Working from our state of the art Response Centre in Melbourne, we are open 24 hours 7 days a week, 365 days a year and we can provide services to companies in all parts of Australia and New Zealand.\n\nThe OSSA Services team is divided into 3 separate departments, Building and Design, Response Centre and Special Projects, each headed by fully qualified staff. OSSA Services also provides Essential Services, Programmed Maintenance, After Hours, Procurement and Insurance services.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/otford-public-school-872672", "employer_name": "Otford Public School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/osmoflo-water-management-813329", "employer_name": "Osmoflo Water Management", "employer_info": "Osmoflo is a global desalination and wastewater treatment company. Located across Australia, the Middle East, South America and Asia, Osmoflo offers international coverage of its world class capabilities in delivering water and wastewater treatment solutions.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/oshclub-434070", "employer_name": "OSHClub", "employer_info": "\n\n"},
{"employer_url": "https://www.seek.com.au/companies/osi-international-foods-806558", "employer_name": "osi international foods", "employer_info": "Since OSI opened its first family meat market in Chicago in 1909, one thing has remained steadfast: our unwavering dedication to our customers' success.\n\nThat is why many of the world's leading brands regard us as their premier global food provider. They trust OSI to consistently deliver leading-edge food solutions for their most exacting product development and processing needs. Solutions that deliver quality, value, and streamline processes while optimizing costs.\n\nSource: This is an extract from the company's own website"},
{"employer_url": "https://www.seek.com.au/companies/ostwald-bros-433165", "employer_name": "Ostwald Bros", "employer_info": "The safe and efficient extraction of energy demands capable contractors. Ostwald Bros is a Resources and Infrastructure Services Group with a unique combination of experience, superior logistics and local knowledge that enables us to deliver projects on time and in the most affordable way.\n\nWe own and operate a large fleet of Caterpillar construction plant and equipment, and provide complete mechanical maintenance and servicing through our modern workshop facilities.Our services extend to asset maintenance and field roustabout services to the sectors in which we operate.\n\nSource: this is an extract from the company's own website"},
{"employer_url": "https://www.seek.com.au/companies/osd-814641", "employer_name": "OSD", "employer_info": "OSD is a leading engineering, operations and commercial services provider that provides whole of life services to asset owners in a range of market sectors including oil & gas, pipelines & facilities, process & refining, water & hydrotransport.\n\nBy having a sound technical and commercial understanding of the pipeline industry, our core team of specialists are able to quickly identify the most feasible and practical solutions for our clients.\n\nOSD is a leading engineering, operations and commercial services provider to asset owners in a range of market sectors including oil & gas, pipelines & facilities, process & refining, water & hydrotransport.\n\nOSD has substantial experience in multi-discipline engineering as well as all aspects of asset operations and maintenance support.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/oscars-hotels-437571", "employer_name": "Oscars Hotels", "employer_info": "Welcome to Oscars Group\n\nAn exciting and diverse group of venues across Sydney & The South Coast.\n\nBOOK YOUR FUNCTION\n\nWith venues from the Sydney CBD to Wollongong, you will find the perfect hotel to suit you.\nWhatever the event, Oscars will cater to your every need.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/osbornes-flat-primary-school-872669", "employer_name": "Osbornes Flat Primary School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/osborne-primary-school-vic-988259", "employer_name": "Osborne Primary School VIC", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/oscar-oscar-salons-752995", "employer_name": "Oscar Oscar Salons", "employer_info": "Oscar Oscar salons has celebrated over 25 years of creating award winning and glamorous hair under the direction of celebrity hairdresser Oscar Cullinan, twice awarded Australian Hairdresser of the Year.\n\nA privately owned company in premium locations, Oscar Oscar Salons employ over 200 staff across 15 salons throughout Melbourne, Sydney, Brisbane and the Gold Coast.\n\nOscar Oscar Salons is also home to some of Australia's best hairdressers, who are regularly involved in events such as Australian Fashion Week and frequently feature in Australia's leading fashion magazines for their expert hair advice and styling tips.\n\nThe team from Oscar Oscar Salons are renowned for creating more than just beautiful hair. They aim to create the best hairdressing experience in Australia with luxury services, the world's best hair-care and styling products, relaxing treatments, indulgent client refreshment menus and sleek salon designs."},
{"employer_url": "https://www.seek.com.au/companies/osborne-state-school-820335", "employer_name": "Osborne State School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/osborne-park-hospital-795998", "employer_name": "Osborne Park Hospital", "employer_info": "Welcome\n\nWelcome to Osborne Park Hospital (OPH) which was established in 1962.  OPH is part of the Sir Charles Gairdner Osborne Park Health Care Group, part of the North Metropolitan Health Service and we participate in area-wide partnerships to augment and enhance health care delivery. \nOPH is a community general hospital providing comprehensive specialist health care services for the north metropolitan suburbs. The services at OPH are provided by three main specialties consisting of Rehabilitation and Aged Care, Surgical and Women’s and Newborn. Each of these specialties has a dedicated Allied Health Team. Supporting these specialties are hospital wide services including Infection Prevention and Control, Diabetes Inpatient and Community Services, Pharmacy, Pathology and Radiology. \n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/oscan-windows-806096", "employer_name": "Oscan Windows", "employer_info": "Oscan Windows is an Australian owned and operated company, born out of necessity for a quality product by founder and Director Dean Clavarino.\n\nDean has been involved in the  industry for over 20 years in which time he has seen many changes.  Recently he made the decision to step up production in Oscan Windows which he established in 2005.\n\nSince making the decision to up scale Oscan Windows it has flourished into an operation employing 15 staff, including 2 estimators, 1 draftsman, Office Manager, 4 Fabricators, 4 Installers on site and 2 Glaziers.\n\nOscan Windows have now moved into larger premises with a view to continue to expand and develop its product range and expertise.  A showroom is currently under construction and will display a range of products for the convenience of all Oscan Windows customers.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/orrvale-primary-school-872668", "employer_name": "Orrvale Primary School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/orroroo-area-school-872665", "employer_name": "Orroroo Area School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/orourke-realty-investments-806092", "employer_name": "O'Rourke Realty Investments", "employer_info": "Oscan Windows is an Australian owned and operated company, born out of necessity for a quality product by founder and Director Dean Clavarino.\n\nDean has been involved in the  industry for over 20 years in which time he has seen many changes.  Recently he made the decision to step up production in Oscan Windows which he established in 2005.\n\nSince making the decision to up scale Oscan Windows it has flourished into an operation employing 15 staff, including 2 estimators, 1 draftsman, Office Manager, 4 Fabricators, 4 Installers on site and 2 Glaziers.\n\nOscan Windows have now moved into larger premises with a view to continue to expand and develop its product range and expertise.  A showroom is currently under construction and will display a range of products for the convenience of all Oscan Windows customers.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/orora-813283", "employer_name": "Orora", "employer_info": "About Orora - the facts\nOrora Ltd is headquartered in Melbourne, Australia. The company was created in 2013 after Amcor, one of the world's largest packaging companies with a 150 year history in Australia, demerged their Australasian and Packaging Distribution businesses. \n\nHere are the key facts about Orora.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/orrcon-steel-434229", "employer_name": "Orrcon Steel", "employer_info": "At Orrcon Steel we strongly believe that people are the essential foundation to our long term success, that’s why we are big on developing our employees to their full potential.\n \nOur doors are always open to fresh ideas and talent and we value diversity and promote an inclusive and supportive work environment for all. Join us and you’ll find a culture of openness and trust that encourages you to achieve.\n \nClick on an image and see what we’re about…\n \n Source: This is an extract from the company's own website"},
{"employer_url": "https://www.seek.com.au/companies/orontide-435248", "employer_name": "Orontide", "employer_info": "ORONTIDE is a leading Western Australian company that has been providing specialist engineering, preservation and maintenance services to the Mining and Resources; Oil and Gas; and Defence and Commercial Marine industries for over 35 years.\n\nORONTIDE's focus is on providing high quality maintenance engineering and surface treatment services designed to extend plant and equipment life, improve operating efficiencies and lower costs.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/oroton-434823", "employer_name": "Oroton", "employer_info": "OrotonGroup Limited, is a Sydney based publicly-listed retail company with over 80 stores across Australia, New Zealand, Singapore, Malaysia, and China. Our group was founded in 1938 and began life as an international fashion textile importer before developing the iconic Oroton luxury brand, made famous by its metallic mesh handbags and accessories.\n\nIn more recent years, in addition to its own brand Oroton, OrotonGroup has also been a leader in the distribution of international premium brands in Australia and New Zealand. Until June of 2013, OrotonGroup was the exclusive licensee for the Ralph Lauren apparel brand, a mutually successful relationship that lasted over 23 years. In 2013 the group took over the distribution of the Gap brand and partnered with Brooks Brothers, America's oldest clothing company, to launch the iconic brand here in Australia & New Zealand. OrotonGroup is committed to utilising its best in practice retail and branding expertise in the ownership and distribution of international premium brands.\n\nSource: This is an extract from the company’s own website."},
{"employer_url": "https://www.seek.com.au/companies/orocobre-995266", "employer_name": "Orocobre", "employer_info": "Orocobre Ltd is building a substantial Argentinian-based industrial chemicals and minerals company through the construction and operation of its portfolio of lithium, potash and boron projects and facilities.\n\n\t\n\nOrocobre is dual listed on the Australian Securities Exchange (\"ASX\") under the symbol \"ORE\" and on the Toronto Stock Exchange (“TSX”) under the symbol \"ORL\". The Company is included in the S&P/ASX 200 Index.\n\nAs a leading company in Argentina's “Lithium Triangle”, Orocobre has built the first large–scale, de-novo brine based lithium project in over 20 years at its flagship Salar de Olaroz resource. The Olaroz Lithium Facility began as a joint venture project built in partnership with Japanese trading giant Toyota Tsusho Corporation (\"TTC\") and the mining investment company owned by the provincial Government of Jujuy, Jujuy Energia y Mineria Sociedad del Estado (\"JEMSE\").\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/ors-group-434643", "employer_name": "ORS Group", "employer_info": "\n\n"},
{"employer_url": "https://www.seek.com.au/companies/ormond-college-801395", "employer_name": "Ormond College", "employer_info": "Ormond is the largest residential college of the University of Melbourne. We are an active, vibrant and diverse community of undergraduates and graduates. We create a learning and living experience like no other to foster the next generation of local and global leaders.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/ormiston-state-school-820524", "employer_name": "Ormiston State School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/ormond-primary-school-872664", "employer_name": "Ormond Primary School", "employer_info": "Ormond School Profile 2017\nOrmond Primary School was founded in 1891 and is committed to providing a nurturing and stimulating environment which allows all children to be challenged, guided and engaged in their learning. As a learning community, Ormond Primary School aspires for all children to develop a love of learning and to value lifelong skills and knowledge.\nOrmond Primary School is a school of 415 students located in the suburb of Ormond in the Southern Metropolitan Region. The school is housed in attractive and well maintained grounds and buildings. The school’s excellent facilities include the original 1916 ground floor brick building and the double-storey 1927 Building which includes well-resourced and maintained classrooms, computer laboratory, staff, first aid, reception and office facilities.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/ormeau-woods-state-high-school-819536", "employer_name": "Ormeau Woods State High School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/orlando-wines-436602", "employer_name": "Orlando Wines", "employer_info": "As a business unit of Premium Wine Brands, Orlando Wines manages the worldwide marketing of the Group's Australian wine brands, as well as winemaking and viticulture. \n\nOrlando Wines and Wyndham Estate have been involved in the Australian wine industry from its infancy. Today, Orlando Wines is a leader in the Australian wine industry and includes prominent Australian wine brands such as Jacob's Creek, Wyndham Estate, Richmond Grove, Morris and Trilogy.  \nSource: This is an extract from the company's own website"},
{"employer_url": "https://www.seek.com.au/companies/ormeau-state-school-820262", "employer_name": "Ormeau State School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/orix-815183", "employer_name": "ORIX", "employer_info": "ORIX Australia\n\nORIX Australia was established in Sydney in 1986 and quickly grew to become a major force in the commercial finance and leasing markets. Our Head Office is located in Macquarie Park, Sydney, with offices located in all major cities of Australia and New Zealand. We currently employ more than 300 staff and own or manage assets with a value of circa A$1Bn.\n\nWe specialise in the acquisition, financing and management of motor vehicles and other forms of transport. We are not owned by a bank or vehicle manufacturer which enables us to provide complete objectivity regarding finance and vehicle choice.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/orlando-drilling-752977", "employer_name": "Orlando Drilling", "employer_info": "\"Orlando Drilling Pty Ltd is an established West Australian Reverse Circulation (RC) Drilling contractor servicing the exploration and mining industry. Our key to success is a professional approach on exceeding industry safety levels and maintaining high productivity.\n\nSource: this is an extract from the company's own website.\""},
{"employer_url": "https://www.seek.com.au/companies/orion-transport-945035", "employer_name": "Orion Transport", "employer_info": "Orion Transport is a fast growing company dedicated to the provision of services including Transport, Logistics and Human Resources Management Solutions to Australia's leading companies.\n\nThe company is focused on the FMCG industry and is well regarded for its passion, expertise and commitment in assisting clients achieving a successful and measurable Human Resource and Transport operations for their business.\n\nBy developing specific and measurable strategies to meet your business' objectives and budgets our company works close with you and your team to ensure the successful tracking, measuring and implementation of your business strategies.\n\nOrion's expertise is in the ability to successful train and retain staff to perform at their best, at all times while maintaining corporate morale high and achieving operational and customer's goals.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/orion-state-school-819840", "employer_name": "Orion State School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/origin-kebabs-436601", "employer_name": "Origin Kebabs", "employer_info": "Origin Kebabs are the healthiest alternative meal in the foodcourt.\n \nUnlike most, our products are prepared by Origins Central Kitchen. It is accredited with SGS HACCAP World Standard certification. \n\nOur Central Kitches suppliers are of the highest quality, reputable and trusted brands like steggles. We use only 100% low fat export quality Australian Beef and lamb.\nAt Origin stores, we provide our customers with value-added service, with Kebab products, Falafel options, Potato variations, Sweets and Beverages. \n\nStore locations are selected very carefully and our outlets are dedicated to providing customers with the highest-quality takeaway or sit in kebab related products. \n \nOur system of service, is one of the easiest, quick serve kebab outlets in the country. Our smiles and laughter demonstrates the confidence in our product and service. Fast, super friendly service and fresh product is our key to keeping customers frequent.\n \nAt Origin, we have all the benefits of a franchise but do not have all the expenses and the pretentious expenses a franchise demands.  \n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/origo-education-801377", "employer_name": "Origo Education", "employer_info": "ORIGO was established in 1997 when co-founders James Burnett and Dr Calvin Irons identified the need to meet a growing demand for professional development in mathematics. With the vision of making a positive contribution to children’s education, James and Cal began writing and producing mathematics resources from a makeshift office in James’ home. Today, ORIGO provides and publishes a complete education solution to its customers by combining an innovative range of mathematics products with quality professional learning services.\nOriginally trading as Prime Education, in 2003 the company name was changed to ORIGO – Latin for “original” or “the source” – reflecting their commitment to ORIGO becoming the premier source of inspiration for math teachers. Their product range illustrates this commitment, with a diverse selection of creative products that bring a renewed enthusiasm to students’ learning experience.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/origin-energy-432337", "employer_name": "Origin Energy", "employer_info": "Origin is Australia’s leading integrated energy company, employing around 6,000 people, more than 40 per cent of whom are female. Since listing on the Australian Securities Exchange (ASX) in 2000, Origin has achieved significant growth and is a top ASX company by market capitalisation – and we believe in providing a more reliable, affordable and sustainable energy future. \nWe’re also committed to powering dynamic and challenging career opportunities. Because we’re involved in every stage of the energy supply chain, we’re always looking for highly skilled and motivated people to join us in the exploration, production, generation and selling of energy. We are focused on ensuring that all of our people have the right skills and opportunities to contribute to the business and reach their own career goals.\n\nSource: this is an extract from the company's own website"},
{"employer_url": "https://www.seek.com.au/companies/original-mattress-factory-834432", "employer_name": "Original Mattress Factory", "employer_info": "We eat, sleep and breathe mattresses\n\n\nUnlike other mattress retailers, we don't sell bedroom furniture, colour-coordinated cushions, fancy lamp shades or wall mirrors. That's because all we sell are mattresses. And because that's all we do, we pride ourselves on knowing more about mattresses than anyone else. Which might make us a little bit dull at dinner parties but great people to know when you're looking for a new mattress.\nSource: this is an extract from the company’s own website."},
{"employer_url": "https://www.seek.com.au/companies/orient-capital-436844", "employer_name": "Orient Capital", "employer_info": "Orient Capital is a global leader in share ownership analysis, market intelligence, investor communication, proxy solicitation and shareholder management technology.\n\nWe are the largest analyser of share registers globally and the dominant provider of equity ownership analytics in multiple markets. We help listed companies identify and track their shareholders, as well as their behaviour, using either local ownership disclosure provisions or our own proprietary methodologies."},
{"employer_url": "https://www.seek.com.au/companies/orica-432632", "employer_name": "Orica", "employer_info": "An Australian mining services company with global operations, Orica has a diverse workforce of over 12,000 people servicing customers across more than 100 countries.\n\nOrica’s global vision is to provide Clever Resourceful Solutions to customers around the world. We are focused on developing long term partnerships that reduce total cost of mining, improve productivity and enhance our customers’ licence to operate. We combine the progressive thinking of our Global Research & Development and Technical networks to deliver market-leading solutions for the challenges our customers face every day.\n\nWe are the largest provider of commercial explosives and blasting systems to the mining, quarrying, oil and gas and construction markets, a global leader in the provision of ground support in mining and tunnelling, and a leading supplier of sodium cyanide for gold extraction.\n\nOur strategy is to create sustainable shareholder value through customer focused, innovation led differentiated solutions. We ensure security of supply for our customers through a global portfolio of capital efficient manufacturing and distribution assets and effective third-party sourcing arrangements.\n\nOrica’s commitment to the safety, health and wellbeing of our people and customers, the environment, and the communities in which we operate underpins everything we do.  The principles of respect, transparency, collaboration and performance will guide us as we deliver on our strategy and vision."},
{"employer_url": "https://www.seek.com.au/companies/orelia-primary-school-872662", "employer_name": "Orelia Primary School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/orford-primary-school-872663", "employer_name": "Orford Primary School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/ord-minnett-436802", "employer_name": "Ord Minnett", "employer_info": "Ord Minnett is a leading private wealth management group that has been successfully advising Australian investors for over 140 years. We uphold traditions of integrity, service excellence and quality financial advice. Ords tailors investment solutions to help clients achieve their financial goals.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/orchard-hills-public-school-872661", "employer_name": "Orchard Hills Public School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/orchid-furniture-944889", "employer_name": "Orchid Furniture", "employer_info": "With over 10 years’ experience in the industry, Orchid Furniture is proud to be an Australian owned company, with our products made right here at our joinery factory in Victoria.\n \nManufacturing our products locally means that we can offer fast delivery, and ensure that every piece is made to a high standard, from top quality materials. It also means that we are contributors to our local economy, creating jobs in Australia and working to keep our industry active and functioning on our own shores.\n \nAt Orchid, we take great pride in our work and derive satisfaction from serving our customers well. Our joinery manufacturing plant is equipped with the latest computer controlled board storage, cutting and machining facilities. We also have our own painting and assembly resources, enabling us to provide volume joinery to a budget, right through to superior quality fixtures to suit any high-end retail outlet.\n \nWe specialise in the commercial and retail sectors and are well-suited to providing volume fixtures for national rollouts or multi-level office and apartment fitouts.\n \n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/osborne-primary-school-wa-988260", "employer_name": "Osborne Primary School WA", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/orbost-secondary-college-872659", "employer_name": "Orbost Secondary College", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/orbost-regional-health-795739", "employer_name": "Orbost Regional Health", "employer_info": "Rural Northwest Health is a Victorian public sector health service created under the Health Services Act and responsible to the Minister for Health. \u2028The population of the communities served by Rural Northwest Health is about 4866 people (ABS Census data 2006) within the Yarriambiack Shire. Rural Northwest Health covers the northern part of the Shire and shares the southern part with Dunmunkle Health Services. Between our three campuses at Warracknabeal, Beulah and Hopetoun we provide a comprehensive range of acute, aged, and primary health services to the local community.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/ors-recreational-trails-795913", "employer_name": "ORS Recreational Trails", "employer_info": "The state recreational trail network provides walking, cycling and horse riding experiences.  The Mawson Trail with hubs at Melrose, Cudlee Creek and Riverton, the Riesling Trail Network, the Kidman Trail, the Blinman Pools walking trail and the Tom Roberts and Kersbrook Horse trails are part of this network.\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/orbost-primary-school-872658", "employer_name": "Orbost Primary School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/orbit-homes-806080", "employer_name": "Orbit Homes", "employer_info": "Build the home you’ve been dreaming about with Orbit Homes.\nOur experienced home builders have been building new homes in Melbourne and Brisbane for over 35 years and are dedicated to the highest quality workmanships.\n\nSource: this is an extract from the company’s own website."},
{"employer_url": "https://www.seek.com.au/companies/orc-international-435274", "employer_name": "ORC International", "employer_info": "ORC International is a leader in the art of business intelligence. Passionate about growing your business, we help you explore, navigate, and integrate insights creatively to uncover what truly engages people around the world. We combine quality data, smart synthesis and a best-in-class digital platform to deliver transformative business insights and strategies across our clients’ customers, employees, markets, and products.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/orbost-north-primary-school-872657", "employer_name": "Orbost North Primary School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/orbit-fitness-801366", "employer_name": "Orbit Fitness", "employer_info": "Orbit Health & Fitness Solutions was established in 1983 as a direct response to the growing demand for home fitness equipment.\n\nNow the largest supplier of fitness equipment in Western Australia, is a WA family-owned and operated business with 8 retail outlets, - Osborne Park, Cannington, Booragoon. Joondalup, Malaga, Rockingham, Bunbury & Mandurah. We hold the major share of the speciality fitness market in Western Australia & are major supplier in the domestic, corporate & commercial market.\n\nWith nearly 30 years experience Orbit Fitness Equipment boasts an extensive range of fitness equipment in terms of both breadth and depth. Orbit has been consistent in developing its own exclusive range of equipment over the part 10 years. Hundreds of products are branded Orbit, which include Treadmills, Ellipticals, Exercise bikes, Rowing Machines, Home Gyms, Steppers, Vibration machines, Weight training Benches, Dumbells, Exercise Balls, and much more, making it a well-known fitness brand Australia wide.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/orbitas-resource-recovery-944859", "employer_name": "Orbitas Resource Recovery", "employer_info": "Established in 2007, Orbitas has become an industry leader in providing innovative resource recovery solutions and management programs that meet the needs of business and the environment. We are stakeholders in various ‘state-of-the-art' recovery facilities and operations.\n\nOrbitas's Australia-wide dedicated Agency and Service Provider network provides solutions for recycling and reprocessing of Used Lead Acid Batteries (ULAB) and Used Non Lead Acid Batteries (UNLAB).\n\nOur team delivers a consistent, professional outcome in all aspects of recycling including collection, identification, packaging, documentation, material disposal certificates and transportation - all within best practice and legislative guidelines. We are committed to protecting the environment. Our aim is to assist our clients and business partners to do the same.\n\nOrbitas is the only truly national network providing innovative tailored business solutions and marketing programs:\nSource: This is an extract from the company's own website"},
{"employer_url": "https://www.seek.com.au/companies/orchard-grove-primary-school-872660", "employer_name": "Orchard Grove Primary School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/orbit-drilling-944861", "employer_name": "Orbit Drilling", "employer_info": "Orbit Drilling is committed to the 'Pursuit of Excellence' in meeting our clients needs\n\nWe are the driving force in exploration leading in service delivery to our clients. Headquartered in Flynn Central Business Park, Perth, Western Australia is the primary link to our modern environmentally friendly high performance fleet of Drill Rigs that have the capability to conduct a comprehensive range of drilling techniques including: Reverse Circulation; Diamond Drilling; Aircore; Rotary Air Blast and Mud Rotary. They are fully maintained by a team of mechanics based within the head office complex and rostered in remote areas of Australia. \n\nOrbit Drilling's support vehicles allow us to mobilise staff, equipment and consumables efficiently. Our fleet of caravans provide state of the art on-site accommodation. \n\nOur Senior Management team has over 60 years exploration drilling experience together with our hand picked team we are the leading edge of professional expertise, building long-term sustainability that drives the future of the company in Mineral Exploration, Water Well Drilling and Geotechnical in the pursuit of excellence. \n\nWe have built a leading reputation in providing services to clients locally and in remote locations throughout Australia. We are committed to exceed environmental standards and find new ways to incorporate sustainable outcomes for future generations.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/orange-public-school-872654", "employer_name": "Orange Public School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/orara-high-school-872655", "employer_name": "Orara High School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/orara-upper-public-school-872656", "employer_name": "Orara Upper Public School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/orange-grove-public-school-872650", "employer_name": "Orange Grove Public School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/orange-high-school-872653", "employer_name": "Orange High School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/orange-business-services-432981", "employer_name": "Orange Business Services", "employer_info": "\n\n"},
{"employer_url": "https://www.seek.com.au/companies/orange-health-service-872652", "employer_name": "Orange Health Service", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/oran-park-public-school-872646", "employer_name": "Oran Park Public School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/orama-public-school-872645", "employer_name": "Orama Public School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/orange-east-public-school-872648", "employer_name": "Orange East Public School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/orange-grove-primary-school-872649", "employer_name": "Orange Grove Primary School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/orana-incorporated-814985", "employer_name": "Orana Incorporated", "employer_info": "Orana creates opportunities for people with disability to live and work within their local community, fulfill their dreams and become valued and productive community members.\n\nWe currently provide employment, housing, respite and life skills support to over 650 South Australians living with disability.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/orana-heights-public-school-872647", "employer_name": "Orana Heights Public School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/oracle-432471", "employer_name": "Oracle", "employer_info": "We are a world leader in the rapidly changing environment of communications technology – providing equipment, software and services to enable transformation through mobility.\n\nSome 40 percent of global mobile traffic runs through networks we have supplied. More than 1 billion subscribers around the world rely every day on networks that we manage. With more than 37,000 granted patents, we have one of the industry's strongest intellectual property rights portfolios.\n\nOur leadership in technology and services has been a driving force behind the expansion and improvement of connectivity worldwide. We believe that through mobility, our society can be transformed for the better.\n\nSource: this is an extract from the company's own website"},
{"employer_url": "https://www.seek.com.au/companies/oral-health-services-tasmania-801347", "employer_name": "Oral Health Services Tasmania", "employer_info": "Oral Health Services Tasmania provides the following dental services to eligible Tasmanians\n\nPriority Care: Treatment for urgent dental needs\nGeneral Care: Routine treatment which includes check-ups, fillings, extractions and other dental services\nDenture Services: Provision of full and partial dentures and other related services\nDental services for adults are provided from the five major dental centres in Burnie, Devonport, Launceston, Clarence and Hobart.\n\nDental services for children and adolescents are provided from the five major centres plus additional sites in urban and rural settings across the State.\n\nOral Health Services Tasmania also provides dental services to people who, due to various health conditions, require dental treatment within a hospital setting. These services are provided in Special Care Dental Units located at the Royal Hobart Hospital and the North West Regional Hospital.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/optus-business-centre-753143", "employer_name": "Optus Business Centre", "employer_info": "Take your first step to small business success: stop in at your local Optus Business Centre and speak to one of our Business Specialists. They can help you choose the best mobile or broadband plan for your business, in your area. \nWe're investing in our networks. In our staff. And in sustainability. At Optus, we’re invested in giving Australians choice and keeping you connected.\nBeing an Optus customer means a mobile network that is getting stronger and reaching more Aussies, in more places every day, great value offers through our customers rewards program, and a growing range of entertainment options offering a variety of unique content and exclusive access.  \nSource: This is an extract from the company's own website"},
{"employer_url": "https://www.seek.com.au/companies/optus-432323", "employer_name": "Optus", "employer_info": "Optus is a wholly owned subsidiary of Singtel, Asia’s leading communications group. The Singtel Group is Asia’s leading communications group with operations in more than 20 countries worldwide. With over 130 years operating experience, Singtel drives the Group’s efforts to lead in communication services throughout Asia and Africa as well as to front the local digital and enterprise markets. As the Australian arm of Singtel, Optus services over ten million customers each day. It provides a broad range of communications services including mobile, telephony, business network services, internet and satellite services and subscription television.\n\nSource: this is an extract from the company’s own website."},
{"employer_url": "https://www.seek.com.au/companies/optum-health-and-technology-814617", "employer_name": "Optum Health & Technology", "employer_info": "OUR MISSION\n\n \nWe are helping to make the health system work better for everyone.\n\nSCROLL\n\n \nWe collaborate with partners across the system to lead change in health care.\n\nTogether, we are transforming health care for a better future for everyone we serve. Our partners choose us for our combination of unique capabilities.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/optiver-810272", "employer_name": "Optiver", "employer_info": "Optiver is a global electronic market maker. We use our own capital, at our own risk, to trade on major financial markets around the world.\nOur story begins in 1986, with a single trader on the floor of Amsterdam's options exchange.\nToday, we are at the forefront of trading and technology, employing around 950 employees of 40 nationalities across offices on four continents.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/opus-international-consultants-433710", "employer_name": "Opus International Consultants", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/optimal-systems-813804", "employer_name": "Optimal Systems", "employer_info": "Find company information quickly and reliably, manage it transparently, distribute it to the right persons, and archive it on an audit-proof basis: for more than two decades, OPTIMAL SYSTEMS has been developing and selling software solutions for Enterprise Content Management (ECM) helping companies make better decisions and to plan and implement their processes more effectively and rapidly.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/optimal-rx-944667", "employer_name": "Optimal Rx", "employer_info": "OptimalRx is a 100% Australian owned practitioner dispensing brand for practitioners by practitioners. OptimalRx is proud to provide optimal quality, optimal education and optimal innovation for natural medicine practitioners.\n\n \n\nOur liquid herbal extracts are manufactured from the finest raw materials which are authenticated by independent botanists. A significant proportion of our raw material is sourced from New Zealand and the remainder from international growers. OptimalRx utilises Southern Cross University Phytotherapy Laboratory to independently test a selection of our herbal extracts to assure practitioners of the outstanding quality. We source exceptional quality raw material in order to provide efficacious herbal extracts to practitioners; we will not compromise on price for quality of raw materials.\n\n \n\nOptimalRx leads the way in innovation by regularly introducing clinically relevant, unique liquid herbal extracts to the Australian practitioner market. We recognise the changing face of practice and respond by providing practitioners with well-researched, clinically relevant, innovative herbal medicines. In association with this, we continue to provide outstanding quality technical research, information and mentoring opportunities for practitioners.\nSource: This is an extract from the company's own website"},
{"employer_url": "https://www.seek.com.au/companies/optimal-pharmacy-plus-436962", "employer_name": "Optimal Pharmacy Plus", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/optii-solutions-944638", "employer_name": "Optii Solutions", "employer_info": "Timely and professional housekeeping management is at the epicentre of the guest experience and therefore the heart of a successful hotel operation.\n\nGuests who arrive with no queues at the front desk - and a professionally cleaned room that is ready for them - are guests who return time-and-time again.\n\nHow can a hotel achieve this level of responsiveness and reduce operating costs at the same time? Optii Keeper.\n\nHow it works\n\nA lightly used room occupied by a conference guest might only take 20 minutes to clean. \n\nA room that’s been lived and dined in by a family with two children, over three days, might take an hour to clean. \n\nSame room type, same day, but it’s a different burden on your operation.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/opticomm-944628", "employer_name": "Opticomm", "employer_info": "OptiComm is an independent, licensed Australian Telecommunications carrier specialising in the design, construction, operation and maintenance of Fibre-to-the-Premises (FTTP) network solutions for new residential and business developments.\n\nAt OptiComm, our approach to the design and operation of FTTP is based on years of research and development. We created the “open access, wholesale-only” business model which was embraced by the Federal Government in 2009. This highly successful model has made OptiComm Australia’s most trusted and largest privately owned builder and operator of FTTP Networks.\n\nOptiComm is committed to making it simple for Australians to connect by building smart communities. Our Fibre Connected Communities deliver advanced services over and above that specified by the Government’s National Broadband Network policy.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/opsm-432929", "employer_name": "OPSM", "employer_info": "Every member of the OPSM family cares deeply about eyes, our most precious natural assets. Our company creates career opportunities for those who love eyes too; and we work with communities, charities and sportspeople to improve vision while promoting the critical importance of good eye health.\n\nWhen the Optical Prescription Spectacle Makers store opened in Macquarie Street, Sydney in 1932, the vision was to help everyday lives by improving people’s sight. Managing your eye health is still our main focus, along with all the services we’ve developed over 80 years as OPSM.\n\nSource: this is an extract from the company’s own website"},
{"employer_url": "https://www.seek.com.au/companies/oporto-432460", "employer_name": "Oporto", "employer_info": "Back in 1986 no-one was serving delicious flame grilled chicken like Oporto founder Antonio Cerqueira used to find back home in Portugal. So he decided to open a chicken shop in North Bondi serving Flame Grilled Portuguese Style Chicken with our now famous Original Portuguese Chilli Sauce. The philosophy was simple; provide unique, simple and delicious food to friends. \nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/operational-intelligence-944578", "employer_name": "Operational Intelligence", "employer_info": "Operational Intelligence is a division of Oberix Group Pty. Ltd. An Australian systems integrator leveraging 22 years of building industry experience now offers software solutions to create Intelligent Buildings, Smart Workplaces and Smart Cities.\n\nOperational Intelligence offers a solution that delivers integrated view of buildings portfolio data, increased visibility, control and automation within each of the functional areas of workplace management.\n\nThese solutions which integrate functional models across key areas of the organization for an effective solution for data integration - include:\n\nSpace Planning\n3D Visualization\nSustainability\nLighting control\nLift management\nSecurity & Surveillance\nPredictive Analytics\nDocument Management\nAcceptance Testing\nProperty Management\nAgile Workplaces\nIntelligent Buildings\nAccess Control\nVisitor Management\nIncident Management\nAsset Management\nFacility Booking\nCommissioning Management\nModular Integrations\nPlanned Preventative Maintenance\n\nOperational Intelligence addresses this market need utilizing iViva, a unique BPM (Business Process Management) development environment and management system that enables the Workplace to be smarter and more responsive by eliminating barriers.\nSource: This is an extract from the company's own website"},
{"employer_url": "https://www.seek.com.au/companies/opteon-814578", "employer_name": "Opteon", "employer_info": "What makes Opteon Property Group the industry leader in property valuations and advisory services? Our national network, our market-leading valuation management platform, superior quality assurance, risk and compliance, and our people. We partner with a diverse range of organisations including financial institutions, governments, statutory authorities, corporations, not-for-profit organisations and small to medium businesses.\n\nWe have long-standing relationships with a range of service professionals including lawyers, accountants, financial planners and insurance agents. We also work closely with residential buyers and sellers, property investors, real estate agents and property developers to deliver informed and independent advice.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/opera-australia-944571", "employer_name": "Opera Australia", "employer_info": "Opera Australia employs over 300 permanent artists and staff, and provides employment opportunities for up to 1000 people in any one year.\n\nIf you are interested in a career in the arts and working for Opera Australia, we offer a range of job opportunities, from performing as a singer, musician, dancer or actor, through to costume or set manufacturing, and stage management and technical production, and also marketing, events management, artist management and finance.\n\nOur main work locations include The Opera Centre in Sydney and the Melbourne Opera Centre. These centres contain rehearsal, manufacturing and administration areas. We also operate stores at separate locations. Our artists and production staff rehearse and perform at the major capital city performance venues, and our touring company performs across regional Australia.\n\nThere are a number of ways in which we recruit new people to the Company. Performers are generally engaged through an audition process. There are periodic auditions for singers and for players in the Orchestra.\n\nOpera Australia is an Equal Opportunity Employer. When recruiting, we seek applications from as wide a range of qualified applicants as possible.\nSource: This is an extract from the company's own website"},
{"employer_url": "https://www.seek.com.au/companies/openet-telecom-801329", "employer_name": "Openet Telecom", "employer_info": "LEARN ABOUT OPENET\nFind out who we are, who we’ve been working and partnering with, what’s been said about us in the press, and how to contact us.\n\nOPENET - FAST TRACKING DIGITAL JOURNEYS\n\nOpenet is a company created to work on complex technology spaces, and to innovate that technical capability into business success for our customers and ourselves. To date, most of our work has been in the communications field, providing software solutions and consulting services to enable service providers better engage their customers. Our real-time solutions provide the digital platform for service providers to be more agile and innovative, enabling them to drive new revenues and increase their share of their customers’ digital spend.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/opencorp-814606", "employer_name": "OpenCorp", "employer_info": "Tomorrow starts here.\nWhether it’s building a successful property portfolio or investing in one of our Development Funds, we can help you through every stage of your investment journey. We only offer investments to clients that we invest in ourselves.\n\nOpenCorp are property investment specialists.\n\nOur company directors are supported by a team of over 40 property specialists who collectively have been involved in over $7 billion worth of property transactions and the acquisition of more than 7,000 homes and investment properties.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/opentext-834627", "employer_name": "OpenText", "employer_info": "OpenText is the leader in Enterprise Information Management (EIM).\n\nOur EIM products enable businesses to grow faster, lower operational costs, and reduce information governance and security risks by improving business insight, impact and process speed.\n\nOUR PROMISE TO OUR CUSTOMERS\n\nOpenText strives to...\n\nenrich the way people use information\nfoster innovation\nbe trusted in our relationships\nbe committed to excellence in all that we do\nwork with our stakeholders, demonstrating honesty and passion towards common goals\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/open-universities-australia-433452", "employer_name": "Open Universities Australia", "employer_info": "For over twenty years Open Universities Australia has opened the doors for students undertaking online higher education or professional development. We are proud and committed to helping students succeed on their study journeys. OUA recognises students' need for flexible learning schedules that fit into their lives, and our goal is to provide an education that fits your lifestyle.\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/open-minds-435074", "employer_name": "Open Minds", "employer_info": "Open Minds works with people to enhance mental health and wellbeing.  We have a long history and were formed as the Queensland Wattle League in 1912.\n\nWe offer a range of programs and tailored support services focused on the individual needs of each person we support. This includes Lifestyle, Living, Employment and Health streams. At the heart of what we do is a commitment to working alongside individuals and focusing on their strengths to enable individual achievement and recovery.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/open-high-school-872644", "employer_name": "Open High School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/open-door-pub-co-437548", "employer_name": "Open Door Pub Co", "employer_info": "Dixon Hospitality is the brand behind some of the best gastronomic pubs and vibrant bars Australian cities have to offer.\n\n We are one of the fastest growing hospitality groups in Australia.\n\n At the very heart of our business is our commitment to great food, great service and great fun. \nIn late 2015 the company acquired Open Door Pub Co which included 16 contemporary venues. As part of the acquisition, Melbourne Venue Company also joined the Dixon team. This team is focussed on finding the perfect function space for corporate functions, private dinners, celebrations and special occasions.\n\nEach of our venues have their own personality and distinctive menu, because we think that’s what our guests expect.\n\nPut simply we’re focused on combining great spaces with great produce, great chefs and an outstanding team.\nSource: This is an extract from the company's own website"},
{"employer_url": "https://www.seek.com.au/companies/ooyala-861251", "employer_name": "ooyala", "employer_info": "Ooyala helps deliver content that connects. A US-based subsidiary of global telecommunications and IT services company Telstra, Ooyala’s comprehensive suite of offerings includes one of the world’s largest premium video platforms, a leading ad serving and programmatic platform and media logistics solution. Built with superior analytics capabilities for advanced business intelligence and a strong commitment to customers’ success, Ooyala’s industry-leading end-to-end solutions help large-scale broadcasters, operators, media companies, enterprises and brands build more engaged and more profitable audiences, and monetize video and TV with personalized, interactive experiences across any screen.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/open-access-college-801318", "employer_name": "Open Access College", "employer_info": "About OAC\n\n\n\n\n    \n..\n\n\n\n \n\n\n\n\nTeaching and learning at the College occurs through:\n•a blended approach of online, virtual classroom lessons in small groups\n•face to face opportunities eg workshops, excursions, camps, laboratory sessions\n•access to year level and subject specific web sites (usually through Moodle)\n•custom designed support materials\n\nStudents can access a range of support from:\n•class teachers and advisory teachers\n•counsellors and intervention officers\n•support staff\n•targeted programs in literacy and numeracy\n•alternative programs\nHistory\n\n\n\n\n    \n..\n\n\n\n \n\n\n\n\nOpen Access College was established in 1991. It was originally an amalgamation of the SA Correspondence School and School of the Air (SOTA).\n\nThe SA Correspondence School opened 1920 in North Adelaide, later moving to the city centre. Teachers prepared sets of lessons posted fortnightly to remote students. Mothers and governesses worked with children to complete lessons that were then returned to Adelaide. Questions from students and mothers were also posted to Adelaide. Snail mail, often taking 2-6 weeks, did little to alleviate feelings of isolation.\n\nIn 1958, SA School of the Air was established with support from the Royal Flying Doctor Service. Using two-way radios, students on remote properties became connected with peers and their teachers.\n\nToday, advanced technology is used to synchronously connect teachers and students. Students can see and talk to classmates and teachers, work collaboratively and receive immediate feedback. Asynchronous support is provided through email and subject/year level websites.\n\nThe mainstay of education for remote and isolated families, students enrol for a variety of reasons including health, travel, elite sport, work commitments, and incarceration. School based students enrol to access single subjects not available in their school\nSource: this is an extract from the company’s own website."},
{"employer_url": "https://www.seek.com.au/companies/open-colleges-433932", "employer_name": "Open Colleges", "employer_info": "Open Colleges has been delivering quality education for over 100 years. During this time, we have honed our unique learning model to become Australia’s leader in online learning. We’ve achieved this by continuously evolving our approach to meet the needs of our learners by offering flexible, accessible, affordable and supportive courses.\n\nSo far, we’ve have helped over 700,000 people gain the skills to launch, change or take the next step in their careers.\n\nAll of us at Open Colleges put the student at the centre of everything we do, whether that’s helping you find the right course, designing a new course, making improvements to our online campus or giving you the support you need to reach your goals.\n\nSource: This is an extract from the company’s own website."},
{"employer_url": "https://www.seek.com.au/companies/opal-specialist-aged-care-609519", "employer_name": "Opal Specialist Aged Care", "employer_info": "\"Opal Aged Care (formerly Domain Principal Group) is one of the leading, privately owned aged care providers in Australia. With 60 homes in four states providing specialist aged care services for a range of needs including dementia and respite care services.\n\nSource: this is an extract from the company's own website.\""},
{"employer_url": "https://www.seek.com.au/companies/oonoonba-state-school-820200", "employer_name": "Oonoonba State School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/oomiak-861104", "employer_name": "Oomiak", "employer_info": "Oomiak is a young face in industrial refrigeration, but there is nothing new about the know-how of this very experienced team, which has high-level and hands-on experience across industrial and commercial industry sectors.\n\nTeam members have played a significant role in the design and development of a substantial percentage of many major refrigeration projects across Australia over the last 20 years.\n\nWe employ a range of highly skilled and experienced people in the following fields:\n•Design\n•Engineering\n•Refrigeration technicians\n•Project management\n•Welding\n•Plumbing\n•Administration\n\nSimply, team members look professional, know what they’re talking about and are very good at what they do. They have been recruited not only because of their professional and technical skills and experience, but also because they share:\n•The capacity to think creatively\n•Listening skills\n•A positive attitude\n•A customer support approach.\nSource: this is an extract from the company’s own website."},
{"employer_url": "https://www.seek.com.au/companies/opal-cove-resort-806066", "employer_name": "Opal Cove Resort", "employer_info": "Coffs Harbour and its surrounds offer clean, clear waters, excellent beaches and are renowned as a surfing nirvana.\n\nThis popular Northern New South Wales destination is located 554kms north of Sydney and 427kms south of Brisbane making it the perfect base from which to explore the region’s natural beauty and many local attractions.\n\nWith its easy to find Pacific Highway access, Opal Cove Resort Coffs Harbour is located on absolute beachfront in Korora Bay, 5 minutes north of Coffs Harbour and is easily accessed by all forms of transport being only 11 kms from the airport and 7kms from bus, coach and rail terminals. Enjoy the laid back friendly atmosphere as you relax poolside or get your blood racing on an adventurous excursion. The choice is yours.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/ooh-media-861517", "employer_name": "oOh! Media", "employer_info": "CONNECTING BRANDS WITH MORE CONSUMERS AWAY FROM HOME\n\nAway from home is now the most exciting, most versatile media channel in the world. Every major brand is looking at the opportunities, and we’re at the heart of that revolution with a range of solutions that engage with consumers throughout their day.\nAs people spend more and more of their time away from home, we create and deliver platforms and channels for brands to serve up experiences at key moments. Chances are we’ll bring something to their attention while they shop, as they travel, study or play.\nWe engage brands with consumers wherever their day takes them, reaching a growing and diverse audience. No-one understands consumer engagement better.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/onwatch-868174", "employer_name": "Onwatch", "employer_info": "Onwatch is one of Australia’s premier alarm monitoring companies with a commitment to providing the best service possible for our customers.\n\nOnwatch has been solely created to deliver the most technologically advanced services available for commercial and residential premises that have back-to-base alarm monitoring.\n\nWe pride ourselves on fully licenced and authorised operators, who have been trained to deliver supreme customer service, ensuring you are always our highest priority.\n\nOur customer focus, and relationships with other third-party specialist security providers, means Onwatch can offer you the total in house monitoring service which we tailor to your specific needs & requirements.\n\nCredentials\n•NSW Security Master Licence\n•ASIAL Grade 1 Accredited Monitoring Centre\n•Corporate Member of Security Providers Association of Australia Limited (SPAAL)\n•$20 Million Public Liability Insurance\n•Workers Compensation\nSource: This is an extract from the company's own website"},
{"employer_url": "https://www.seek.com.au/companies/oodnadatta-aboriginal-school-872642", "employer_name": "Oodnadatta Aboriginal School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/onthehouse-814530", "employer_name": "Onthehouse", "employer_info": "PROPERTY VALUES NO MATTER WHERE YOU ARE\n\nIf you're wondering what that house you just visited is worth then simply download our Mobile app and you can know in seconds.\n\nOur app lets you discover the automated calculated value estimate of properties throughout Australia no matter where you are.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/onslow-primary-school-872641", "employer_name": "Onslow Primary School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/onslow-beach-resort-944440", "employer_name": "Onslow Beach Resort", "employer_info": "YOUR PILBARA EXPERIENCE STARTS HERE\n\nWith stylish comfort, fantastic food, stellar views and a team of dedicated staff, a sensational Pilbara experience starts here at the Onslow Beach Resort. Our accommodation and restaurant dining offers relaxed, civilised sophistication – a refreshing welcome when travelling through the remote, rugged beauty of the Pilbara region.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/online-education-services-986010", "employer_name": "Online Education Services", "employer_info": "Online Education Services (OES) was established to challenge and advance the online education industry, providing a new student-centric approach to adult education. Through partnerships with highly regarded Australian education providers, OES provides the expertise to create engaging online learning experiences for students who are not catered for by traditional campus-based offerings"},
{"employer_url": "https://www.seek.com.au/companies/onslow-community-health-service-872639", "employer_name": "Onslow Community Health Service", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/onslow-hospital-872640", "employer_name": "Onslow Hospital", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/onsite-rental-group-435003", "employer_name": "Onsite Rental Group", "employer_info": "Our Knowledge, Your Choice is the tagline that sums up Onsite’s philosophy. Onsite employs product specialists for every product in every region of Australia to offer expert advice on equipment application (Our Knowledge). \n\nOnsite also remains 100% independent of equipment manufacturers so our product specialists are free to offer unbiased advice on the right product for your project or application (Your Choice).\n\nOur Knowledge Your Choice underpins every aspect of Onsite's business.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/only-about-children-434742", "employer_name": "Only About Children", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/online-courses-australia-834326", "employer_name": "Online Courses Australia", "employer_info": "OCA offers the ultimate learning experience in Australia. Choose from dozens of nationally recognised qualifications, short courses and university degrees. We offer exceptional value, flexible access and unlimited support. Learn more about Online Courses Australia and meet our team.\nFlexible Access\n\nStudy when you want, where you want. As long as you have an Internet connection you can access our state-of-the-art learning platform to study around your existing schedule\nGreat Choice\n\nRealise your dreams, develop your expertise and discover your career potential! Upskill, learn and get recognised with our nationally accredited qualifications and short courses.\nNationally Recognised\n\nOCA offers nationally recognised training to help you improve your knowledge and learn the skills you’ll need to get Australia-wide qualification in your field.\nSource: this is an extract from the company’s own website."},
{"employer_url": "https://www.seek.com.au/companies/onesteel-432459", "employer_name": "OneSteel", "employer_info": "OneSteel comprises a number of successful Australian steel businesses through an integrated supply chain, all of which place quality and customer service at a premium.\n\nSource: This is an extract from the company’s own website."},
{"employer_url": "https://www.seek.com.au/companies/onevue-813845", "employer_name": "OneVue", "employer_info": "No matter what business you're in, we work with you to offer your clients a range of superannuation solutions, whatever their stage of life or superannuation balance. We are your wholesale provider of self managed super fund, retail super and digital member based solutions.\n\nThrough customised wealth management platforms we can help you to provide your clients with the ultimate end-to-end investment experience.\n\nWhile platform services has been our focus historically and remains an important offering, we also take pride in the fact that we're now the market leader in independent outsourced unit registry solutions.\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/onesubsea-867911", "employer_name": "OneSubsea", "employer_info": "OneSubsea delivers integrated solutions, products, systems, and services for the subsea oil and gas market. The company offers a step change in reservoir recovery for the subsea oil and gas industry through integration and optimization of the entire production system over the life of the field.\n\n OneSubsea combines in-house subsurface and production assurance knowledge with field-proven technology and equipment to deliver solutions to the client that can achieve first oil faster, accelerate production and increase recovery to maximize the financial return on investment.\n\n Our unique Pore to Process approach helps provide end-to-end solutions from reservoir to surface, that address client challenges with the goal of optimizing production and increasing recovery. \nOneSubsea delivers integrated solutions, products, systems and services for the subsea oil and gas market. Our company offers a step change in reservoir recovery for the subsea oil and gas industry through integration and optimization of the entire production system over the life of the field. OneSubsea leverages Cameron flow control expertise, process technologies and world-class manufacturing and aftermarket capabilities, along with Schlumberger petro-technical leadership, reservoir and production technology, and R&D capabilities.\n\n OneSubsea currently operates in six technical areas of domain expertise - Integrated Solutions, Production Systems, Processing Systems, Control Systems, Swivel and Marine Systems, and Subsea Services – that provide products and services to oil and gas operators around the world.\nSource: This is an extract from the company's own website"},
{"employer_url": "https://www.seek.com.au/companies/oneflare-813317", "employer_name": "Oneflare", "employer_info": "Since the mid 1800s, flares have been used as signals to summon rescuers to a scene of distress.\nAt Oneflare, we’re driven by the idea of the flare, the one signal you need to attract expert help.\nWith so much information at your fingertips, it’s hard to know where to start.\nFinding the right expert to complete jobs, sort through a moment of crisis and finish projects can definitely be overwhelming.\nThat’s why we exist. To facilitate those connections.\nMatching the right job with the right expert, first time and every time.\nInstantaneous peace of mind, A sudden sense of ease, The certainty of knowing you’re in the right hands. Make that right connection.\nFrom To-do to Done\n\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/anz-432303?child=434228", "employer_name": "OnePath", "employer_info": "Our history dates back over 180 years. We are committed to building lasting partnerships with our customers, shareholders and communities in 34 countries in Australia, New Zealand, throughout Asia and the Pacific, and in the Middle East, Europe and America. We provide a range of banking and financial products and services to over 9 million customers.\n\nSource: this is an extract from the company’s own website."},
{"employer_url": "https://www.seek.com.au/companies/one-stop-shop-strategy-and-implementation-office-795812", "employer_name": "One-Stop Shop Strategy & Implementation Office", "employer_info": "The One-Stop Shop Strategy and Implementation Office was established in October 2013 to deliver the One-Stop Shop plan, which aims to make public services simpler, clearer and faster for customers.\n\nBy working collaboratively with customers and all agencies, the One-Stop Shop Strategy and Implementation Office aims to provide citizens as customers with simplified access to information, services and transactions.\n\nBy taking a customer-centric approach, we will cut through agency and service silos to connect services, reduce duplication, and provide seamless and easy access to government services.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/onecare-814409", "employer_name": "OneCare", "employer_info": "OneCare is a statewide not-for-profit company that works to the highest ethical standards in order to produce high quality, best practice outcomes for its clients and their families.\n\nFounded on principles of compassion, respect and dignity for the individual, OneCare adopts a holistic approach to the provision of services, treating each client as a ‘whole person’ with regard for their individual social, spiritual and psychological needs and perspectives.\n\nThe focus of the organisation, however, is wider than the individual client. The organisation recognises the trust placed in it by the various communities it services throughout the State and to this end is committed to the achievement of the highest organisational standards, ensuring sound ongoing organisational health centred on financial viability, self education, continuous improvement, transparent practices and accountability.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/one-penny-red-944256", "employer_name": "One Penny Red", "employer_info": "One Penny Red enables us to focus on what we love – bringing you together to share good food and enjoy good wine.\n\nThat’s why we’ve created a unique gathering place for you in Summer Hill.\n\nWe look forward to welcoming you to One Penny Red.\nOur Private Dining Room is available for group of 8 – 10 people.\n\nLocated upstairs with double doors opening onto the balcony, this room oozes old world charm and could be just the perfect place for your private dinner party.\n\nFour course share menu $75 per person\nThe Restaurant\n\nOriginally home of the Summer Hill Post Office, this light airy space offers a casual dining experience with a contemporary style of food that is boldly comforting, well thought out and distinctive.\nWe look forward to welcoming you at One Penny Red. \nSource: This is an extract from the company's own website"},
{"employer_url": "https://www.seek.com.au/companies/one-tree-hill-primary-school-872637", "employer_name": "One Tree Hill Primary School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/one-tree-community-services-inc-813495", "employer_name": "One Tree Community Services Inc", "employer_info": "One Tree has extensive experience in early education and care and community services, and provides accredited training as a registered training organisation (RTO). \n\nIn 2010 One Tree identified the lack of services for children and families in the communities we serve. One Tree decided to extend its scope to focus on community services for individuals, families, children and vulnerable communities suffering poverty, ill health, homelessness, abuse, isolation or a lack of services.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/one-stop-warehouse-861133", "employer_name": "One Stop Warehouse", "employer_info": "One Stop Warehouse is an Australian company that is a wholesale distributor of Solar PV panels, solar inverters, components and complete solar systems. Our vision remains being a true wholesale partner that does not compete with you in the retail space and will always strive to offer excellent value and service. \n\nWe only use advanced and proven manufacturing processes for each of its solar panel arrays. This ensures we deliver only the very best and efficient panels, inverters, mounting racks and cabling.\nSource: this is an extract from the company’s own website."},
{"employer_url": "https://www.seek.com.au/companies/one-mile-state-school-820271", "employer_name": "One Mile State School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/onetrak-813635", "employer_name": "Onetrak", "employer_info": "If you are looking for a reliable distributor of Heavy Equipment that still cares about its customers and aims for high quality outcomes, then Onetrak is the business partner you have been looking for. Established in 2006 Onetrak has rapidly grown into a major supplier of quality equipment within the construction, mining and forest industries of Australia. Today employing over 50 people across the south eastern states of Australia, we strive to provide exceptional customer service levels and set new industry benchmarks.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/one-harvest-435418", "employer_name": "One Harvest", "employer_info": "We are leaders in fresh produce. For three generations, the OneHarvest family of companies has been supplying Australian consumers with fresh, healthy, fabulous-tasting fruit and vegetables from a range of sources across the country. \n\nWe employ up to 1000 people across Australia and supply a range of fresh produce to supermarkets and greengrocers around the country. These products include pre-packed salads and stir-fry vegetables, prepared deli salads, fresh chilled meals as well as avocadoes and B74 mangoes (marketed under the Calypso® brand).\n\nWe are focused on excellence in customer service and quality and take pride in being one of the most advanced and innovative fresh produce companies in Australia.\n\nSource: this is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/one-arm-point-remote-community-school-872634", "employer_name": "One Arm Point Remote Community School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/oncall-interpreters-and-translators-834643", "employer_name": "ONCALL Interpreters & Translators", "employer_info": "ONCALL Interpreters & Translators is a world leader in quality interpreting and translation services. With an outstanding reputation for excellence and integrity, ONCALL offers a full range of services for public and private sector clients.  Established in 1984, ONCALL manages a comprehensive panel of over 4,500 qualified interpreters and translators in all languages and disciplines.\n\nONCALL has an unparalleled global presence with offices in eight cities on three continents and has access to some of the best interpreters and translators in the world. \n\nEach week our booking officers fill over 7,000 assignments in more than 150 languages. Every year we translate hundreds of thousands of words and provide conference interpreting services at major international conferences in Australia and overseas.\n\n With extensive experience and industry knowledge, ONCALL can tailor services to meet the changing needs of clients. We employ a dedicated team of in-house professionals in specialist areas including client management,Website localisation, E-Commerce site localisation, App translation, graphic design, public and community relations, localisation of marketing collateral and professional development training.\n\nOur Expertise\n\nOur interpreters and translators\n\nONCALL has access to a panel of more than 4,500 highly qualified and experienced interpreters and translators in over 150 languages. Our local interpreters and translators are accredited by the National Accreditation Authority for Translators and Interpreters (NAATI).\n\nFor new and emerging languages not tested by NAATI, ONCALL liaises with tertiary institutions, ethnic communities and other organisations to recruit suitable panel members.\n\nONCALL is QCSE ISO 9001 certified Quality Management System.We guarantee to maintain, through our Quality Management System, a level of quality and reliability of supply that will equal or surpass the expectations of every customer. It is the intention of all departments within the company to continually improve the quality of the services they provide, leading to increased Customer Satisfaction.\n\n\nOur Vision\n\nBecome the top five global language services provider, connecting all communities, by 2018.\n\n\nOur Mission\n\nONCALL will set the global benchmark for language services through innovation\nSource: this is an extract from the company’s own website."},
{"employer_url": "https://www.seek.com.au/companies/ondeck-sa-795903", "employer_name": "OnDeck SA", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/one-contact-944197", "employer_name": "One Contact", "employer_info": "The OneContact story began in 2002. Back then, we were a small call centre with a big vision, and we were known as Contact Centres Australia. 14 years on and plenty has changed. We’ve grown a lot. We’re more globally connected than ever before. We even have a new name. But we’ve remained true to the core values that drive our business and deliver outstanding results for our clients. Today, we’re entrusted to provide more services for more brands than any other time in our history.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/on-track-community-programs-813924", "employer_name": "On Track Community Programs", "employer_info": "OTCP or On Track Community Programs as it is more commonly known, had humble beginnings as the local Tweed Hospital Aid Council (THAC). This was in 1986, when a group of concerned parents, health professionals and community minded citizens had the vision to respond to the outcomes arising from the Richmond Report 1983, often associated with initiating the deinstitutionalisation process of people with mental illness and developmental disability. It is noted this process had begun earlier in the 60’s and 70’s yet the Richmond Report did have an impact on many local groups such as the THAC and groups such as ours began a dialogue between NSW Health and Housing on where people with mental illnesses would be supported in the community.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/on-the-run-433374", "employer_name": "On The Run", "employer_info": "We are a proud South Australian group of private companies and associated entities that are fully owned by the Shahin family. Peregrine is now the 34th largest private company in Australia (financial year 2013) and one of the largest private companies in South Australia (BRW Oct 2013)."},
{"employer_url": "https://www.seek.com.au/companies/on-topic-media-814536", "employer_name": "On Topic Media", "employer_info": "Founded in 2008, On Topic Media is an Australian company which manages a number of popular websites including:\nWeekendNotes.com - Fun and interesting things to do in your city. The main cities covered include Sydney, Melbourne, Brisbane, Adelaide, Perth, London, and New York.\n\nZPages.com.au - A free Australian business directory.\n\nOrble.com - A blogging community which includes popular sites such as 20/20 Filmsight and ZCars.\n\n\nABN: 18113479226\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/on-demand-sports-813832", "employer_name": "On Demand Sports", "employer_info": "Although new to Adelaide, On Demand Sports has over 26 associated offices in every state of Australia and New Zealand. With our UK expansion proving a great success, Our America Expansion is now in process. Both expansions occurred with support from our Australian company.\n\n\nOn Demand Sports offers a large range of opportunities for anyone wanting to succeed within the Sales and Marketing sector, providing tailored training programs to suit. Whether you’re looking for an opening in customer service, sales or just an opportunity to shine, On Demand Sports is the company for you!\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/omni-care-860972", "employer_name": "Omni-Care", "employer_info": "Omni-Care strives to maintain the quality of life, dignity and independence of people living in our community who are elderly, disabled or who have serious medical conditions.\n\n \n\nOmni-Care is firmly and totally committed to delivering the highest quality care by providing trained and reliable staff and excellent customer service at all levels of the organisation.\n\n \n\nWe recognise that the continual development and refinement of our processes and procedures is paramount to our continued success and the achievement of our goals. \nWe pride ourselves on employing support workers who are representative of the community, who are compassionate and caring and also professional, well trained and security checked.\n\n \n\nOur Care Coordinators work with you to ensure that  your needs and goals, are understood and passed on to the support workers on your program. We appreciate that you and those who support you have, unique requirements.\nSource: this is an extract from the company’s own website."},
{"employer_url": "https://www.seek.com.au/companies/omeo-primary-school-872633", "employer_name": "Omeo Primary School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/omega-service-solutions-814840", "employer_name": "Omega Service Solutions", "employer_info": "Omega Service Solutions - Sydney Plumbers & Sydney Electricians. 1300 806 683. Omega Service Solutions provides expert plumbing & electrical services for residents and businesses in Sydney and across the Sydney metropolitan area. Whether you have a plumbing emergency, blocked drains, need to upgrade or repair your hot water system or require an electrician - Omega has the solution for you and backs it with our Omega Service Guarantee. Some conditions apply*, so please choose one of our promotions to find out more.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/on-the-line-australia-944456", "employer_name": "On The Line Australia", "employer_info": "OTL was established more than 55 years ago and since that time has grown to become a national leader in the delivery of high quality telephone and online support to Australians anywhere and anytime. \n\nMission\nOn the Line is a professional social health organisation providing counselling support, anywhere and anytime.\n\nWe listen and encourage people to feel better: building resilience, fostering healthy relationships, and connecting people with community support.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/omeo-district-health-795738", "employer_name": "Omeo District Health", "employer_info": "Omeo District Health is located in the Victorian High country, 430km North East of Melbourne on the Great Alpine Road. After Gold was discovered in 1851, the extremely isolated region changed dramatically with a large influx of visitors and Omeo was officially declared a township in 1872.\n\nOmeo District Health has grown from a district hospital, incorporated in November 1891, to a modern facility, fully renovated and officially opened in December 2005.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/omega-security-434843", "employer_name": "Omega Security", "employer_info": "Formed in 2004 to meet the growing demand for security services at large facilities and mines, Omega Security is a group of security professionals operating in many regional and remote Australian locations.\n\nWe support defence organisations, offshore projects, remote industries and businesses from a range of sectors - providing fully trained and experienced security labour. The people we provide are qualified not just by experience, but also by a tertiary qualification in Risk Management, and we make a point of selecting people who are personable, and effective in their customer service to ensure they work well with you and your staff.\n\nSource: this is an extract from the company website."},
{"employer_url": "https://www.seek.com.au/companies/alh-group-432530?child=995525", "employer_name": "ALH Group", "employer_info": "ALH Group helps people live it up at our leading portfolio of pubs across Australia. We offer a diverse hospitality experience including electronic gaming, sports bars, bistros, restaurants, cafes, retail liquor, accommodation, nightclubs and wagering. Our facilities are located in capital cities and urban and regional centres across Australia.\n\nWe employ over 15,500 people across Australia at more than 320 licensed venues and in excess of 550 retail liquor outlets.\n\nSource: this is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/omega-paints-868136", "employer_name": "Omega Paints", "employer_info": "We are a flourishing Australian owned and operated paint manufacturer specialising in providing professional paint services and support to a wide range of commercial and residential clients throughout Australia since 1987. We are ISO 9001 and APAS certified and have NATA accreditation.\n\nWe seek to delivery top quality painting solutions that exceed our client’s expectations through high quality paints and support for our clients before, during and after their project to ensure you receive the very best.\n\nWe’re committed to making a difference to people’s lives that we go beyond our customers and actively provide assistance to several social, environmental and WHS causes.\n\nOur dedicated team of experts are happy to answer any questions you may have, contact us today with your queries to find out how Omega can benefit you.\nSource: This is an extract from the company's own website"},
{"employer_url": "https://www.seek.com.au/companies/omd-434570", "employer_name": "OMD", "employer_info": "Come and work for one of Australia’s best places to work!\n\nAt OMG (Omnicom Media Group), we have long understood that our success is 100% dependant on our people and the culture we create. \n\nOur people deliver market leading communication solutions and it’s their knowledge, passion and commitment to our clients that sets us apart, defines us as a desirable place to work and has made us the biggest and most successful communications services network in Australia. \nOMG includes the full service media networks OMD Worldwide and PHD Network, leading global data and analytics company, Annalect, as well as several media specialist companies including search specialist Resolution, digital trading platform Accuen.\nWe offer unparalleled clout in the marketplace, as well as a depth of capabilities and experience to drive leadership and innovation in every media type.\nOMG continues to be pioneers in delivering staff engagement via extensive training schedules, health & wellbeing programs and a key focus on employee’s careers. \n\nWe are Australia’s most recognised and awarded media agency group:\n\nOMD\n•\tThe only Agency in Australia to have ranked in the BRW top 50 Best Place to Work in Australia for 7 consecutive years. \n•\t2016 Mumbrella Culture Award\n•\t2015 B&T Employer of the Year  \n•\tCampaign Asia-Pacific ANZ Media Agency of the Year 2015\n•\tOMD Sydney Top 3 World’s Best Media Agencies (WARC 100)\n\nPHD\n•\tCampaign Media Network of the Year 2015\n•\tAPAC Media Network of the Year 2015\n•\tFastest growing media network in Australia, RECMA\n\nAnnalect\n•\t2015 Employer of the Year – Australian Business Awards\n\nWe are always looking for the best talent in market which is why we are keen to talk to you!"},
{"employer_url": "https://www.seek.com.au/companies/om-holdings-436738", "employer_name": "OM Holdings", "employer_info": "OMH is a dynamic international company committed to making a significant and meaningful contribution to all stakeholders through a balance of profits and returns to shareholders, the safety and empowerment of its workforce and a commitment to environmental and social responsibility.\n \nIn order to fulfil this Mission, OMH aims to:\nFocus on its cores businesses of marketing, processing of metals and production of manganese, while continuing to look for opportunities to expand each of the businesses as well as build a high quality mineral and metals base.\nCreate sustainable growth while maintaining profits and generous returns to shareholders.\nPractice high standards of safety and teamwork in an environment in which each individual accepts responsibility for performance.\nComply with applicable environmental laws and regulations.\nBe a valued member of the communities in which we operate.\nValue and support cultural heritage.\nRecognise and encourage innovation.\nBe adaptable and aspire to excellence and vision in all areas.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/ombudsman-tas-796060", "employer_name": "Ombudsman TAS", "employer_info": "The Ombudsman is an independent officer appointed by the Governor, and answerable to the Parliament.\n\nOur role is to investigate the administrative actions of public authorities to ensure that their actions are lawful, reasonable and fair.\n\nWe work in an independent, impartial and objective way to resolve complaints and to address systemic problems in order to improve the quality and standard of Tasmanian public administration.\n\nAuthorities within our jurisdiction include government departments, local councils, water and sewerage corporations, prisons, state-owned companies and Government Business Enterprises.\n\nWe can make investigations on our own initiative (often called 'own motion') or following a complaint (see Complaints Process).\n\nOur Strategic Plan for the period 2012 to 2017 is available on the link below.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/oloughlins-lawyers-806056", "employer_name": "O'Loughlins Lawyers", "employer_info": "O'Loughlins Lawyers is a mid-sized corporate and commercial law firm in Adelaide committed to understanding our clients and contributing value to their businesses with knowledgeable and practical advice delivered clearly and personably.\nWe are proud of our South Australian focus and our size and structure are designed to best serve our business community.\nWe advise companies (both public and private), charities, partnerships and individuals across a wide range of business sectors. We value our relationship with every client and aim in all matters to provide first rate service and value for money.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/ollies-place-814085", "employer_name": "Ollie's Place", "employer_info": "Each season, we breathe life into Ollie's Place with a collection of stories that bring with them a timeless fairytale feel, splashed with loads of fun and a hint of current trends. Our baby range is delicate and our chidren's range is charming. \n\nWe hope that you love our clothes as much as we do, and that by dressing your little person in Ollie's Place, we just might send you back to the whimsy, playfulness and innocence of your own childhood.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/olympic-industries-814132", "employer_name": "Olympic Industries", "employer_info": "Olympic Industries design and construct steel buildings from small garden utility sheds to large industrial buildings. It is a family business based in Adelaide, South Australia and established in 1969. Combining the know-how of architectural designers, the skills of the manufacturer and the experience of licensed installers, Olympic Industries continues to be a multi award winning and leading company in the Australian home improvement market.\n\nOur many awards include the BHP Trophy for the Best Use of Australian Steel and the ANZ Bank Award of Excellence.\n\nMATERIALS & FACTORY DIRECT\n\nA significant initiative was taken in 1978 when Olympic Industries purchased roll forming machinery and started rolling its own steel sections. The big breakthrough came with the development of the 75C Steel section, which revolutionised garage construction in Australia.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/alh-group-432530?child=806053", "employer_name": "ALH Group", "employer_info": "ALH Group helps people live it up at our leading portfolio of pubs across Australia. We offer a diverse hospitality experience including electronic gaming, sports bars, bistros, restaurants, cafes, retail liquor, accommodation, nightclubs and wagering. Our facilities are located in capital cities and urban and regional centres across Australia.\n\nWe employ over 15,500 people across Australia at more than 320 licensed venues and in excess of 550 retail liquor outlets.\n\nSource: this is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/oliver-hume-real-estate-group-437845", "employer_name": "Oliver Hume Real Estate Group", "employer_info": "Oliver Hume is a multi-disciplinary Australian property services company with over 60 years of success in residential and mixed-use property developments."},
{"employer_url": "https://www.seek.com.au/companies/alh-group-432530?child=995524", "employer_name": "ALH Group", "employer_info": "ALH Group helps people live it up at our leading portfolio of pubs across Australia. We offer a diverse hospitality experience including electronic gaming, sports bars, bistros, restaurants, cafes, retail liquor, accommodation, nightclubs and wagering. Our facilities are located in capital cities and urban and regional centres across Australia.\n\nWe employ over 15,500 people across Australia at more than 320 licensed venues and in excess of 550 retail liquor outlets.\n\nSource: this is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/olinda-primary-school-872632", "employer_name": "Olinda Primary School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/oldfield-knott-architects-438151", "employer_name": "Oldfield Knott Architects", "employer_info": "Established in 1973, we are one of the biggest firms of Architects and Interior Designers in Perth, Western Australia, working in both private and government sectors, covering the full range of projects - corporate, commercial, industrial, retail, research, public, tourism, recreational, multi-residential, aged person housing, health facilities, educational, fast food outlets and the hospitality industry. \n\nWe take pride in our professionalism, especially\nOur reputation for delivery of projects on time and under budget\nOur design skills, producing attractive buildings which work well for our clients\nOur reputation for sound commercial design\nThe diversity of our client base and the wide variety of projects we design\nOur well organized office which we run on solid business principles\nOur flexible approach to the demands made of us\n\nReputations are hard won and easily lost. We work hard at maintaining and continuously improving ours. \n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/olex-cables-435140", "employer_name": "Olex Cables", "employer_info": "Nexans Olex has a strong background and tradition that goes back to 1940 when the cables industry was first established in Australia.\n\nThat was when two great Australian companies, Olympic Consolidated Industries Limited and Nylex Corporation Limited, pioneered cable production within a few months of each other – Olympic producing Australia’s first vulcanised rubber insulated cable and Nylex producing a range of plastic insulated cables for the armed services during the Second World War.\n\nUntil that time, Australia had been totally dependent on imported cables.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/oldfields-834601", "employer_name": "Oldfields", "employer_info": "Oldfields is now an innovative marketer, importer and manufacturer of a range of products which include scaffolding and painting accessories.  \nOldfields Scaffold division has over 25 years scaffolding experience in providing engineering, safety and technical support and advice to design, quote, assemble and certify our jobs. We hire and sell scaffold to meet customer needs. All products are Australian designed, meet WorkCover requirements, are registered with WorkCover and are backed by the Oldfields Guarantee.  \n Oldfields has been manufacturing painting equipment in Australia since 1916. The Pro Series brand is our flagship. It is superior in quality and performance and is perfectly suited to all commercial applications where a professional finish is required. Our paint equipment ranges are suited to the professional painter and DIY home renovator. Oldfields paint equipment are manufactured to ensure painting is made easy, saving time and effort through quality and performance.\nOldfields has always ensured that the best possible service is provided to all customers and trade partners. We remain proudly Australian. \nSource: this is an extract from the company’s own website."},
{"employer_url": "https://www.seek.com.au/companies/oliver-brown-cafe-806556", "employer_name": "Oliver Brown Cafe", "employer_info": "WELCOME TO OLIVER BROWN BELGIAN CHOCOLATE CAFE\nPrepare to become obsessed!\tOliver Brown is the ultimate dessert destination, specialising in decadent dishes made from the finest quality chocolate, imported directly from the worlds chocolate capital in Belgium.\tThe Oliver Brown story began in 2009 in Belgium, when two friends discovered the taste of authentic Belgian chocolate whilst travelling Europe, and immediately became obsessed with the flavour. Struck by the rich sensory experience of Belgian chocolate, their vision was clear – to deliver Belgian inspired chocolates and desserts to everyone at any time across Australia, and eventually the world.\n\nThe Oliver Brown experience tantalises all taste buds, offering waffles, crepes, chocolate fondue, chocolates, coffee, drinks and shakes, as well as all of the beautiful trimmings of ice cream, chocolate sauce, fresh fruit and chocolate drops.\tOliver Brown prides ourselves on offering high quality ingredients, by sourcing the best raw chocolate from Belgium to use in the creation of our chocolates, desserts and drinks.\tOliver Brown not only caters for a late night chocolate craving or a hot chocolate on a rainy day but also offers a local hangout spot and a central hub for people to come together and indulge in their favourite dessert delights.\n\nExperience Oliver Brown, and enjoy!\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/old-noarlunga-primary-school-872630", "employer_name": "Old Noarlunga Primary School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/old-orchard-primary-school-872631", "employer_name": "Old Orchard Primary School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/old-bar-public-school-872626", "employer_name": "Old Bar Public School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/olam-australia-861382", "employer_name": "Olam Australia", "employer_info": "Olam has a well-established presence in Australia, with a particularly strong footprint in the Eastern states of Queensland, New South Wales and Victoria. We operate an integrated supply chain for 5 key products: cotton, almonds, pulses, grains and dairy, delivering these to over 500 customers worldwide. Olam employs over 400 permanent staff and approximately 300 seasonal employees during peak seasons. Our head office is located in Brisbane (Queensland) with regional offices located within Queensland, New South Wales and Victoria.\nSource: this is an extract from the company’s own website."},
{"employer_url": "https://www.seek.com.au/companies/ongerup-primary-school-872638", "employer_name": "Ongerup Primary School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/oliver-wyman-437955", "employer_name": "Oliver Wyman", "employer_info": "WHO WE ARE\nWith offices in 50+ cities across 26 countries, Oliver Wyman is a leading global management consulting firm that combines deep industry knowledge with specialized expertise in strategy, operations, risk management, and organization transformation. The firm's 4,000 professionals help clients optimize their businesses, improve their operations and risk profile, and accelerate their organizational performance to seize the most attractive opportunities.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/old-bonalbo-public-school-872627", "employer_name": "Old Bonalbo Public School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/old-guildford-public-school-872628", "employer_name": "Old Guildford Public School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/oil-search-861447", "employer_name": "Oil Search", "employer_info": "Oil Search Limited is an oil and gas exploration and development company which was established in Papua New Guinea (PNG) in 1929.\nMost of the Company’s assets are located in PNG, where it holds an extensive spread of oil and gas production and exploration licences.\n\nThe Company’s main asset is its 29% interest in the 6.9MTPA PNG LNG Project, a world-scale liquefied natural gas (LNG) development operated by ExxonMobil PNG Limited. The Project commenced production of LNG in April 2014, ahead of schedule, and reached nameplate capacity in July 2014, just three months after first production. PNG LNG has transformed Oil Search into a regionally significant oil and gas producer with a long-term LNG revenue stream. The Project has also had a major positive impact on PNG, materially increasing export revenues for the country and providing a new income stream for the Government and the people of PNG.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/ok-tedi-mining-limited-434974", "employer_name": "OK Tedi Mining Limited", "employer_info": "Ok Tedi Mining Limited (OTML) is a State-owned company that operates an open-pit copper, gold and silver mine located in the Star Mountains of Western Province, Papua New Guinea (PNG). The company holds a large portfolio of exploration leases in the vicinity of its Mt Fubilan mining operations and is actively undertaking near mine exploration. \n\nThe company's registered office is located in Tabubil, Western Province, PNG. It also has a representative office in Port Moresby, PNG and a marketing and logistics facility in Brisbane, Australia.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/offshore-marine-services-434261", "employer_name": "Offshore Marine Services", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/official-clothing-943914", "employer_name": "Official Clothing", "employer_info": "WELCOME TO OFFICIAL\nThis site will give you an insight into what we offer. From a great looking polo to a complete uniform all tailored to you. Whatever the nature of your clothing or merchandise needs, you can rely on us.\n\nAt Official…. Quality is a Material Thing!\n\nWe are OFFICIAL\nAt Official we have great people who pride themselves on making great products for you.\n\nWe want you to feel like you are part of the Official family. We are dedicated to offering the best service and aim to build a meaningful relationship based on trust. We want to know your name and the things that are important to you.\n\nOur Order Management System provides a simple solution to accurately manage orders and give historical records to base future projections. We can simplify all aspects of your ordering process and make your life easier.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/ohm-marketing-806048", "employer_name": "OHM marketing", "employer_info": "Home | About UsAbout Us\nOHM Marketing & Services Pty. Ltd are representing world leading brands for Air Compressors & Compressed Air Treatment products. Our Experience over 25 years in the field of Industrial Air Compressor & associated products, offer extensive knowledge of various industries Air applications & suitable packages.\n\nOver past few years, OHM has established in Australian Compressed air market, offering world leading brand products. Our aim is to bring our customers technical expertise & support, unrivalled project management & superior customer service. OHM offers a wide range of energy efficient products & modules to select, for any application in any industry.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/ogilvy-435273", "employer_name": "Ogilvy", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/ogilvie-high-school-872624", "employer_name": "Ogilvie High School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/officeworks-432356", "employer_name": "Officeworks", "employer_info": "\r\n\r\n"},
{"employer_url": "https://www.seek.com.au/companies/officer-specialist-school-872623", "employer_name": "Officer Specialist School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/officer-secondary-college-872622", "employer_name": "Officer Secondary College", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/o-i-834313", "employer_name": "O-I", "employer_info": "Global glass leader\n\nAs the world’s leading glass container manufacturer, O-I has more than a century of experience crafting pure, sustainable, brand-building glass packaging for many of the world’s best-known food and beverage brands. We are proud to provide high quality glass packaging for beer, wine, spirits, food, non-alcoholic beverages, cosmetics and pharmaceuticals. We also produce beautiful tableware and stemware for household use.\nO-I Glass — the Clear Choice \n\nWe’re passionate about glass and consumers are, too. In fact, studies show that consumers prefer glass to any other packaging material. And for good reason — glass is recyclable, safe and preserves the taste of the food and beverages we all enjoy.\n\nOur passion\n\nWe recently launched Glass Is Life™, a global movement to celebrate the passion we all share for glass. The campaign shares the stories of consumers, CEOs and environmentalists who are inspired to choose glass and highlights the qualities of glass, including sustainability and quality.\n\nOur history\n\nOur founder, Michael J. Owens, invented the automatic bottle-making machine, which became the foundation for today's glassmaking industry. Our rich history of innovation, unparalleled expertise and global reach make O-I the world's leader in glass packaging.\n\nOur sustainability\n\nWe believe glass is the most sustainable packaging choice. Study results support our belief. Read the first complete life cycle assessment study for glass to discover why O-I glass has a lower carbon footprint than PET plastic. \n\nOur innovation\n\nOur experts imagine innovative new packaging design concepts. Our team of Ph.D. scientists, packaging designers and manufacturing experts transform those ideas into iconic glass containers. Our latest innovations include internally embossed beer bottles and the lightest-weight wine bottles ever made. Learn more about O-I's capabilities. \n\nOur customers\n\nGlass showcases brands in the marketplace better than other packaging material. We collaborate with our customers and get to know their businesses so we can create glass containers that reflect the quality and value of their products.\n\nOur insights\n\nThrough deep customer engagement and rigorous research, we identify market opportunities for products and glass packaging. In South America, the result was a new bottle size for beer - the 250-milliliter product - which helped customers tap into a previously undiscovered consumer trend. That's just one example of how O-I helps businesses grow their market share by showcasing their products in distinct glass containers. Contact us for details on collaborating with you. \nSource: this is an extract from the company’s own website."},
{"employer_url": "https://www.seek.com.au/companies/offset-alpine-printing-943923", "employer_name": "Offset Alpine Printing", "employer_info": "Located in Sydney with branches in Melbourne and Brisbane, Offset Alpine Printing is recognised as one of Australia’s leading web offset and sheetfed printing companies. We specialise in high-quality magazine, catalogue, corporate and commercial printing and possess wide ranging capabilities to meet or exceed the needs of all market sectors.\n \nThe company was established over 75 years ago and has an enviable reputation for quality service and product. In more recent times it has been recognised for setting the benchmark in the industry in Australia.\n \n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/officemax-432628", "employer_name": "OfficeMax", "employer_info": "At OfficeMax we believe business is about being strong, multilayered and flexible… Much like our rubber band ball!\n\nWe approach each and every client with the view to building a strong partnership to assist you to get the job of ordering workplace supplies and solutions done.\nOur multilayered product offerings are based on our staff getting to know how your business works to make sure you have the optimal workplace solution.\nAnd we’re flexible. We know business needs and circumstances change and that workplace solutions need to be adaptable. Our team are always focused on creating solutions that grow with your needs.\nOfficeMax has a long history of being part of Australia’s business community and working with government and schools. In fact, we first opened our doors in Melbourne in 1965.\nSince then we’ve transformed into an industry-leading workplace solutions provider known for excellence in customer service.\nIn partnership with OfficeMax Incorporated, we’re also part of one of the world’s most successful companies.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/officer-primary-school-872621", "employer_name": "Officer Primary School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/office-of-womens-policy-nt-868084", "employer_name": "Office of Women's Policy NT", "employer_info": "The Office of Women’s Policy focuses on gender equality and provides direct support to the Minister for Women’s Policy and across government on issues affecting women.\n\nThe Office seeks to advance the social, political, economic and civil status of women through the implementation of the Policy Framework for Northern Territory Women 2015–2020.\n\nThe Office was established stablished in 1983 when Australia became a signatory to the United Nations Convention on the Elimination of All Forms of Discrimination Against Women (CEDAW).  This Convention requires governments to enshrine gender equality into legislation and enact provisions that guard against discrimination against women.  The Office of Women’s Policy coordinates Northern Territory reporting against CEDAW that is then provided to the United Nations.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/office-of-transport-safety-investigation-nsw-795564", "employer_name": "Office of Transport Safety Investigation NSW", "employer_info": "The Office of Transport Safety Investigations (OTSI) is an independent statutory body. Its head, the Chief Investigator, reports directly to the Minister for Transport. \n\nOTSI was established as an independent body to investigate safety occurrences involving bus, ferry and rail transportation. The purpose of these investigations is to identify why an occurrence took place and make recommendations to prevent recurrence. To support this style of investigation, a 'just culture' approach is used.  \nThe Office of Transport Investigations (OTSI) was established as an independent statutory body by amendments made to the Transport Administration Act 1988. \n\nOTSI is headed by a Chief Investigator and contains a number of professional transport safety investigators with expertise in rail, maritime and road transport industries. \nOTSI's core business is to conduct transport safety investigations into rail, bus and ferry safety occurrences. Rail safety investigations may be conducted on behalf of the national rail safety investigator, the Australian Transport Safety Bureau (ATSB), under a collaborative arrangement, or at the instigation of OTSI's Chief Investigator. In addition to its investigation function, OTSI also administers a Confidential Safety Information Reporting Scheme (CSIRS) for transport employees and conducts safety trend analysis of the rail, bus and ferry transport industries. \nThe purpose of OTSI's investigations is to identify the contributory factors to a safety occurrence and make recommendations to prevent their recurrence. To maximise the safety outcomes from examining an occurrence, investigations are conducted within the context of a 'just culture'. \nSource: This is an extract from the company's own website"},
{"employer_url": "https://www.seek.com.au/companies/office-of-water-nsw-806662", "employer_name": "Office of Water NSW", "employer_info": "DPI Water is responsible for the management of the state's surface water and groundwater resources.\n\nDPI Water reports to the NSW Government for water policy and the administration of key water management legislation, including the Water Management Act 2000 and Water Act 1912.\n\nOur core business\n\ndetermine the volume of water available for allocation each year to towns, water users and the environment, particularly during times of severe water shortage\nensure all users, including the environment, have access to sustainable water supplies\ndevelop statutory water sharing plans which set the rules for sharing water between users, and between users and the environment\nnegotiate interstate and national water agreements particularly in view of the significant institutional changes occurring in the Murray-Darling Basin\napprove the extraction and use of water, and the policies and procedures for the permanent trade of water entitlements and the annual trade of available water\ncoordinate the development of town and non-urban water policy\nmonitor the quantity, quality, and health of our aquatic ecosystems and water extractions.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/office-of-trade-and-investment-nt-868035", "employer_name": "Office of Trade & Investment NT", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/office-of-the-queensland-parliamentary-counsel-806045", "employer_name": "Office of the Queensland Parliamentary Counsel", "employer_info": "The Office of the Queensland Parliamentary Counsel (OQPC) is responsible for drafting all Queensland Acts, and subordinate legislation made under Queensland Acts.\n\nIn addition to its legislative drafting and advisory role, OQPC is responsible for preparing reprints (consolidated versions) of Queensland legislation. OQPC also produces other publications containing information about legislation.\n\nThis website contains the Queensland legislation collection created and maintained by OQPC since 1991. The collection provides electronic access to reprints of Queensland Acts and subordinate legislation, as well as to Queensland Acts as passed from 1963 and all subordinate legislation published in the subordinate legislation series from 1 July 1991. Bills introduced to Parliament from 1992 are also included.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/office-of-the-queensland-government-architect-820431", "employer_name": "Office of the Queensland Government Architect", "employer_info": "The Office of the Queensland Government Architect provides leadership and strategic advice to government in relation to the built environment, urban design, procurement and heritage issues.\n\nOur role is to:\n\nensure that high quality and innovative design are major factors in government projects and public buildings\nprovide leadership and promote community awareness of built environment issues\nrepresent government on key architectural planning and urban design committees and bodies\nsupport and encourage opportunities for Queensland architects, including regional architects and the development of regional design\nmaintain effective relationships with architectural design schools in Queensland.\n\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/office-of-the-registrar-national-regulatory-system-qld-820028", "employer_name": "Office of the Registrar National Regulatory System QLD", "employer_info": "National Regulatory System\nThe National Regulatory System for Community Housing (NRSCH) is the national system of registration, monitoring and regulation of community housing providers that came into effect on 1 January 2014. It creates a consistent legislative environment across all participating states and territories.\n\nOn 1 January 2014, amendments to the Housing Act 2003 (PDF, 488KB) enabled the NRSCH to operate in Queensland. These amendments:\n\nseparate funding and regulatory decisions and include the establishment of Regulatory Services\ndefine funded housing services as ‘social housing’ or ‘ancillary services’\napply consistent performance standards to local government providers through a state register\nrequire existing registered providers funded for community housing to retain registration as a condition of funding\nremove the requirement for organisations which only deliver ancillary services (such as crisis, specialist homelessness services and private housing assistance) to maintain registration.\nTo  ensure that community housing providers who want to continue to deliver services in Queensland have sufficient time and adequate support to successfully register, the transitional period has been extended.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/office-of-the-sheriff-of-nsw-795542", "employer_name": "Office of the Sheriff of NSW", "employer_info": "At the Office of the Sheriff of New South Wales, we conduct law enforcement, security and support activities to ensure the safe and successful operation of state courts.\n\nWe also administer the NSW jury service system, a massive operation which involves more than 200,000 citizens each year. More than 400 specially trained sheriff's officers, court officers and clerical staff are employed at 58 sheriff's offices across the state.   \n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/office-of-the-nsw-crime-commission-795549", "employer_name": "Office of the NSW Crime Commission", "employer_info": "Establishment\n\n\nThe New South Wales Crime Commission (‘the Commission’) is a statutory corporation established by subsection 7 (1) of the Crime Commission Act 2012 (‘the Act’). The Act was assented to on 24 September 2012, repealing the New South Wales Crime Commission Act 1985. The life of the Commission commenced on 20 January 1986 with the appointment of the Commission's first Members by the then Governor\nObjective\n\n\nPursuant to section 3 of the Act, the principal objective of the Act is to reduce the incidence of organised and other serious crime.\n\nPrincipal Functions\n\n\nThe principal functions of the Commission, as set out by subsection 10 (1) of the Act, are as follows: \n1.to investigate matters relating to a relevant criminal activity or serious crime concern referred to the Commission by the Management Committee for investigation; \n2.to assemble evidence that would be admissible in the prosecution of a person for a relevant offence arising out of any such matters and to furnish any such evidence to the Director of Public Prosecutions; \n3.to furnish evidence obtained in the course of its investigations (being evidence that would be admissible in the prosecution of a person for an indictable offence against the law of the Commonwealth or another State or Territory) to the Attorney General or to the appropriate authority in the jurisdiction concerned; \n4.to reinvestigate matters relating to any criminal activity that were the subject of a police inquiry (being an inquiry referred for reinvestigation to the Commission by the Management Committee) and to furnish its findings to the Committee together with any recommendation as to action the Commission considers should be taken in relation to those findings; \n5.to furnish in accordance with the Act reports relating to organised and other crime, which include, where appropriate, recommendations for changes in the laws of the State; \n6.to provide investigatory, technological and analytical services to such persons or bodies as the Commission thinks fit; and \n7.with the approval of the Management Committee, to work in co-operation with such persons or authorities of the Commonwealth, the State or another State or Territory (including any task force and any member of a task force) as the Commission considers appropriate\nSource: this is an extract from the company’s own website."},
{"employer_url": "https://www.seek.com.au/companies/office-of-the-integrity-commissioner-qld-820219", "employer_name": "Office of the Integrity Commissioner QLD", "employer_info": "Richard Bingham: Queensland Integrity Commissioner\n\nThe Queensland Integrity Commissioner is an independent officer of the Queensland Parliament who is responsible for providing advice on integrity and ethics issues and for maintaining the lobbyists register.\n\nUnder the Integrity Act 2009, the Integrity Commissioner can give written advice to Ministers, MPs, senior public servants and others about ethics or integrity issues, including conflicts of interest.\nHe may also meet with and give advice to MPs on ethics and integrity issues in relation to their declarations of financial interests.\n\nThe Integrity Commissioner is responsible for maintaining the Queensland Lobbyists Register and monitoring compliance by lobbyists and government with the Act and the Lobbyists Code of Conduct.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/office-of-the-ombudsman-nt-867939", "employer_name": "Office of the Ombudsman NT", "employer_info": "The Ombudsman NT resolves and investigates complaints about Northern Territory Government departments and authorities and Local Government Councils. The Ombudsman also oversights investigations into complaints about police conduct. \n\nBefore making a complaint to us you are encouraged to take all possible steps to resolve your concerns directly with the relevant department. We will not normally investigate a complaint until you have exhausted all regular avenues of appeal or review available. We will assist you to make contact with the appropriate person within a department if needed.\n\nComplaints concerning the conduct of members of the Northern Territory Police are not subject to the same restrictions. The Ombudsman Act specifically requires both the Commissioner of Police and the Ombudsman to notify each other of the details of any complaint they receive. The complaint will then be handled dependent on its seriousness.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/office-of-the-information-commissioner-nt-868121", "employer_name": "Office of the Information Commissioner NT", "employer_info": "The Information Commissioner is the independent officer appointed to oversee the Freedom of Information and Privacy provisions of the Northern Territory Information Act. \n\nThe Commissioner is also appointed as the Commissioner for Public Interest Disclosures and has responsibility for the implementation of the Public Interest Disclosure Act. (the Office of the Commissioner for Public Interest Disclosures or Whistleblowers has a separate website: http://www.blowthewhistle.nt.gov.au.\n\nBrenda Monaghan is the Commissioner for Information and Public Interest Disclosures.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/office-of-the-queensland-chief-scientist-795808", "employer_name": "Office of the Queensland Chief Scientist", "employer_info": "Queensland Chief Scientist's role\n\nThe Queensland Chief Scientist provides leadership in science policy development and implementation and provides high level, strategic advice to the Queensland Government on the role of science, research and innovation in meeting Queensland’s economic challenges. The Chief Scientist also provides advice on maximising opportunities from the Government’s investment in research and development. The Queensland Chief Scientist is a whole-of-government position that sits within the Department of Science, Information Technology and Innovation.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/office-of-the-governor-queensland-819519", "employer_name": "Office of the Governor Queensland", "employer_info": "The Office of the Governor provides support to the Governor in all aspects of the Governor’s role as he carries out official duties for the benefit of the Queensland people.\nSource: this is an extract from the company’s own website."},
{"employer_url": "https://www.seek.com.au/companies/office-of-the-health-ombudsman-qld-795837", "employer_name": "Office of the Health Ombudsman QLD", "employer_info": "Office of the Health Ombudsman\n\n\n\nThe Office of the Health Ombudsman is Queensland’s health service complaints agency. We are an independent statutory body and the one place all Queenslanders should go if they have a complaint about a health service provider or a health service provided to them, a family member or someone in their care.\n\n\n\n\n\nOur vision\n\nTo be the cornerstone of a transparent, accountable and fair system for effectively and expeditiously dealing with complaints and other matters related to the provision of healthcare in Queensland.\n\n\nOur purpose\n\nTo protect the health and safety of the public and instil confidence in the health system in Queensland by assessing, investigating, resolving and prosecuting complaints about healthcare.\nSource: this is an extract from the company’s own website."},
{"employer_url": "https://www.seek.com.au/companies/office-of-the-great-barrier-reef-819619", "employer_name": "Office of the Great Barrier Reef", "employer_info": "The Great Barrier Reef—the world’s largest and most complex reef system—is one of Australia’s most treasured natural wonders and an international icon.\n\nThis living reef is precious to all Queenslanders and the world.\n\nIts marine ecosystem is complex—home to 600 types of soft and hard corals, more than 100 species of jellyfish, 3000 varieties of molluscs, 500 species of worms, 1625 types of fish, 133 varieties of sharks and rays, and more than 30 species of whales and dolphins.\nIt is as large as Great Britain or Japan, covering an area of around 70 million football fields, and traverses more than 2300 kilometres of Queensland’s spectacular coastline.\n\nBut the reef is also facing significant challenges, including coral cover decline from storms and cyclones, crown-of-thorns starfish breakouts and bleaching from ocean warming.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/office-of-the-director-of-public-prosecutions-qld-796187", "employer_name": "Office of The Director of Public Prosecutions QLD", "employer_info": "Director of Public Prosecutions\nDirector’s Guidelines\nODPP Annual Reports\nSupport for victims of crime\nAs an organisation\nEntry level/paralegal employment opportunities\nThe Office of the Director of Public Prosecutions (ODPP) represents the State in criminal cases. The community’s interest is that the guilty be brought to justice and the innocent not be wrongly convicted. The main function of the ODPP is to prosecute criminal matters in the Magistrates (limited), District, Supreme and Mental Health Courts, the Court of Appeal and the High Court of Australia.\n\nThere are three aspects to the work of the ODPP:\n\nlegal preparation\ncourt appearances\nvictim liaison work.\n\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/office-of-the-director-general-wa-795956", "employer_name": "Office of the Director General WA", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/office-of-the-director-of-public-prosecutions-nsw-795547", "employer_name": "Office of the Director of Public Prosecutions NSW", "employer_info": "The ODPP is NSW's independent prosecutorial body, created in 1987 by the Director of Public Prosecutions Act 1986. It is a medium sized government agency with about 600 staff, comprising of solicitors and administrative officers from the Solicitors Office and Crown Prosecutors.\n\nWe handle approximately 18,000 matters a year involving offences under the laws of New South Wales, including \n\n•Trials for indictable offences in the District Court and the Supreme Court \n\n\n•Committal proceedings for indictable offences in the Local Court\n\n\n•Appeals to the District Court from the Local Court \n\n\n•Appeals in the Court of Criminal Appeal and the High Court\n\n\n•Appeals in the Supreme Court and the Court of Appeal\n\n\n•Some summary hearings in the Local Court including where a police officer is a defendant and when a defendant has been charged with a sexual assault offence against a child\n\n\nAll prosecutions are conducted in accordance with the Prosecution Guidelines .\n\nOur Head Office is located in Sydney. The Director, the two Deputy Directors, and their legal and administrative support staff are based in the Head Office.\n\nThe ODPP's three western Sydney offices are located in Parramatta, Penrith and Campbelltown. There are also six offices throughout regional New South Wales: Lismore, Newcastle, Gosford, Wagga Wagga, Dubbo, and Wollongong. Solicitors and Crown Prosecutors located in the country offices conduct prosecutions in circuit courts within their region. \n\nThe Head Office has several specialised units including the Research Unit, Court of Criminal Appeal Unit, Group 6 (prosecuting special crime including police officers charged with criminal offences), the Advisings Unit and the Library.\n\nThe ODPP also has a  Witness Assistance Service (WAS) in each office. WAS provide information, support and assistance to victims of crime and witnesses in cases we prosecute.\nSource: this is an extract from the company’s own website."},
{"employer_url": "https://www.seek.com.au/companies/office-of-the-director-public-prosecutions-sa-796188", "employer_name": "Office of the Director Public Prosecutions SA", "employer_info": "What we do\nWe are responsible for prosecuting people who have been charged under South Australian laws with serious criminal offences, namely, major indictable offences.  We also conduct summary trials in complex or sensitive matters and appeals from the Magistrates Court on indictable offences.\n\nMatters typically referred to the ODPP for prosecution in the Courts include:\n\nmurder, attempted murder and manslaughter\nserious drug offences\nserious sexual offences\nmental impairment\norganised crime\nviolent assaults and aggravated robbery\nlarge scale and serious fraud offences\nserious driving offences such as causing death by dangerous driving\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/office-of-the-chief-economist-qld-828951", "employer_name": "Office of the Chief Economist QLD", "employer_info": "Australia is home to some two million businesses and 11.5 million workers. Along with the public sector, they combine to produce $1.6 trillion of output each year. The economy has enjoyed 25 years of continued economic growth despite significant economic and demographic challenges.\n\nIn the face of these challenges, our economy has adapted and evolved into a highly skilled, knowledge-based economy. The willingness of Australian businesses and workers to embrace change and seize upon opportunities is a key reason behind our success.\n\nLed by the department’s Chief Economist, Mark Cully the Office of the Chief Economist provides economic advice, analysis and statistics on topics of interest to the department and our Ministers. Our expertise rests in industry policy, innovation, sectoral analysis, energy and resources, programme evaluation and macroeconomic issues that affect business.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/office-of-the-coordinator-general-qld-828952", "employer_name": "Office of the Coordinator General QLD", "employer_info": "Assessments and approvals of infrastructure projects, including environmental and social impacts.\n\nCoordinated projects\nProjects of economic, social and/or environmental significance to Queensland. Proponents of many of these projects are required to prepare an environmental impact statement (EIS), which is evaluated by the Coordinator-General.\n\nCurrent EIS projects\nCompleted EIS projects\nCoordinated projects map\nCompliance\nMonitoring and enforcement of compliance with the Coordinator-General's conditions of approval for infrastructure projects.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/office-of-the-director-general-qld-795781", "employer_name": "Office of the Director General QLD", "employer_info": "The Office of the Director-General is the point of liaison between the department and the ministerial offices of the Attorney-General and Minister for Justice and Minister for Training and Skills and the Minister for Police, Fire and Emergency Services, Minister for Corrective Services. The Office provides professional advice and executive support to the Director-General by undertaking and coordinating policy research, analysis and by making recommendations about the operational management of the department's divisions.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/office-of-the-commissioner-for-public-employment-nt-868066", "employer_name": "Office of the Commissioner for Public Employment NT", "employer_info": "The Office of the Commissioner for Public Employment (OCPE) is a central agency within the Northern Territory Public Sector (NTPS) with sector-wide responsibility for providing an effective employment framework for the management and development of the NTPS workforce. \n\nThe Commissioner for Public Employment is the Chief Executive Officer and, under section 12 of the Public Sector Employment and Management Act, is deemed to be the employer of all employees in the NTPS.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/office-of-the-australian-information-commissioner-806041", "employer_name": "Office of the Australian Information Commissioner", "employer_info": "The Office of the Australian Information Commissioner (OAIC) is headed by the Australian Information Commissioner.\n\nThe Information Commissioner is supported by the Assistant Commissioner, Regulation & Strategy and the Assistant Commissioner, Dispute Resolution, and OAIC staff.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/office-of-racing-qld-795824", "employer_name": "Office of Racing QLD", "employer_info": "The Department of National Parks, Sport and Racing is one of two Queensland Government departments responsible for the oversight of legislation which enables the operation of the racing industry in Queensland.\n\nNPSR has administrative responsibility for the Racing Act 2002 and the Racing Regulation 2013.\n\nIts role extends to being the administrative agency with oversight of Racing Queensland — a statutory body responsible for the commercial and operational management of the state's racing industry across the thoroughbred, harness and greyhound codes — and any future control bodies for other approved codes of racing.\n\nThe department also has responsibility over other government initiatives supporting the racing industry, including the Country Racing Support Program.\n\nThe department works in conjunction with other agencies responsible for the governance and administration of the racing industry in Queensland under the Racing Integrity Act 2016. These agencies include the Queensland Racing Integrity Commission (QRIC) and Queensland Treasury.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/office-of-state-revenue-nsw-434300", "employer_name": "Office of State Revenue NSW", "employer_info": "The Office of State Revenue (OSR) is a division within the Department of Finance, Services and Innovation.\n\nAs NSW’s principal revenue agency, OSR fairly administers State taxation and revenue for, and on behalf of, the people of NSW. OSR manages fines and administers grants and subsidies to provide valuable assistance to families and enterprises across NSW. The Office also recovers debt to provide an equitable outcome for the community.\nOur vision\n\nAn excellent organisation of professional people proudly delivering community value and contemporary service.\n\nOur purpose\n\nWe contribute to a prosperous, safe and fair society by collecting revenue, resolving fines, administering grants and recovering debt.\n\nOur values\n\nWe have five key values:\n\ncollaboration\nachievement\nservice\nintegrity\ninnovation.\nOur pillars\n\nOur pillars are:\n\nClient Experience - make it easy for clients to do business with us.\nPeople and Culture - capable and engaged workforce.\nCompliance - maximise compliance.\nProcesses and Systems - processes and systems meet the needs of our stakeholders.\nGrowth and Innovation - innovate to renew services and processes and expand our service offering.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/office-of-sport-nsw-795560", "employer_name": "Office of Sport NSW", "employer_info": "The Office of Sport is an executive agency related to the Department of Premier and Cabinet.\n\nThe Office of Sport is responsible for a broad range of services and facilities that support and enrich the lives of people and communities across NSW. \n\nThe Office of Sport consists of the following divisions and entities:\nSport and Recreation ,\nVenues NSW,\n Sydney Olympic Park Authority,\n Office of Penrith Lakes,\nNSW Institute of Sport and \nSydney Cricket and Sports Ground Trust \n Source: this is an extract from the company’s own website."},
{"employer_url": "https://www.seek.com.au/companies/office-of-parliamentary-counsel-806040", "employer_name": "Office of Parliamentary Counsel", "employer_info": "The Office of Parliamentary Counsel (OPC) provides timely, high quality legislative drafting and publication services. These include drafting and advisory services for Commonwealth Bills, legislative, notifiable and other instruments as well as comprehensive public access to Commonwealth legislation through the Federal Register of Legislation website.\n\nFor information on our specialist services, please see the Services and Training page.\n\nThis site is designed to be of interest to lawmakers, legislative drafters and anyone else seeking information about Commonwealth Bills, Acts and instruments. For information for clients working with OPC including frequently asked questions, please see the Client Information page.\n\nOPC has been active in encouraging the use of plain language in legislation and developing and using plain language techniques. Please see the Plain Language page for further information. OPC has also developed the Guide to Reducing Complexity in Legislation as part of the Government’s initiative to reduce complexity in legislation.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/office-of-public-prosecutions-vic-795623", "employer_name": "Office of Public Prosecutions VIC", "employer_info": "The Office of Public Prosecutions (OPP) is Victoria’s largest criminal legal practice. Together with the Director of Public Prosecutions (DPP) and Crown Prosecutors the OPP prosecutes serious offences in Victoria’s County and Supreme Courts and conducts criminal appeals in the County Court, the Court of Appeal and the High Court of Australia.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/office-of-state-revenue-wa-795971", "employer_name": "Office of State Revenue WA", "employer_info": "We have a strong focus on service to our diverse range of customers, including taxpayers, other government agencies, people buying their first home, major construction companies and suppliers to government. \n\nThe Department of Finance was created on 1 July 2011 from the previous Department of Treasury and Finance and comprises of several businesses: \nBuilding Management and Works is responsible for the construction of government buildings such as hospitals, schools and police stations; the maintenance of government buildings; the management of the government’s office portfolio; and the administration of a range of heritage and built environment matters. \nGovernment Procurement leads the buying function at a whole-of-government level, providing-value-for-money outcomes for government through goods, services and human services procurement. \nThe State Revenue business is dedicated to the administration of revenue, grant and subsidy schemes for community benefit. \nPublic Utilities Office leads the provision of advice to government on essential utility services with a focus on energy, to benefit the community and business.\nEconomic Reform aims to drive best regulatory practice and be a leading catalyst for competition and productivity improvements across Western Australia. \n\nAll these functions are supported by the Corporate Services business, which provides a range of services that support and add value to the Department in the areas of Human Resources Management, Finance, Information and Communications Technology, Corporate Communications and Risk and Policy. \n\nStrategy and Coordination is a small team providing direct support to the Director General and the Corporate Executive in the management of strategic matters across the business and in the coordination of whole-of-Department activities and initiatives.\nSource: this is an extract from the company’s own website."},
{"employer_url": "https://www.seek.com.au/companies/office-of-local-government-sa-795905", "employer_name": "Office of Local Government SA", "employer_info": "The Office of Local Government provides policy and other advice to the Minister for Local Government on:\n\nthe constitution and operations of the local government system, particularly the legislative framework for councils' operation\nthe two statutory authorities for which the Minister is responsible\nOutback Communities Authority\nLocal Government Grants Commission\nwhole of government policy and legislative frameworks affecting local government\nthe constructive relationship between the state government, local councils and associated representative groups.\n\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/office-of-mens-policy-nt-867927", "employer_name": "Office of Men's Policy NT", "employer_info": "The Office of Men’s Policy works to ensure men are considered fully when developing, implementing, monitoring and evaluating Northern Territory Government policy.\n\nThe four key focus areas of the policy framework for Northern Territory men are:\n\ncommunity safety\nhealth and wellbeing\npartnership and engagement\nsupporting young Territory males into adulthood.\nIn addition, the office also supports:\n\nmen’s leadership and participation\nkeeping Territory families safe\nIndigenous males advisory council\nfacilitation, engagement, consultation, policy advice and reporting on issues affecting Northern Territory men\npromotion of regional strategies\ndevelopment of communications campaigns.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/office-of-local-government-nt-868157", "employer_name": "Office of Local Government NT", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/office-of-gaming-and-licensing-nt-868002", "employer_name": "Office of Gaming & Licensing NT", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/office-of-education-nsw-795461", "employer_name": "Office of Education NSW", "employer_info": "The department is implementing a range of reforms to improve the quality of teaching in schools, to improve outcomes for all students, and to give schools greater authority to meet the needs of their communities.\n\nImproving teacher quality\n\nWe are improving the quality of teaching at every school with a range of reforms. These changes start at university where the practicum experience has been strengthened to better prepare people starting their teaching careers.\n\nBeginning teachers are given additional support in their first two years of teaching, with schools being given additional funding to give teachers a good career start.\n\nA new teacher award incorporates standards based remuneration for classroom teachers.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/office-of-environment-and-heritage-nsw-795555", "employer_name": "Office of Environment & Heritage NSW", "employer_info": "Working with the community, OEH cares for and protects NSW’s environment and heritage, which includes the natural environment, Aboriginal country, culture and heritage, and built heritage. OEH supports the community, business and government in protecting, strengthening and making the most of a healthy environment and economy in NSW.\n\nOEH organisation and services\n  \nThe Office of Environment and Heritage (OEH) consists of five functional areas:\n1) National Parks and Wildlife Service\n2) Regional Operations\n3) Heritage\n4) Policy\n5) Science\nSource: This is an extract from the company's own website"},
{"employer_url": "https://www.seek.com.au/companies/office-of-asian-engagement-nt-868265", "employer_name": "Office of Asian Engagement NT", "employer_info": "Asian engagement, trade and investment strategic plan 2015 to 2020\nThe Asian engagement, trade and investment strategic plan outlines the Northern Territory Government’s direction for international engagement over the next five years, from 2015 to 2020. \n\nEvery year, we will review our progress towards four strategic goals and four critical enablers that will help us achieve those goals.\n\nAsian engagement, trade and investment strategic plan 2015 to 2020 (95.2 kb)\nAsian engagement, trade and investment strategic plan 2015 to 2020 (3.0 mb)\n\nStrategic goals\n\nStrategic goals include:\n\nthe Northern Territory will achieve increased economic returns from a diversified range of exports\nthe Northern Territory will be an excellent partner for capacity-building assistance with our near neighbours\nlong term international investment in the Northern Territory will increase across the natural resources, infrastructure and tourism sectors\nthe Northern Territory will be positioned as a pre-eminent supply and service hub in our region.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/office-information-australia-943886", "employer_name": "Office Information Australia", "employer_info": "IT Management\n\nOIA understands that your ability to run your business efficiently relies on your Information Technology being reliable and cost effective.\n \nOIA provides a comprehensive range of Solutions and Services that best fit your IT needs.\n​\nInformation Management\n\nInformation Management is the management of organisational processes and systems that acquire, create, organise, distribute, and use information.\n \nOIA provides a range of Solutions to effectively manage the information life-cycle within your business.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/office-of-government-procurement-wa-795970", "employer_name": "Office of Government Procurement WA", "employer_info": "We have a strong focus on service to our diverse range of customers, including taxpayers, other government agencies, people buying their first home, major construction companies and suppliers to government.\n\nThe Department of Finance was created on 1 July 2011 from the previous Department of Treasury and Finance and comprises of several businesses:\n\nBuilding Management and Works is responsible for the construction of government buildings such as hospitals, schools and police stations; the maintenance of government buildings; the management of the government’s office portfolio; and the administration of a range of heritage and built environment matters.\nGovernment Procurement leads the buying function at a whole-of-government level, providing-value-for-money outcomes for government through goods, services and human services procurement.\nThe State Revenue business is dedicated to the administration of revenue, grant and subsidy schemes for community benefit.\nPublic Utilities Office leads the provision of advice to government on essential utility services with a focus on energy, to benefit the community and business.\nEconomic Reform aims to drive best regulatory practice and be a leading catalyst for competition and productivity improvements across Western Australia.\nAll these functions are supported by the Corporate Services business, which provides a range of services that support and add value to the Department in the areas of Human Resources Management, Finance, Information and Communications Technology, Corporate Communications and Risk and Policy.\n\nStrategy and Coordination is a small team providing direct support to the Director General and the Corporate Executive in the management of strategic matters across the business and in the coordination of whole-of-Department activities and initiatives."},
{"employer_url": "https://www.seek.com.au/companies/office-national-435417", "employer_name": "Office National", "employer_info": "Tailoring office supply and technology solutions for all your business needs, Office National is part of the largest independent business to business provider of office products and business technology solutions in Australia.\n \n \nAt Office National, we consider our role in your business as much more than a service provider. Office National has already earned a solid reputation for providing reliable office supplies and technology, and now we'd like to join you in building your business.\n \n \nOur aim is to further strengthen our relationship by equipping you with the tools to remain up-to-date in an increasingly competitive environment. Office National, \"We mean business\"\n \n \nOffice National is 100% Australia owned and operated and a proud member of Ausbuy.\n \n\nSource: This is an extract from the company's own website"},
{"employer_url": "https://www.seek.com.au/companies/office-brands-995269", "employer_name": "Office Brands", "employer_info": "The story of Office Brands begins in 1999 with the merger of 3 dealer groups, Office Force, Office Network and A.P.T to create Office National Limited. By combining their strengths in office products, business machines and technology, they were able to provide customers with a complete office products and business technology solution. Together they were also able to combine their purchasing power and improve the cost of producing catalogues and managing data.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/off-ya-tree-834421", "employer_name": "Off Ya Tree", "employer_info": "Off Ya Tree\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nThe Leaders in Alternative Clothing and body modification.\nOff Ya Tree has over 33 stores across Australia and we pride ourselves on being one of the forerunners in the alternative lifestyle and body modification industry.\n\nWhen it comes to living an alternative lifestyle, Off Ya Tree is able to offer edgy fashion and design. With a variety of clothing, accessories, costume jewellery, body jewellery and smoking paraphernalia Off Ya Tree is one of Australia’s pioneering brands in the alternative world.\n\nSelected Off Ya Tree stores also offer a Punktured Body Piercing and Tattooing studio. We were actually the very first retail store in Australia to offer piercings to customers in Shopping Centre’s. We offer all types of piercing and tattooing in a professional and hygienic manner. It’s the perfect accessory to all the fashion pieces you’ll be picking up on your way out!\n\nWhilst we only adopted the name “Off Ya Tree” about fifteen years ago, we have been around in one form or another for over 30 years.\n\nWe also have a large online presence throughout our partner brand The Bong Shop and also our social media channels.\n•Off Ya Tree Facebook\n•Off Ya Tree Instagram\n•Off Ya Tree Tumblr\n•The Bong Shop\nSource: this is an extract from the company’s own website."},
{"employer_url": "https://www.seek.com.au/companies/odyssey-house-436125", "employer_name": "Odyssey House", "employer_info": "Odyssey House is dedicated to the provision of a dynamic and diverse range of services to our clients who are adults with alcohol and other drug dependencies who frequently have chronic health, behavioural and psychological issues.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/odg-haden-437428", "employer_name": "ODG Haden", "employer_info": "O'Donnell Griffin is a leading provider of electrical and communications engineering solutions.\n\nWhether it is a new greenfield project, an upgrade to an existing site, or the ongoing service and maintenance of critical assets, O'Donnell Griffin has the capability to provide a complete electrical and communications engineering solution. \n\nWe have the capacity to integrate specialist skills in mechanical, civil, and other engineering disciplines to offer our customers turnkey design, construct and maintenance packages. \n\nThe cross utilisation of resources throughout Australia and New Zealand, strengthens our delivery capability to rail, mining, telecommunications, infrastructure, power, property, health and agribusiness markets.\n\nSince 1906, O'Donnell Griffin has played an integral role in the development of Australasian infrastructure for Government and private industry. With 25 branches and over 1500 skilled employees throughout Australasia, O'Donnell Griffin has the resources to deliver your mission critical projects.\nSource: This is an extract from the company's own website"},
{"employer_url": "https://www.seek.com.au/companies/office-of-employment-and-training-nt-868295", "employer_name": "Office of Employment & Training NT", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/odecee-815072", "employer_name": "Odecee", "employer_info": "Who we are\nWe are technologists, innovators and trusted experts. Our passion lies in dreaming up and delivering customer-led solutions that allow enterprises to anticipate – not just react to – the emerging technology tidal wave.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/octec-814068", "employer_name": "Octec", "employer_info": "OCTEC provides Disability Employment Services across the ACT and Queanbeyan, Sydney and regional NSW, a large part of north-eastern Victoria and the eastern bayside suburbs of Melbourne. OCTEC operates from 50 sites across NSW, the ACT and Victoria, making it one of the largest providers of Disability Employment Services in the country.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/ocs-433422", "employer_name": "OCS", "employer_info": "OCS Group has been providing a substantial range of high quality solutions to clients across the country since 1998 and has strong capabilities to provide you with various Outsourced Client Solutions. We are here to listen to your needs and address them in an efficient and cost-effective manner. We strive to seamlessly integrate with your business and provide only the best solution to meet your individual needs. Our organisation believes in working with clientele in select sectors providing solutions that we hold strong knowledge in and can develop mutually beneficial long-term partnerships with.\nSource: this is an extract from the company's own website"},
{"employer_url": "https://www.seek.com.au/companies/oconnor-primary-school-872620", "employer_name": "O'Connor Primary School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/odonnell-griffin-432851", "employer_name": "O'Donnell Griffin", "employer_info": "O'Donnell Griffin is a leading provider of electrical and communications engineering solutions.\n\nWhether it is a new greenfield project, an upgrade to an existing site, or the ongoing service and maintenance of critical assets, O'Donnell Griffin has the capability to provide a complete electrical and communications engineering solution.\n\nWe have the capacity to integrate specialist skills in mechanical, civil, and other engineering disciplines to offer our customers turnkey design, construct and maintenance packages.\n\nThe cross utilisation of resources throughout Australia and New Zealand, strengthens our delivery capability to rail, mining, telecommunications, infrastructure, power, property, health and agribusiness markets.\n\nSource: This is an extract from the company’s own website."},
{"employer_url": "https://www.seek.com.au/companies/oconnor-marketing-806034", "employer_name": "O'connor Marketing", "employer_info": "WE’VE ALREADY TAKEN SOME GIANT LEAPS FORWARD. BUT WHAT’S NEXT?\n\n\n\n\nAt O’Connor Marketing, we believe that our power lies within our people. Our community of talented and enthusiastic professionals are our greatest asset and allow us to reach out and connect your brand to a wider audience than you ever dreamed possible.\n\nAll of our marketing and promotion strategies are formed from the same three foundations – innovative thinking, unbeatable attention to detail, and motivated sales teams trained to the highest standard. Specialising in customer acquisitions through event marketing, promotional, and business-to-business campaigns, we provide our clients with a professional and personalised service that is as unique as they are. Our creative, in person campaigns bridge the ever increasing gap between brands and consumers, delivering a high return on investment, and resulting in long-term growth for our clients. When working with a client, we start with the end in mind to ensure we create a clear plan for each campaign. This allows us to stay on course and steer through any potential market changes or emerging trends in order to generate the results your business deserves.\n\nSince our establishment, we’ve been working to increase the impact our company and our services have on our staff, contractors and suppliers. It’s an ongoing effort, and we want to keep you posted on what we’re doing. In 2015, we invested in the future of 3 budding entrepreneurs by assisting them achieve their long term goals of opening their own businesses;\nSource: this is an extract from the company’s own website."},
{"employer_url": "https://www.seek.com.au/companies/oconnor-education-support-centre-872619", "employer_name": "O'Connor Education Support Centre", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/oconnor-beef-995267", "employer_name": "O'Connor Beef", "employer_info": "With an envied industry reputation and experience spanning over twenty five years, O'Connor is renowned for supplying premium beef to discerning customers is globally.\n\nO'Connor has a respected market reputation founded on years of business integrity, delivering quality product and exceptional service. We are considered one of Australia's best due to our unfailing commitment to best practice across all facets of the business from impeccable processing, hygiene and food  safety standards, to maintaining the highest levels of industry accreditation. \n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/oconnor-cooperative-school-872618", "employer_name": "O'Connor Cooperative School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/oconnells-centenary-hotel-815100", "employer_name": "O'Connells Centenary Hotel", "employer_info": "Since opening its doors in 1990, O’Connell’s has been at the forefront of pub gastronomy in Melbourne, blending a unique design and informality with award-winning food and service.\n\nOver the years, it has been home to some of the city’s most well know chefs including Greg Malouf, Cath Kalka and Adrian Richardson, who contributed to its success and reputation.\n\nIn creating the menu our team strive to produce innovative cuisine while remaining faithful our pub roots. \n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/obrien-real-estate-801277", "employer_name": "Obrien Real Estate", "employer_info": "The OBrien Difference\n\nOBrien Real Estate agents achieve outstanding results through market\nexpertise, focus on people with honest, respectful relationships.\n\nFounded in 2010, OBrien real estate prides itself on offering the finest in customer service. We consistently utilise the best Real Estate trainers to improve our skills which in turn delivers great results.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/obrien-glass-434277", "employer_name": "O'Brien Glass", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/oconnell-public-school-872617", "employer_name": "O'Connell Public School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/obrascon-huarte-lain-814136", "employer_name": "Obrascon Huarte Lain", "employer_info": "Mission\n\nValue creation in economic, social and environmental sustainability conditions meeting the specific interests of investors, clients and the human team behind the Group.\n\nStrategy\n\nR&D&I based on contribution towards development and improved productivity and competitiveness\nSelective internationalization based on a policy of caution\nDiscipline and financial security\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/objective-corporation-861341", "employer_name": "Objective Corporation", "employer_info": "At the core of everything we do are our guiding values. \nIntegrity: \nWe respect each other. We do as we say. We do the right thing. \nExpertise: \nWe are experts, thoughts leaders and trusted advisors. We leverage our experience and expertise. We openly share our knowledge.\n Great people. Great teams: \nWe are passionate about working with great people. We empower our people to make a difference. We believe that individuals can be brilliant, but it’s teamwork that delivers amazing results. \nTenacity: \nWe believe there is always a solution. We relentlessly strive for outcomes.\nEntrepreneurial: \nWe aren’t afraid to challenge the status quo. We take informed risks. We don’t let structure or process get in the way.\nResults Matter: \nWe’re passionate about our customers’ success. We do what it takes to deliver the outcomes. We measure results and celebrate success.\nSource: this is an extract from the company’s own website."},
{"employer_url": "https://www.seek.com.au/companies/obriens-montessori-centre-872609", "employer_name": "O'Briens Montessori Centre", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/objective-assessment-813292", "employer_name": "Objective Assessment", "employer_info": "In the commercial world, the greatest challenge for CEO’s is to build a highly successful sales team.\nSales are the lifeblood of every business yet so few achieve the sales performance that they know is possible.\n\nOur vision is to partner with organisations that are committed to growing their sales capability and demanding greater performance from their sales teams.\n\nWho in your sales organisation has what it takes to become a top performer?\nWith the right development, management and leadership, what are your people capable of?\nHow many opportunities are being wasted by salespeople who make excuses?\nWhat do you need to do right now to build revenue and profit?\nDo you believe that it’s important to be able to answer these questions? We do.\n\nIn most organisations, the top few salespeople carry the rest of the sales team; can you imagine having a team of ‘A’ players all exceeding your expectations?\n\nWe can remove the risk of hiring the wrong salesperson and give you the ability to select ‘A’ players all of the time; those salespeople that drive growth and profitability.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/obrien-group-australia-432941", "employer_name": "O'Brien Group Australia", "employer_info": "O'Brien Group is Australia and New Zealand's largest privately owned hospitality and leisure company.\n\nCelebrating its 25th year, O’Brien Group is an integrated company with multiple contracts including venue and facilities management, food and beverage operations, leisure resorts, licensed clubs, hotels, restaurants and ticketing. It has also built up a formidable property portfolio of key sites within Australia.\n\nSource: this is an extract from the company’s own website"},
{"employer_url": "https://www.seek.com.au/companies/object-consulting-434721", "employer_name": "Object Consulting", "employer_info": "We are an Australian privately owned and operated company. Our first office opened in Sydney in 1989, with our Melbourne office following in 1991. We nurture a working environment that is innovative, curious, human-centred and agile.\nWe believe co-location is key to effective communication and informed decision making. We can place our people in your office or make space in our office for you to work alongside us so we can deliver together.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/object-next-software-801276", "employer_name": "Object Next Software", "employer_info": "WE ARE A SOFTWARE DEVELOPMENT AND CONSULTING COMPANY BASED IN MELBOURNE, AUSTRALIA.\nOur strength is technology and using it to make life easier for you. We work with education institutions around the world to help them reduce their costs and boost efficiency across the board. This includes admissions management, agent management and digital marketing.\nWhy us?\nWe didn’t start of as a software company. First of all, we were education specialists. We understood admissions, recruitment, agents, and all the challenges involved. Over time, we saw a need for better processes, reduced paperwork, a smarter way of working. At Object Next we answer these needs.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/oberthur-primary-school-872608", "employer_name": "Oberthur Primary School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/oberthur-technologies-436737", "employer_name": "Oberthur Technologies", "employer_info": "OT, A WORLD LEADER IN EMBEDDED DIGITAL SECURITY THAT PROTECTS YOU WHEN YOU CONNECT, AUTHENTICATE OR PAY.\n\nOur world is now a world of permanent, uninterrupted connections. In one way or another, objects, machines and people are now connected to digital networks on a daily basis, whether for work, leisure, travel, shopping or administrative formalities.\n\nWith the volume of connections growing constantly, these connections are also becoming more than ever vulnerable to ill-intentioned attacks around the world. As a consequence, this digital and connected world is experiencing an increasing number of attacks, whose target is expanding from computers, email systems, payment cards, game consoles and online payments towards cars, household equipment and the many other connected objects under threat.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/oberon-public-school-872605", "employer_name": "Oberon Public School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/oberon-primary-school-872604", "employer_name": "Oberon Primary School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/oberon-south-primary-school-872607", "employer_name": "Oberon South Primary School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/oberon-high-school-vic-988258", "employer_name": "Oberon High School VIC", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/oberon-correctional-centre-872602", "employer_name": "Oberon Correctional Centre", "employer_info": "Oberon Correctional Centre is a minimum security facility for males offenders ranging from young adult offenders who complete a Young Offender Program to adult offenders who are actively working towards preparation for their release. It's been an integral component of CSNSW' strategy for managing young adults in NSW correctional centres since 1993.\n\nThe centre's Gurnang Life Challenge Program derives its name from the State Forest in which the Centre is located the Gurnang State Forest 40 kilometres from Oberon and approximately 235 kilometres south west of Sydney.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/oberon-council-806023", "employer_name": "Oberon Council", "employer_info": "Oberon was proclaimed a village in 1863 and has grown to an estimated resident shire population of 5,077 at 30 June 2002, of whom around 2,700 live in the town.\n\nOberon has good shopping facilities with most goods and services available in the town. It has a number of restaurants, cafes and takeaways while visitors staying in self catering accommodation are well serviced by supermarkets, butchers and bakeries. Shops selling clothing, accessories, fishing gear, gifts, books and collectables may also interest the visitor. Most professional and trades services are available in Oberon. Visitor accommodation ranges through hotels, motels, bed and breakfasts, self contained cottages, farmstay and caravan parks. There are also several camping grounds in the shire.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/obela-fresh-dips-and-spreads-753390", "employer_name": "Obela Fresh Dips & Spreads", "employer_info": "Our journey began in 2008. With people demanding healthier food and more vegetarian options, PepsiCo and Strauss formed a partnership in North America, introducing Mediterranean inspired hommus to the homes of millions of Americans. In the process, exposing them to new tastes, flavours and bringing people together in an exciting new way. In the USA our hommus is known under the “Sabra” name and is hugely popular, being the top-selling hommus and the leader in the chilled dips and spreads category\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/oatley-public-school-872600", "employer_name": "Oatley Public School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/oatley-west-public-school-872601", "employer_name": "Oatley West Public School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/oatlands-primary-school-872598", "employer_name": "Oatlands Primary School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/oberon-health-service-872603", "employer_name": "Oberon Health Service", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/oasis-horticulture-437003", "employer_name": "Oasis Horticulture", "employer_info": "Strategic Vision and Corporate Profile\nStrategic Vision Statement\n\nOasis Horticulture aims to be the market leader in high quality, volume green life products developed with a customer focus and produced through efficient and profitable processes which deliver value to our customers, increasing returns to our shareholders and a fulfilling work environment for our employees.\n\nCorporate Profile\n\nOasis Horticulture is highly motivated towards providing Australian gardeners and landscapers with innovative, quality products for a happier, healthier and more sustainable future.\n\nSource: This is an extract from the company's own website"},
{"employer_url": "https://www.seek.com.au/companies/oatlands-district-high-school-872597", "employer_name": "Oatlands District High School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/oakwood-state-school-819538", "employer_name": "Oakwood State School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/arthur-j-gallagher-806733?child=434045", "employer_name": "OAMPS Insurance Brokers", "employer_info": "Locally focused. Nationally resourced. Internationally represented.\nArthur J. Gallagher, the world’s fourth largest insurance broking and risk management company, expanded its presence in Australia through the acquisition of OAMPS Insurance Brokers in 2014.\n\nWe have an extensive national broking network in metropolitan and regional Australian locations. We provide broking solutions to a wide range of clients from small to medium enterprises through to large multi-national corporations, as well as affinity partners and associations.\n\nOur parent company, Arthur J. Gallagher & Co., was founded in the United States in 1927 and now employs over 20,000 people. It is listed on the New York Stock Exchange. Globally, our insurance broking operation maintains a network of more than 400 offices throughout 30 countries. \n\nSource: This is an extract from the company's own website"},
{"employer_url": "https://www.seek.com.au/companies/oatlands-public-school-872599", "employer_name": "Oatlands Public School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/oakwood-school-noble-park-872595", "employer_name": "Oakwood School Noble Park", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/oakwood-aged-care-801267", "employer_name": "Oakwood Aged Care", "employer_info": "Oakwood Aged Care is a 78 bed facility located in a peaceful, residential area of Enfield, South Australia. It has several secluded courtyards and is surrounded by tranquil gardens, yet has many local shops and amenities close at hand. Our residents enjoy personalised care and a variety of lifestyle choices in a homelike environment.\n\nOur Facility\n\n\n\nOakwood Aged Care is a sprawling 78 bed, single story facility divided into two wings, East and West. Our residents are able to choose to socialise in the two large lounge areas or spend quieter time in one of the small sitting areas dotted around the facility. A visitors room is also available for those who wish to spend private time with family and friends.\n\nOutdoors, residents are once again spoilt for choice as there are restful enclosed courtyards and small garden areas to relax in as well as the spacious main garden which includes a large shady pergola so outdoor activities can take place regardless of weather conditions.\n\nIn addition to a variety of dining and lounge areas we offer a choice of bedrooms at Oakwood Aged Care. Single rooms, with or without ensuite and double rooms allow residents to decide which style of accommodation best meets their needs.\n\nAll bedrooms at Oakwood Aged Care have a garden view and are in close proximity to a communal area. We encourage residents to personalise their bedroom with a favourite bedcover, photos, art and mementos so that they always feel comfortable and right at home.\n\nOur Care\n\n\n\nOakwood Aged Care provides our residents with personalised care and attention in all areas of life. Our dedicated staff are enthusiastic about ensuring the residents have opportunities to make choices where and how they spend their time in our facility. After all, they are aware that they are only visitors in the resident’s home.\n\nEach resident has a care plan individually developed which is reviewed regularly to ensure their personal and medical needs are met. Residents are free to choose their own General Practitioner. Pharmacy deliveries are made twice daily. A wide range of other professionals such as physiotherapist, podiatrist, speech pathologist, audiologist, dentist, optician or dietician may be consulted according to resident need and desire.\n\nAs well as nursing and care staff, kitchen, laundry, maintenance, gardening and cleaning staff who work hard to ensure all possible comforts are provided to residents, Oakwood Aged Care has a dedicated Lifestyle Team that encourages residents to be involved in a range of enjoyable activities throughout the day. Residents are free to choose from group activities such as concerts, outings, craft, church services, monthly birthday parties, games and exercise classes.  Individual activities are offered to residents who prefer extra one to one attention. A monthly calendar is provided to each resident so that their family and friends feel welcome to participate when possible.\nSource: this is an extract from the company’s own website."},
{"employer_url": "https://www.seek.com.au/companies/oakville-public-school-872594", "employer_name": "Oakville Public School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/oakley-753329", "employer_name": "Oakley", "employer_info": "SOCIAL INNOVATION\nWorking together to create meaningful solutions to the world’s most significant social challenges.\nAt Oakley, we know everything in the world can and will be made better through design and innovation. We strive to design sustainable solutions, disrupt mediocrity and inspire for social and environmental excellence.\n \nProduct Donation Requests\nOakley supports 501(c)(3) nonprofits that share our passion and innovative approach to solving critical social issues while empowering those who face the hardest challenges in life. We invite you to check out our charitable guidelines and submit a donation request.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/oaks-hotels-and-resorts-434358", "employer_name": "Oaks Hotels & Resorts", "employer_info": "Founded in Australia 1991, Oaks has become highly sought after by independent travellers who like freedom of choice & quality space when they travel. Renowned for our flagship serviced apartment style accommodation, our customers enjoy choosing the room size that is right for them. From hotel style rooms up to 1, 2 and 3 bedroom apartments and villas. Oaks offers a home away from home in outstanding leisure & city locations. With 53 properties in Australia, New Zealand, Thailand, Dubai & Abu Dhabi, Oaks has the largest portfolio in the Minor Hotel Group family of brands. Oaks employees have access to exciting travel discounts & perks with both Oaks and our sister brands Anantara, AVANI, Elewana Collection, Per Acquum and Tivoli Hotels."},
{"employer_url": "https://www.seek.com.au/companies/oakleigh-state-school-820176", "employer_name": "Oakleigh State School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/oakton-433145", "employer_name": "Oakton", "employer_info": "\n\n"},
{"employer_url": "https://www.seek.com.au/companies/alh-group-432530?child=995523", "employer_name": "ALH Group", "employer_info": "ALH Group helps people live it up at our leading portfolio of pubs across Australia. We offer a diverse hospitality experience including electronic gaming, sports bars, bistros, restaurants, cafes, retail liquor, accommodation, nightclubs and wagering. Our facilities are located in capital cities and urban and regional centres across Australia.\n\nWe employ over 15,500 people across Australia at more than 320 licensed venues and in excess of 550 retail liquor outlets.\n\nSource: this is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/oakleigh-primary-school-872592", "employer_name": "Oakleigh Primary School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/oakleigh-south-primary-school-872593", "employer_name": "Oakleigh South Primary School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/oaklands-central-school-872590", "employer_name": "Oaklands Central School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/oakey-beef-exports-435453", "employer_name": "Oakey Beef Exports", "employer_info": "The vision at Oakey Beef Exports is one of progressive leadership in hygienic processing and packaging of superior premium beef products for the world market.\n\nThe realization of this goal is integral in the Abattoir’s consistent and well-respected relationship with suppliers, customers, employees and its committed alliance to the Australian environment.\n\nEstablished in 1956, Oakey Beef Exports in Queensland’s Darling Downs region is one of Australia’s largest beef processing plants, employing more than 750 people from Oakey, Toowoomba and the surrounding districts. It offers employment, growth and development for the region, and for the industry.\nNH Foods Australia (NHA) purchased the Oakey Beef Exports in 1986 and has since rebuilt the facility into an award winning, vertically integrated supply chain business.\n\nNow, through a sophisticated innovation process, the Abattoir is able to comprehensively trace its meat products from the animal’s property of birth, through to the end user (from farm to plate).\n\nThis traceability includes details on the animal, workers, defects, yield, and volume data – offering surety to wholesalers, end users, and consumers. \n\nSource: this is an extract from the company’s own website."},
{"employer_url": "https://www.seek.com.au/companies/oakey-state-high-school-819397", "employer_name": "Oakey State High School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/oakey-state-school-819872", "employer_name": "Oakey State School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/oakey-hospital-821505", "employer_name": "Oakey Hospital", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/oakenden-state-school-819838", "employer_name": "Oakenden State School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/oakbank-area-school-872586", "employer_name": "Oakbank Area School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/oakhill-college-801266", "employer_name": "Oakhill College", "employer_info": "On behalf of the entire leadership of Oakhill College I welcome you to this website.\nThe purpose of Oakhill College is to provide a human and Christian education to the young, especially the poor. We are not alone in this endeavour. All educational sites of the Institute of the Brothers of the Christian Schools align to this purpose, set down over 330 years ago by the Founder, St John Baptist De La Salle.\n\nWe share this Lasallian purpose with schools in our District of Australia, New Zealand, Papua New Guinea and Pakistan; along with more than 84,000 teachers in 65 universities and colleges, and 92 schools and welfare institutions, serving more than 800,000 students and children living in 81 countries. We are open to and respectful of all faiths and cultures, and our staff and volunteers are representative of the community we serve. Ours is a global community rich in linguistic, cultural, historical and traditional diversity yet universally committed to education.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/oakhill-drive-public-school-872589", "employer_name": "Oakhill Drive Public School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/oakdale-public-school-872588", "employer_name": "Oakdale Public School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/oak-valley-aboriginal-school-872584", "employer_name": "Oak Valley Aboriginal School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/oak-park-primary-school-872583", "employer_name": "Oak Park Primary School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/oak-flats-high-school-872580", "employer_name": "Oak Flats High School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/oak-flats-public-school-872581", "employer_name": "Oak Flats Public School", "employer_info": null}
]}