{
  "data":[
{"employer_url": "https://www.seek.com.au/companies/xari-group-977402", "employer_name": "Xari Group", "employer_info": "Xari group is the brainchild of its founders Aaron Hawke and Jeremy Johnson as they realised that they share a unique vision, and have the same passion for technology, client relationships and continued development of innovative products and services that so many fail to deliver. \n\n The partnership, which resulted in the formation of xari group, represents a pooling of the expertise, experience and synergies of two leading technology firms, in order to develop and provide superior products and service offerings.\n\n The adage that best sums up this partnership is ‘one plus one equals three’.\n\nThe team at xari group is made up of passionate people who are driven by the continuous search for improvements and a desire to deliver only the highest quality of work.\n\nMission:\n“To make a positive difference to our client’s businesses and to how they experience their technology”. \nSource: This is an extract from the company's own website"},
{"employer_url": "https://www.seek.com.au/companies/xylem-water-solutions-436453", "employer_name": "Xylem Water Solutions", "employer_info": "Xylem Comprises four growth centres - Dewatering, Transport (Pumping), Analytics and Treatment and Applied Water Systems (AWS). These businesses are interconnected, anticipating and reflecting evolving needs and sharing their applications expertise to cover every stage of the water cycle.​\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/xtralis-977520", "employer_name": "Xtralis", "employer_info": "Xtralis, now a part of Honeywell, is the leading global provider of powerful solutions for the very early & reliable detection, remote video verification, and rapid, effective response to smoke, fire, gas, and security threats. Our technologies prevent disasters by giving users time to respond before life, critical infrastructure or business continuity is compromised. We protect high-value and irreplaceable assets belonging to the world’s top governments and businesses. \n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/xstract-mining-consultants-802630", "employer_name": "Xstract Mining Consultants", "employer_info": "Welcome to Xstract Mining Consultants – a team of people who know the mining, geotechnical, resources and investment world.\n\nWe bring the benefits of our experience, expertise and in-depth knowledge to our clients and work closely with them to ensure they get the right results.\n\nXstract is a diversified group providing the highest level of professional services in the areas of geology, geotechnical, mining, processing, corporate advisory, technologies and the environment.\n\nWe provide strategic and tactical solutions and operational services to resource projects and mining operations globally in the areas of corporate advisory, technical and consulting services, and project and mine support.\n\nOur clients benefit from an experienced and innovative team delivering a refreshing, responsive and customer-focused approach to our work\nSource: This is an extract from the company's own website"},
{"employer_url": "https://www.seek.com.au/companies/xypex-australia-834551", "employer_name": "Xypex Australia", "employer_info": "Xypex's Performance-Based Solutions are able to Enhance Concrete Durability, \n Extend Service Life of Civil & Commercial Infrastructure and Reduce Repairs & Future Maintenance Costs \n which provides Sustainability in Concrete Infrastructure. \nXypex Australia embraces Corporate Social Responsibility (CSR) through all business functions and strategies, to encourage and engage a positive impact through its business activities on the environment, employees, consumers and the community. Although originally established as a waterproofing manufacturing company Xypex Australia has now developed more industry specific products designed to enhance durability of structures. This in turn has led to the creation of our plan to support and enhance the development of the emerging philosophy of Sustainable Construction. \n\nIt is Xypex Australia's belief and goal that the Whole of Life focus now developed by our company will assist in changing the views and practices within the Building and Construction Industry pertaining to increasing the life and durability of civil infrastructure and commercial development, thereby delivering benefits to asset owners in reduced maintenance costs and longer service life as well as addressing environmental factors that demonstrate our continuing embracing of corporate responsibility.\nSource: this is an extract from the company’s own website."},
{"employer_url": "https://www.seek.com.au/companies/xpo-brands-861168", "employer_name": "XPO Brands", "employer_info": "We XPOSSE brands through our unique multi-channel approach, utilizing SHOPPER and promotional marketing, SAMPLING and demonstrations, and EXPERIENTIAL and events to influence purchase decisions and generate lasting brand impressions. \nWe’ve helped retailers and brands effectively ignite conversations with shoppers across many different sectors. \nWe believe that experiential staff are the human face of your brand. That’s why we prefer to call them Brand Ambassadors and value the results gained from working directly with them rather than outsourcing like many do.\n We hire Ambassadors who are experts in their individual fields from nurses, naturopaths and nutritionists to vet nurses, personal trainers, models, cooks and in-store demonstration specialists.\n Our campaigns are exciting, varied and range from the bold, beautiful and creative experiential events through to in-store sampling for Australia’s biggest brands. \nSource: this is an extract from the company’s own website."},
{"employer_url": "https://www.seek.com.au/companies/xl-express-434989", "employer_name": "XL Express", "employer_info": "XL Express is a private, wholly Australian-owned business. Our business purpose is to operate in the national deconsolidation (break–bulk) parcel sector of the transport industry, serving the needs of major shippers that have central warehousing and express road freight requirements. These shippers are seeking an alternative nation-wide distribution method that is both cost efficient and reliable.\n\nWith Branches in all mainland state capitals complemented by our own regional Branches, we bring to the market one of the most comprehensive and consistently reliable distribution services in Australia.\n\nOur unique freight solution offers economic benefits to clients that are able to work within a deconsolidation environment.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/xtreme-chemist-802574", "employer_name": "Xtreme Chemist", "employer_info": "ABOUT xtreme chemist\nFor the last ten years our promise to customers is service that displays diligence, integrity and the best possible price. \nOur services include free home delivery to the local area (Mon- Fri), medication review, personal care with the weekly management of medication. We also stock a range of French perfumes and gifts.\nWHY choose us\nXtreme Chemist is part of a growing chain of pharmacies our branches are in the following suburbs: Bellevue Hill, Blacktown, Toongabbie, Raby and Campsie\n\n \n \t \nOUR Advantages\nOur Mission is to serve our customers with diligence, integrity and best possible price. You’ll always get the best advice on consumer medicine information, Dose administration,weight loss, quitting smoking, Asthma and Type 2 D\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/xero-436185", "employer_name": "Xero", "employer_info": "\n"},
{"employer_url": "https://www.seek.com.au/companies/xchanging-433617", "employer_name": "Xchanging", "employer_info": "Xchanging provides business processing, technology and procurement services internationally to customers across multiple industries.\nXchanging’s domain experts work closely with customers across sectors, using innovative technology to transform complex back and middle office processes. By managing this complexity within their businesses; we give CXOs the freedom to simply focus on growing their business.\nXchanging offers domain centric Business Process Services across Finance and Accounting (F&A), CRM & Customer Administration and Analytics, across industries. Our industry specific solutions span the Real Estate, Healthcare, Mortgage, Energy & Trading, Education, Telecom and Logistics verticals, with an array of bespoke solutions that allow us to add value to core operations for some of the leading brands in these sectors.\nSource: this is an extract from the company’s own website"},
{"employer_url": "https://www.seek.com.au/companies/xl-marketing-436618", "employer_name": "XL Marketing", "employer_info": null}
]}