[
{"employer_url": "https://www.seek.com.au/companies/uber-806410", "employer_name": "uber", "employer_info": "Tap a button, get a ride\n\nNo cash, no tip, no hassle\n\nYou rate, we listen\n\nChoose your ride and set your location. You’ll see your driver’s picture and vehicle details, and can track their arrival on the map.\n\nWhen you arrive at your destination, just hop out—we’ll automatically charge the credit card on file. And there’s no need to tip.\n\nRate your driver and provide anonymous feedback about your trip. Your input helps us make every ride a 5-star experience.\n\nSource: This is an extract from the company’s own website."},
{"employer_url": "https://www.seek.com.au/companies/united-petroleum-433012", "employer_name": "United Petroleum", "employer_info": "United Petroleum is an independent, Australian owned petrol and convenience company which offers customers premium quality fuels and competitive pricing Australia-wide.\n\nUnited Petroleum is one of the fastest growing independent companies in Australia, specialising in the retail and wholesale fuel markets; convenience stores and ethanol manufacture; generating employment for over 2,500 Australians. \nSource: this is an extract from the company's own website"},
{"employer_url": "https://www.seek.com.au/companies/united-franchise-group-816899", "employer_name": "United Franchise Group", "employer_info": "Led by CEO Ray Titus, United Franchise Group houses a successful group of business-to-business franchise systems. Our franchised concepts specialize in personalized business services including signs, embroidery, and business brokerage. With over 30 years in the franchising industry and more than 1400 franchisees throughout the world, United Franchise Group offers unprecedented leadership and solid business opportunities for entrepreneurs.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/united-overseas-bank-435593", "employer_name": "United Overseas Bank", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/united-media-group-983091", "employer_name": "United Media Group", "employer_info": "United Media Group is a small family-based business with more than 20 years’ experience in the publishing industry.\nUnited Media Group has remained a competitive force within the media and publishing industry since its inception in early 2005. The company prides itself on its locally-based publications and top-selling status within a fiercely contested market. Titles include:\nWedding & Bride\nHome Design + Living\nKitchen + Bathroom Design\nPool + Outdoor Design\nWineries of Victoria\nWineries of South Australia\nPool + Outdoor Renovation\nA dedicated team is behind United Media Group’s unprecedented success and esteemed reputation. Each valued client has the opportunity to work closely with advertising sales representatives, production coordinators, editors and graphic designers to achieve results for their business.\nWith every issue of every magazine, editorial content and demand for advertising is on the rise. The articles featured within each of United Media Group’s publications continue to set the standard for contemporary editorial content and remain one step ahead of the latest consumer and industry trends.\nUnited Media Group gains competitive advantage within the industry through targeted marketing. Each product is specifically aimed at a niche market, which guarantees the magazines are read by the most valuable consumers. Such marketing tools prove to have a positive effect on the business performance of our valued clients.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/united-office-choice-983099", "employer_name": "United Office Choice", "employer_info": "Born from Australia's oldest office supply company WC Penfold, United Office Choice are a locally owned and operated office supplies company with retail stores and sales/distribution centres across SA, VIC, NSW, ACT and QLD.\n\nAs one of the country's largest independently owned office supply companies, United Office Choice can offer you a huge range of office supply and stationery products at extremely competitive prices, from general stationery and paper products right down to your canteen, kitchen and janitorial supplies.\n\nHere at United Office Choice we pride ourselves on the fact that we're easy to do business with, from locating the products you need quickly and effortlessly, to efficient ordering options, quality products and the fast, accurate delivery of all of your orders.\n\nAt United we assign dedicated Account Managers to each and every one of our accounts, which means, when you call you'll never be put through to an interstate call centre, EVER!\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/united-forklift-and-access-solutions-813604", "employer_name": "United Forklift and Access Solutions", "employer_info": "United Forklift and Access Solutions, previously known as United Equipment, has been operating strongly since 1973. The company has recently rebranded with a new name and style following our successful growth over the last 3 years. Our ambition is to be the best lifting solutions business in Australia. The change in name was to demonstrate more clearly what we are all about. When businesses want materials handling or access equipment, such as forklifts, telehandlers, scissor lifts or boom lifts, we want them to think of us first. With offices in most states across Australia, we offer a huge range backed by a service and support network second to none.\n\nFactors leading to United Forklift and Access Solutions significant growth is the portfolio of world leading brands they offer. In November 2010, United forklifts merged with Allforks Australia . Following this decisive merger United Forklifts has now become the Cat lift truck distributor for WA, VIC, NSW & TAS. Cat Lift Trucks are renown for their legendary toughness, uncompromising quality and low cost of ownership. Cat lift trucks can suit most industries with sizes ranging from one to sixteen tonne lifting capacities.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/united-nations-433577", "employer_name": "United Nations", "employer_info": "Australia is a founding member of the United Nations, and has consistently supported the UN’s role in world affairs since this time. \n\nThe underlying principles and purposes of the United Nations are to maintain international peace and security, to develop friendly relations among nations, and to achieve global cooperation. Australia regards the United Nations as an essential forum through which to influence world affairs, promote a stable international framework, defend Australia’s security and sovereignty, pursue trade and economic interests and promote Australian values. Australia has made important contributions to UN activity for more than 60 years, including in the areas of peace and security, human rights, development assistance and social, economic and environmental affairs.\nSource: this is an extract from the company’s own website"},
{"employer_url": "https://www.seek.com.au/companies/united-motor-traders-813587", "employer_name": "United Motor Traders", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/united-equipment-436277", "employer_name": "United Equipment", "employer_info": "United Forklifts and Access Equipment Solutions, previously known as United Equipment, has been operating strongly since 1973. The company has recently rebranded with a new name and style following our successful growth over the last 3 years. Our ambition is to be the best lifting solutions business in Australia. The change in name was to demonstrate more clearly what we are all about. When businesses want materials handling or access equipment, such as forklifts, telehandlers, scissor lifts or boom lifts, we want them to think of us first. With offices in most states across Australia, we offer a huge range backed by a service and support network second to none.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/united-airlines-802193", "employer_name": "United Airlines", "employer_info": "To help advance our goals for diversity and inclusion, United supports employee-run Business Resource Groups (BRGs). Each group, led by volunteers, increases awareness and understanding of cultural issues while nurturing the company's diverse talent, enriching the airline's organizational culture, volunteering in the local community, and contributing to company performance.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/united-advertising-group-437583", "employer_name": "United Advertising Group", "employer_info": "At UAG we pride ourselves on our fantastic company culture; we focus on facilitating a positive work environment, and enjoy rewarding our people for their achievements. We’re dynamic, forward-thinking and professional, and everyone has an opportunity to voice their ideas and opinions. Our managers incorporate fun and interesting training material into their meetings and workshops, no two days are the same!  \nWe enjoy giving our people the opportunity to experience things they never may get the chance to! When it comes to selecting the people who will attend events, it’s not always the highest achievers, it could be someone who is showing great initiative and potential or a once-off reward for a particular target being hit. Just a few things we’ve been involved in recently.  \nAll of our fundraising and sales channels are face to face. We believe this is the most effective way to communicate with our client’s target consumers.\n\n \n\n \n\nRESIDENTIAL CAMPAIGNS \n\n \n\nThis division focuses on campaigns or services that are suited to people at their residences we will talk to 40-50 people a day in 5 to 10 minute conversations about new or existing services our clients have, we will also do door knock appeals for our fundraising clients.\n\n \n\n \n\nEVENTS\n\n \n\nCurrently running successful events divisions in Brisbane and Gold Coast,  results have proven this to be a great channel through which to capture the attention of our client’s target audience, especially whilst in the ‘buying zone’. Events is the most visual form of sales and fundraising that we conduct, we set up stalls in designated areas with client branding and logos\n\n.\n\nOUTDOOR PROMOTIONS\n\n\n\n\nSimilar to events, outdoor promotions utilizes high traffic areas to gain the maximum exposure for the client/brand. Instead of stalls, we use client branded clothing and a small team of sales/fundraising representatives to engage with the public.\n\n \n\nBUSINESS TO BUSINESS\n\n\n\n\nAs the name suggests, the business to business division focuses on corporate customers. Our clients who benefit from this channel most, are those whose products and services are catered to businesses, such as telecommunications or utilities\nSource: this is an extract from the company’s own website."},
{"employer_url": "https://www.seek.com.au/companies/unisys-432534", "employer_name": "Unisys", "employer_info": "Unisys is a global information technology company that solves organisations' most pressing IT and business challenges. \n\nOur offerings include cloud and infrastructure services, application services, business process outsourcing services, and high-end server technology.\n\nFrom Federal and state government departments and agencies through to airlines, banks and a large fast food giant – Unisys Australia provides and maintains innovative solutions which touch our daily lives.\n\nUnisys delivers large scale business process outsourcing services to clients across Asia Pacific, maximizing value to their businesses by operating their mission critical, but strategically non-core, processes. \n\nSource: this is an extract from the company’s own website"},
{"employer_url": "https://www.seek.com.au/companies/uxc-training-796827", "employer_name": "UXC Training", "employer_info": "UXC Training is the education division of CSC Consulting, uplifting skills across all Practice areas to help clients build individual careers and capability within their organisations. Training courses are delivered across a comprehensive range of certifications and accreditations in program and project management, change management, IT service management, governance, standards and more.\n\nLearn From The Best\n\nDrawing on practising consultants within the CSC Consulting team, all trainers bring a unique level of real-world, practical experience to the classroom. This is why UXC Training has the highest exam pass rates in the industry. \n\nWhen you consider that over 3,000 participants attend courses every year, there is a considerable amount of individuals and organisations learning from the CSC Consulting team every day. \n\nSource: This is an extract from the company's own website"},
{"employer_url": "https://www.seek.com.au/companies/unite-marketing-435592", "employer_name": "Unite Marketing", "employer_info": "\n"},
{"employer_url": "https://www.seek.com.au/companies/unisuper-434444", "employer_name": "UniSuper", "employer_info": "\n\n"},
{"employer_url": "https://www.seek.com.au/companies/unit-clothing-802188", "employer_name": "Unit Clothing", "employer_info": "UNIT is an art-based street wear label with its heritage in two wheel action sports.\n\nInspired by their love of art and riding, Unit was born in 2002 in a house garage on the Gold Coast, Australia. The brand started with from a capital of $600. From there Unit has been on a wild ride that has seen the brand touch all corners of the globe, leaving its mark on the actions sports arena. Unit is a brand with no limitations, rules or censorship, similar to the sports the brand is involved with.\n\nThe Unit logo was inspired by the moment of ‘ignition’, the Unit logo captures the explosive chemical reaction between the spark plug and liquid gasoline or put it another way – The connection between your dream and your life.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/uxc-red-rock-consulting-436884", "employer_name": "UXC Red Rock Consulting", "employer_info": "Red Rock Consulting Pty. Ltd ACN: 081 356 425 (trading as UXC Red Rock) is a wholly owned subsidiary of UXC Limited and is the largest independent provider of Oracle consulting and managed services in Australia and New Zealand. Established in 1998, UXC Red Rock provides a complete service continuum around the Oracle ‘Red Stack’, including Applications (E-Business Suite, JD Edwards, PeopleSoft, Primavera & Demantra), Oracle Cloud Solutions, Fusion Middleware, Testing Tools, Infrastructure, ECM, BI and EPM and Database from strategy and design, to implementation, upgrades, project management, testing, licensing and managed services.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/uxc-oxygen-437211", "employer_name": "UXC Oxygen", "employer_info": "UXC Oxygen is the largest specialist SAP solutions company in the ANZ region, offering cutting-edge and innovative SAP application consulting, upgrade, implementation and support services to medium and large enterprises. \n \nOur business is in making our clients the very best they can be. We let business live.\n \nTo achieve this we need our people to be the best they can be in their field, which is why at UXC Oxygen we place such an emphasis on professional development and a commitment to a healthy work/life balance for our staff. It is how we can offer our staff and contractors the opportunities to be a part of the most innovative and progressive SAP projects in Australia & New Zealand.\n \nWe strongly believe our people are our best asset.  For it is only through our people that we can truly exemplify our values  Real. Zest. Imagine. Support. Fun. Shine. Respect. Grow. \n \nIf you share our passion for SAP and mirror our innovative and solutions focused approach let's talk. oxygen.recruit@uxcoxygen.com"},
{"employer_url": "https://www.seek.com.au/companies/uxc-keystone-796774", "employer_name": "UXC Keystone", "employer_info": "UXC has mid-market leadership in enterprise application capabilities – including Microsoft Dynamics, SAP, Oracle and ServiceNow – as well as advisory and consulting, applications management, IT infrastructure and health ICT services.  These capabilities and UXC’s entrepreneurial business and culture complement CSC’s next-generation offerings and deep industry expertise.\n\nCSC (NYSE: CSC) leads clients on their digital transformation journeys. The company provides innovative next-generation technology services and solutions that leverage deep industry expertise, global scale, technology independence and an extensive partner community. CSC serves leading commercial and international public sector organisations throughout the world. CSC is a Fortune 500 company and ranked among the best corporate citizens.\nOur Consulting and Advisory business units with over 550 resources help design the right solution to match customer needs.\n\nOur services include ICT Research, Strategy & Architecture, Change Management and Training; Service Management, Program & Project Services, Business Analysis, Communications, Cloud based Business Intelligence & Data Warehousing, Digital Transaction Management, Mobile Content Management; Quality Validation & Test Management, Information and CyberSecurity.\nMore on Consulting and Advisory\nOur IT Infrastructure business unit has more than 650 employees, and operates and manages a customer’s entire technology and application environment.  We provide innovative solutions that help customers do things faster and smarter and provide them with sustainable competitive advantage.\n\nOur services include: Network Infrastructure & Wireless, Collaboration, Data Centre, Cloud, Entertainment & Content,   Enterprise Mobility, Operational Intelligence, Managed Services and Support Services.\nSource: this is an extract from the company’s own website."},
{"employer_url": "https://www.seek.com.au/companies/uxc-eclipse-796956", "employer_name": "UXC Eclipse", "employer_info": "UXC Eclipse is a leading provider of intelligent business solutions to the enterprise and mid-market.\n\nEstablished in 1991, our success has been built by providing the highest levels of service and offering a choice of solutions from leading software vendors. We also deliver industry-specific (vertical) solutions on the Microsoft platform to meet ERP and CRM requirements.\n\nOur service offerings include applications business consulting, project management, applications development, corporate performance management and business process management. We have a team of over 600 people; we are committed to supporting over 2,700 customers across 15 global office locations.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/uxc-796770", "employer_name": "UXC", "employer_info": "UXC and its business units now operate as part of CSC\n\nUXC has mid-market leadership in enterprise application capabilities – including Microsoft Dynamics, SAP, Oracle and ServiceNow – as well as advisory and consulting, applications management, IT infrastructure and health ICT services.  These capabilities and UXC’s entrepreneurial business and culture complement CSC’s next-generation offerings and deep industry expertise.\n\nCSC (NYSE: CSC) leads clients on their digital transformation journeys. The company provides innovative next-generation technology services and solutions that leverage deep industry expertise, global scale, technology independence and an extensive partner community. CSC serves leading commercial and international public sector organisations throughout the world. CSC is a Fortune 500 company and ranked among the best corporate citizens.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/utopia-school-988306", "employer_name": "Utopia School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/uxc-connect-433414", "employer_name": "UXC Connect", "employer_info": "UXC Connect is a business unit of UXC, Australia’s largest locally owned IT services and solutions company.\n\nConnecting people anywhere, anytime, on any device to their workplace, their customers and their communities from a secure and integrated foundation supported by flexible on-premise or cloud delivery.\n\nWe establish and maintain enduring customer relationships through a partnership approach based on mutual trust, common goals and 'doing the right thing'. We also use HBDI methodology to bring ‘whole brained thinking’ to the way we interact with each other and our customers. \n\nSource: this is an extract from the company’s own website"},
{"employer_url": "https://www.seek.com.au/companies/uxc-consulting-435501", "employer_name": "UXC Consulting", "employer_info": "UXC Consulting works closely with Australia’s tier-one organisations to provide IT intelligence that transforms existing ICT service capabilities into a strategic business asset. We deliver deep domain expertise across six service pillars including: strategy and architecture; business analysis; business transformation; IT service management; communications; and project, portfolio and programme management.\n\nSetting the benchmark for industry thought leadership UXC Consulting provides deep, specialised intelligence regarding IT game-changers including cloud computing, BYO Computing and mobility.\n\nSource: this is an extract from the company’s own website"},
{"employer_url": "https://www.seek.com.au/companies/us-bank-801831", "employer_name": "US Bank", "employer_info": "We believe all people deserve the opportunity to dream, believe and achieve. The building blocks that made our country great - a stable job, a home to call your own and a community connected through culture, recreation and play - continue to be at the heart of possibility for all of us.\n\nAt U.S. Bank, we invest our time, resources and passion to build and support vibrant communities that allow every person to work toward their possible\n Ethics at U.S. Bank \n\n\nA Message to U.S. Bank's Customers and Shareholders\n\nThank you for your interest in U.S. Bank's Code of Ethics and Business Conduct. We understand that our customers trust us with their personal information and that our success is dependent upon retaining that trust. That is why our Code of Ethics and Business Conduct has been in place for many years and, although revised from time to time, continues to serve as the cornerstone of our business. \n\nOur Code of Ethics and Business Conduct is more than an expression of our commitment to integrity. It represents the guiding values of our organization and helps to instill ethically sound behavior and accountability among all U.S. Bank Employees. We diligently educate employees about our standards and provide opportunities to ask questions or report concerns. Every employee, including me, certifies compliance with our standards annually. We hold one another accountable because we understand that our reputation is fundamental to our success. To underscore our commitment to ethics at U.S. Bank, we have appointed a Chief Ethics Officer with responsibility for the oversight of all aspects of our Code of Ethics and Business Conduct. \n\nWe believe that you want to conduct business with an organization that values honesty and integrity, not only because the law requires it, but also because it is the right thing to do. At U.S. Bank, our ethical standards have always been set higher than the law requires. We are proud of our ethical heritage\nSource: this is an extract from the company’s own website."},
{"employer_url": "https://www.seek.com.au/companies/usana-health-sciences-436526", "employer_name": "USANA Health Sciences", "employer_info": "USANA manufactures the highest-rated, most effective nutritional supplements and health care products in the world. Our products are the best money can buy. \n\nWe offer our products to customers through a process called direct selling. Direct selling is a little different. It’s not the status quo. It’s not how people are used to buying what they want—after all, wouldn’t it be easier if you could just pick our products up at the grocery store? Yeah, we get that a lot.\n\nHere’s why we do what we do. We didn’t just want to give you the opportunity to take the best wellness products in the world. We wanted to give you the opportunity to make your life the best it can be. And this includes having physical health as well as financial health, so you can buy what all of us really want: freedom to do what we want, when we want.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/uts-child-care-796989", "employer_name": "UTS Child Care", "employer_info": "Partners and community\n\nUTS has a collaborative and innovative approach, with a commitment to our local and global communities, making us a preferred partner of leaders in industry, research and the professions. We provide expertise, facilities and professional services that benefit organisations and institutions internationally, as well individuals in the local community.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/urs-433639", "employer_name": "URS", "employer_info": "URS was acquired by AECOM in October, 2014. Together AECOM and URS are one of the world’s premier, fully integrated infrastructure and support services firms. We design, build, finance, and operate infrastructure assets in more than 150 countries around the world—across a broad range of markets including transportation, facilities, environmental, energy, water, and government services. Today, listed on the Fortune 500 as one of America’s largest companies, AECOM’s talented employees — including architects, engineers, designers, planners, scientists and management professionals — now serve clients in more than 150 countries around the world.\r\n                                                                                                                            Source: this is an extract from the company’s own website "},
{"employer_url": "https://www.seek.com.au/companies/urm-group-813323", "employer_name": "URM Group", "employer_info": "URM’s aim is to be recognised by the communities we serve and the Waste & Recycling Industry alike as a leading resource management company. Our mission is to develop, maintain and implement innovative waste and recycling solutions. URM is committed to exceeding customer expectations in the provision of integrated waste management services.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/ursula-frayne-catholic-college-799405", "employer_name": "Ursula Frayne Catholic College", "employer_info": "In the spirit and ethos of Catherine McAuley and the Sisters of Mercy, I welcome you to Ursula Frayne Catholic College. Our school provides quality educational programs for students from Kindergarten to Year 12. We have a proud tradition of spiritual, academic, sporting and cultural excellence. Our pastoral care program provides for a safe and caring environment where students can confidently grow to achieve their full potential. We are committed to developing young men and women of sound Christian conscience with a passion for life-long learning and a desire to make a difference in our world.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/uts-insearch-834517", "employer_name": "UTS Insearch", "employer_info": "UTS:INSEARCH is the premium pathway provider to the University of Technology Sydney (UTS), one of Australia’s leading universities. In fact, at UTS:INSEARCH our purpose is to prepare students like you to succeed at UTS. We offer leading academic English programs, UTS Foundation Studies (on behalf of UTS) and a broad choice of higher education diplomas.  \n\nSource: this is an extract from the company’s own website."},
{"employer_url": "https://www.seek.com.au/companies/urbangrowth-nsw-868030", "employer_name": "UrbanGrowth NSW", "employer_info": "UrbanGrowth NSW is the NSW Government’s urban transformation agency. We’re a State Owned Corporation (SOC) that was established in 2013, integrating and refocussing the roles of the former Landcom. We are governed by a Board of Directors and report to a Portfolio Minister (Minister for Planning) and two Shareholder Ministers (Treasurer, Minister for Finance and Services). Our mandate is to focus on large-scale urban transformation projects, while transitioning out of greenfields residential land development, a legacy of the former Landcom. Current activities are concentrated into three portfolios: Sydney CBD and Newcastle, the Bays Precinct and Western Sydney (including a small number of projects in the NSW Hunter region). \nAs the NSW Government’s urban transformation agency, it is our mission to create innovative and productive urban places with world-class standards of liveability, resilience, inclusion, affordability and environmental quality. \nSource: This is an extract from the company's own website"},
{"employer_url": "https://www.seek.com.au/companies/urbis-435738", "employer_name": "Urbis", "employer_info": "Urbis works with private sector clients across a variety of projects and we are involved with federal, state and local government, often at the highest levels. The projects range from CBD through to greenfield developments. We are highly experienced in driving the process, identifying key factors to be addressed, establishing critical paths, managing interdisciplinary teams, providing quality advice, managing the often divergent views of various parties, and developing strategies to manage and address the positions of key parties – always with client objectives as paramount. Committed to providing practical solutions, fresh ideas and creating measurable value, we will bring an informed contribution that preserves your vision and balances your needs. With Urbis, you tap into a trusted resource that complements and partners your own capabilities.\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/urbanest-814021", "employer_name": "Urbanest", "employer_info": "WE LOVE WHAT WE DO AND REALLY ENJOY BEING A TEAM SO COME AND GET TO KNOW US AND JOIN THE FASTEST GROWING STUDENT COMMUNITY IN AUSTRALIA.\n\nWe know it’s really hard to find great quality accommodation close to universities for great value for money. We also know that a safe, well looked after place to live is even more difficult to find. That’s where urbanest comes in.\n\nurbanest is one of Australia’s largest providers of student accommodation. We have a great deal of experience designing, building and running accommodation specifically designed for students.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/urbangrid-australia-816900", "employer_name": "Urbangrid Australia", "employer_info": "UrbanGrid Australia is your proven partner for a wide range of specialist services that are vital to develop, operate and maintain Western Australia’s essential water, energy and communications networks as well as civil projects.\n\nUrbanGrid Australia has been operational since 1998 and has a proven track record of ensuring consistent and high quality delivery on all projects with an uncompromising approach to safety and a strong focus on client and customer satisfaction.\n\nUrbanGrid Australia’s continued success has been as a result of a steadfast commitment to understanding our client's objectives and expectations whilst building long term partnerships.\n\nSustainable Growth Into The Future\nWe have achieved consistent and sustainable growth, and have over time refined our processes and systems to ensure that projects are undertaken using the most efficient and cost effective methods available.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/urbanedge-homes-801826", "employer_name": "Urbanedge Homes", "employer_info": "Our story\nWelcome to Urbanedge Homes.\n\nOver 12 years ago, when I established Urbanedge, I had one simple goal in mind: to offer the discerning homebuyer a real alternative to mainstream housing. Today, while our company has evolved to become synonymous with iconic street appeal and modern, innovative design, our original vision is still just as strong, and continues to underpin everything we do.\n\nI wasn’t interested in building homes without heart or soul. Having a trade background, I was passionate about the materials I used and attention to detail in my craft. I wanted this philosophy to underpin everything we do at Urbanedge.\n\nThat’s why every home we create is expertly designed, drawing on the latest styles and techniques, yet keeping long-term appeal foremost in our minds. It’s why every home we build uses superior products and materials to above industry standards – homes admired as much for their stunning aesthetic as for their exceptional value and the calibre of their craftsmanship.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/urban-st-leonards-814742", "employer_name": "Urban St Leonards", "employer_info": "HOTEL URBAN ST LEONARDS\nLocated on Sydney’s North Shore, Hotel Urban St Leonards North Sydney accommodation is a calm and relaxing haven with a focus on modern comfort. \n\nYou will have easy access to Sydney shopping hub Chatswood and boutique retail precinct Crows Nest, along with seamless public transport options available to take you the short and spectacular trip across Sydney Harbour to the Sydney CBD.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/useless-loop-primary-school-874066", "employer_name": "Useless Loop Primary School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/urban-spa-814978", "employer_name": "Urban Spa", "employer_info": "Urban Spa has grown from Suzanne’s Home of Beauty, Baulkham Hills (1980) to become the company it is today. In 1983, a second salon opened in Castle Hill and the Baulkham Hills salon had the addition of a Beauty Academy. By 1990 the Australian Academy of Beauty Therapy was well established and became a registered training organisation in 1998 being one of the first beauty therapy training schools to be Government accredited.\n\nSuzanne’s Home of Beauty moved to larger premises in Castle Hill and was renamed Emma’s Secret. The success continued with salons opening in Wahroonga, Beecroft and Chatswood over the years. The need for a quality Australian made skin care range was evident and this gave way to the development of our own products, which were used professionally in the salons and available for retail at an affordable price.\n\nIn 2006, the company launched its new concept day spa and the first Urban Spa located at Breakfast Point was opened. It offered the latest in beauty therapy with a spa experience. The Emma’s Secret salons were then transformed into the modern Urban Spa. In 2007, Urban Spa salons were opened at Gladesville and Avalon. It is also during this time the Australian Academy of Beauty Therapy moved from its premises at Castle Hill to purpose built facility at Norwest and expanded to a second premises at Strathfield.\n\nSource: this is an extract from the company’s own website"},
{"employer_url": "https://www.seek.com.au/companies/urban-purveyor-group-436359", "employer_name": "Urban Purveyor Group", "employer_info": "Today, the Urban Purveyor Group includes over 20 restaurants across New South Wales, Victoria and Queensland, as well as a bespoke beverage import and distribution business, a functions and events business, and a fully-fledged commissary kitchen, Hanseatic Fine Foods.The Urban Purveyor Group remains a wholly family-owned company. \n\nSource: this is an extract from the company’s own website"},
{"employer_url": "https://www.seek.com.au/companies/urban-security-801824", "employer_name": "Urban Security", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/urban-promotions-801823", "employer_name": "Urban Promotions", "employer_info": "Australia's Number 1 Coupon Books\n Since 1996 Urban Promotions has been introducing customers to Businesses all over Australia.\nFrom the small one person business to large multinational corporations, Urban Promotions has helped all types and sizes of businesses generate new regular customers. Urban Promotions professional team of marketing experts design the offers that attract consumers to walk into their doors.\n\nConsumers LOVE the coupons because it introduces them to local retailers through totally free offers, the retailer has an opportunity they wouldn't otherwise have had to impress you with their first rate service. In the unlikely event that you're not completely satisfied, you won't have wasted your money, and you're under no obligation to return - because there are 'no strings attached' with any of our exclusive offers. It also prompts you to enjoy goods and services that they normally put off like that family portrait or the game of ten pin bowling or a meal at restaurant or a nice facial.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/urban-building-solutions-814187", "employer_name": "Urban Building Solutions", "employer_info": "The team at Urban Building Solutions pride themselves on delivering exceptional customer service, knowledge and skill to each and every one of our customers and projects.\n \n \tiStock_000015822982Medium.jpg - small\n \t \n \t\nbigstock-Freelancer-1.jpg - small\n \t \n \tWhiteunitblock.jpg - small\n \t \n \t bigstock-Hands-of-bu1.jpg - small\n \t\n \n \t\n bigstock-Constructio1.jpg - small\n \t\n \n \t\n bigstock-two-workers1.jpg - small\n \t\n \nThe Urban Building Solutions Estimators and Supervisors are all trade qualified. This ensures that we can thoroughly inspect all requested quotations and provide detailed reports and scope of works  that in turn minimise the number of variations and keep costs as low as possible.\nOur Supervisors confidently manage all projects from start to finish ensuring only the best and most qualified tradesman are used on Urban Building Solutions worksites.\n \nAlong with our Estimators and Supervisors, Urban Building Solutions office administrators are always available to discuss job progress and answer any questions or queries you may have. The software used in our office allows us to track the progress of jobs from request date to invoiced date quickly and easily.\n \nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/urban-brisbane-814720", "employer_name": "Urban Brisbane", "employer_info": "HOTEL URBAN BRISBANE\nHotel Urban Brisbane is an architecturally designed blend of open spaces & luxury fittings creating an unmatched level of ambiance. Surrounded by Roma Street Parklands that overlook Brisbane CBD this property is the perfect place from which to enjoy your Brisbane trip.\n\nWith a stunning outdoor pool, full service gymnasium, and a well-developed cafe culture onsite you will love immersing yourself in Urban Brisbane – the heartbeat on the hill.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/urban-hotel-438231", "employer_name": "Urban Hotel", "employer_info": "The Hotel Urban is a five-star Gran Luxe hotel located in the financial, political, cultural and commercial center of Madrid. In the heart of the city’s “Golden Triangle” formed by the Prado Museum, the Thyssen-Bornemisza and the Fundación Reina Sofia, the hotel puts Madrid’s main attractions within reach, including the Paseo del Prado, Puerta del Sol, Plaza Mayor and the Retiro Park.\n\nWith a marked Art Deco style, this hotel is located in a newly-constructed avant-garde building. The hotel boasts 96 designer rooms and suites, meeting rooms, venues for special events, outdoor swimming pool (only in summer season), solarium, gym, sauna and oyster/cocktail bar.\n\nA hotel that combines charm, modernity and glamour with a dazzling artwork collection. Unique pieces of great artistic and historical value are hiding around every corner at the Urban, on display in both the hotel’s Papue New Guinea Museum and in each of its rooms and common spaces. The result is an ethnic, magical, one-of-a-kind hotel, ideal for guests that love luxury and shy away from the conventional.\nSource: This is an extract from the company's own website"},
{"employer_url": "https://www.seek.com.au/companies/urapunga-school-988305", "employer_name": "Urapunga School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/uranium-one-436893", "employer_name": "Uranium One", "employer_info": "Uranium One Inc. is a Canadian-based company and one of the world’s largest uranium producers with a globally diverse portfolio of assets located in Kazakhstan, the United States, Australia and Tanzania. Headquartered in Toronto, Uranium One is a wholly owned subsidiary of Uranium One Holding N.V. which is a wholly owned subsidiary of Rosatom, the Russian State Corporation for Nuclear Energy. \nUranium One is committed to a long-term vision that offers all stakeholders – including employees, partners, investors and those in the communities in which we operate – a set of values of which to be proud. We guide our company with honesty, integrity and accountability, striving to deliver measurable results without compromising on industry’s best practices. \nSource: This is an extract from the company's own website"},
{"employer_url": "https://www.seek.com.au/companies/urangan-point-state-school-819426", "employer_name": "Urangan Point State School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/utility-asset-management-435771", "employer_name": "Utility Asset Management", "employer_info": "At Utility Asset Services Group (UASG), we partner with our customers to provide the specialist services they need, delivered exactly the way they want them.\n\nUASG installs and maintains infrastructure, delivering operational services throughout Australia, utilising and maximising the strengths of Utility Asset Management and Skilltech brands.\n\nUASG was established by Spotless in July 2015, after acquiring Utility Services Group.\n\nAt Spotless, UASG continues to share long-lasting customer partnerships with our clients across Australia to deliver innovative and tailored utility and telecommunications service solutions across all sectors.\n\nWith specialised resources and expertise, UASG tailors innovative service solutions, safely delivering high-quality services for customers in the utilities, telecommunications, government and other corporate sectors. \nSource: This is an extract from the company's own website"},
{"employer_url": "https://www.seek.com.au/companies/urandangi-state-school-819487", "employer_name": "Urandangi State School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/urangan-state-high-school-819704", "employer_name": "Urangan State High School", "employer_info": "Urangan State High School has a strong focus on ensuring a guaranteed curriculum and high quality teaching in every classroom. \nUrangan State High School is located in Hervey Bay Education Queensland's North Coast Region and has been servicing the community of Hervey Bay since 1992. \nOur vision\n\n\"Pursuit of excellence every minute, every day\"\n\nAcknowledgement of country\n\nWe affirm that Aboriginal people and Torres Strait Islander people are the Indigenous peoples of Australia. We respectfully acknowledge the traditional custodians of the land on which we meet, the Butchulla people. We pay our respects to our elders - past, present and future - for they hold the memories, the traditions, the culture and hopes for the future. \n\nMission statement\n\nUrangan State High School is dedicated to discovering the best within all students through high quality educational and social experiences that expose them to new ideas, new ways and new possibilities for future success. \nSource: This is an extract from the company's own website"},
{"employer_url": "https://www.seek.com.au/companies/upwork-435865", "employer_name": "Upwork", "employer_info": "Post a job to tell us about your project. We'll quickly match you with the right freelancers.  \nBrowse profiles, reviews, and proposals then interview top candidates. Hire a favorite and begin your project.  \nUse the Upwork platform to chat, share files, and collaborate from your desktop or on the go.  \nInvoicing and payments happen through Upwork. With Upwork Protection, only pay for work you authorize.  \nThe best companies win with the best talent. But great people can be hard to find. We’ve created a freelancing website that connects clients with top freelance professionals from San Francisco to Sao Paulo. \n\nWhether you need one writer or an entire team of programmers, we help you find the right experts to fuel your success. Our freelancing website lets you work effortlessly with freelancers anywhere. Say goodbye to business as usual. \n\nOur Mission\n\nTo create economic and social value on a global scale by providing a trusted online workplace to connect, collaborate, and succeed.\n\n\n\nOur Vision\n\nTo connect businesses with great talent faster than ever before.\n\"Source: this is an extract from the company’s own website.\n\""},
{"employer_url": "https://www.seek.com.au/companies/uq-sport-437143", "employer_name": "UQ Sport", "employer_info": "A wholly-owned subsidiary of UQ Holdings, UQ Sport Ltd. is recognised as a leading UQ affiliate in achieving the strategic and operational goals of The University of Queensland, and in enriching the experience of thousands of students, staff and alumni who make up the UQ Community.           \n \nAn independent, not-for-profit organisation with a 105-year history, UQ Sport manages the largest multisport complex in Queensland – investing our commercial returns into facilities and services that benefit students and the wider UQ Community. With more than 70 permanent and 220+ casual employees, UQ Sport offers a wide range of sporting options across 70+ sports and activities, and operates multiple sporting and retail venues across UQ’s St Lucia and Gatton campuses.\n \nUQ Sport is a passionate and vibrant organisation that prides itself on a workplace culture that promotes fun and flexibility. In 2016, UQ Sport was officially recognised by its staff and the HR industry as one of the best places to work in Australia, awarded a Bronze Medal in the Human Resources Director (HRD) Magazine’s national ‘Employer of Choice’ Survey."},
{"employer_url": "https://www.seek.com.au/companies/upstream-solutions-435911", "employer_name": "Upstream Solutions", "employer_info": "Established as a specialist print provider, Upstream’s value was recognised by Fuji Xerox Australia – one of the world’s leading document companies – and acquired in 2010. Receiving Fuji Xerox’s backing amplified the strength of our foundation, helping us to continue delivering the best technology and expertise from leading partnerships to our broad range of clients.\n\nWe’re big enough to deliver exceptional results, but small enough to keep you firmly in the spotlight.\n\nToday, we’re recognised as experts in the field of document management, content and print solutions. Our technology includes Fuji Xerox, Lexmark and HP hardware, and we have long-term software partnerships with M-Files, Papercut and Abbyy.\n\nWe are the trusted partner of many recognisable Australian brands, delivering flexible, cost-effective document solutions.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/upskilled-983278", "employer_name": "Upskilled", "employer_info": "Upskilled is a leading Registered Training Organisation (RTO) that innovates the effective and efficient delivery of vocational qualifications and short courses to working professionals, job seekers and school leavers. As one of the largest RTOs in Australia, we partner with businesses and career-minded individuals to secure superior measurable outcomes.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/upstream-production-solutions-813614", "employer_name": "Upstream Production Solutions", "employer_info": "Upstream Production Solutions (Upstream PS) has an outstanding track record in the oil and gas industry for the provision of operations and maintenance, wellsites, engineering and production assurance services. \n\nThe Upstream PS team has served the oil and gas industry in Australia and South East Asia for more than 19 years, developing a reputation for safe, innovative and sustainable solutions to production challenges. \n\nWe are committed to expanding our business to deliver fully integrated production solutions internationally, adding value for our clients, our people and the communities in which we work. \n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/ups-433806", "employer_name": "UPS", "employer_info": "Macro-economic forces led by advancing technology, globalization and e-commerce are transforming the world and our business. We will meet the challenges they present and connect a global community, as UPS has for more than a century, with innovation, investment and the talents of our people.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/upper-murray-family-care-868218", "employer_name": "Upper Murray Family Care", "employer_info": "Under the legal entity of Upper Murray Family Care Incorporated (branded as UMFC) we are an independent, non-government, community managed agency, offering a range of quality services that are responsive to the varying needs of communities extending from the cities of Albury/Wodonga, Wangaratta and Benalla, to townships throughout the Towong, Mansfield, Alpine and Indigo shires. By providing information, support and advocacy, we seek to empower individuals, families and community groups, and to contribute to a balanced, just and ethical society. \n\nUMFC is here to help people from all walks of life – from advice on early childhood development through to support for older people and their carers, with many options in between. \nSource: This is an extract from the company's own website"},
{"employer_url": "https://www.seek.com.au/companies/upper-swan-primary-school-874048", "employer_name": "Upper Swan Primary School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/upper-mount-gravatt-state-school-820158", "employer_name": "Upper Mount Gravatt State School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/upper-hunter-shire-council-801817", "employer_name": "Upper Hunter Shire Council", "employer_info": "Upper Hunter Shire Council is a local government authority and provides an extensive array of services including health and building; town planning; aged care; sporting and recreational facilities; roads; libraries; garbage collection; airport facilities; saleyards; public venues; water; children, youth and families and tourist information.\n\nUpper Hunter Shire is located in the Hunter Region of NSW, approximately 250km north of Sydney.  The Shire is predominantly rural and encompasses 8,100km2.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/upngo-travel-799361", "employer_name": "Up'N'Go Travel", "employer_info": "About Up 'n' Go Travel\nJust a little bit about who we are and what we do.\n\nLike you, we are passionate about travel. And when those well-deserved holidays come around, you can be sure that Up’n'Go Travel will have you on your way to a vacation paradise in no time at all! A family owned and operated company established in 1999, Up’n'Go Travel offers a wide range of unique and affordable flight and accommodation packages to suit all budgets.\n\nAs one of Australia’s largest independently operated travel agencies, and with a reputation for excellence and professionalism, we can offer personalised holiday advice from our highly trained Travel Experts at extremely competitive prices.\n\nWhether you’re looking for an exciting family adventure, a relaxed couple’s retreat or an invigorating group escape, Up’n'Go Travel can cater to even your wildest holiday dreams.\n\nWith our wealth of travel expertise, you can sit back and relax, secure in the knowledge that your dream holiday will be ‘hassle-free. To ensure that your experience is everything you’ve dreamed of, Up’n'Go Travel will focus on the finer details of your holiday, and can arrange everything from transfers to travel insurance and everything in between.\n\nWe all know that security is important when booking a holiday, so you can rest assured that we’re a registered travel agency and a member of the Travel Compensation Fund who are regulated by the Australian Federal Government.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/upper-brookfield-state-school-819393", "employer_name": "Upper Brookfield State School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/upper-coomera-state-college-799364", "employer_name": "Upper Coomera State College", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/uon-868308", "employer_name": "UON", "employer_info": "The University of Newcastle is our University where knowledge is created and shared. \n\nBuilt on the principles of equity, excellence and engagement, the University of Newcastle has a reputation as a world-class institution making an impact within its own region, throughout Australia and across the globe.\n\nOur research is world-class and diverse. Our degree programs are internationally recognised and our partnerships and collaborations drive innovation. Our alumni are leaders and our students are preparing to make a difference in the world.\n\nWe are ranked in the top three per cent of universities world-wide and we have only just turned 50.\n\n\nOur University has long been known as a champion of innovative approaches to education. We strive for a dynamic teaching culture that delivers world-class educational outcomes.\n\nAs competition for the best and brightest students increases, our long history of offering innovative, problem-based learning across our programs means we are poised to meet the education challenge.\n\nWe are a research intensive university and proud of the great things we have achieved in collaboration with our partners in industry, business, government and the community - here and around the world. Our sights are set firmly on the future, as we work hard to build our research capacity and maintain our position as a competitive destination for the world's best researchers and global innovation leaders.\n\nSource: This is an extract from the company's own website"},
{"employer_url": "https://www.seek.com.au/companies/unsw-global-753101", "employer_name": "UNSW Global", "employer_info": "Welcome to UNSW Global.\n\nUNSW Global Pty Limited was established in 1999 to support the initiatives and activities of UNSW Australia in international education, assessment, large scale international assessments, training and advisory services. UNSW Global’s business now reaches into more than 20 countries worldwide, particularly in the Asia-Pacific region. Plan for expansion includes Latin America, the Middle East and Africa.\n\nUNSW Global is composed of a number of businesses that have a long and distinguished history and were the first of their kind in Australia. Each business is true to its original inception and they now range from 25 years to 50 years of continuous operation.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/university-of-wollongong-432522", "employer_name": "University of Wollongong", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/boral-432462?child=753189", "employer_name": "USG Boral", "employer_info": "Boral is an international building and construction materials group, with its headquarters in Sydney, Australia. With more than A$4.4 billion worth of annualised sales, Boral has around 12,000 full-time equivalent employees working across over 550 operating sites including joint ventures. Boral produces and distributes a broad range of construction materials, including quarry products, cement, fly ash, pre-mix concrete and asphalt; and building products, including clay bricks and pavers, clay and concrete roof tiles, concrete masonry products, plasterboard and timber. Boral primarily serves customers in the building and construction industries with operations concentrated in three key geographical markets - Australia, the USA and Asia.\nAs Australia’s largest Building and Construction Materials Company, we have career opportunities throughout Australia and across a broad range of disciplines from trade and engineering to manufacturing and logistics as well as a range of corporate functions.\n\nSource: this is an extract from the company's own website"},
{"employer_url": "https://www.seek.com.au/companies/university-of-sydney-union-753179", "employer_name": "University of Sydney Union", "employer_info": "Established in 1874, the University of Sydney Union (USU) is Australia's oldest and largest student union, evolving from a small society of ambitious student debaters to the largest service provider on campus.\n\nWe're a non-profit organisation dedicated to giving students a once-in-a-lifetime university experience. All profits from our commercial operations are directly invested back into our student programs and services.\n\nWe offer a huge range of co-curricular activities like our student leadership opportunities, entertainment and our coveted Clubs and Societies Program, which boasts more than 200 groups on campus. We also throw amazing events throughout the year like our well-known festivals.\n\nSource: This is an extract from the company's own website"},
{"employer_url": "https://www.seek.com.au/companies/university-of-southern-queensland-432965", "employer_name": "University of Southern Queensland", "employer_info": "The University of Southern Queensland (USQ) has forged a reputation as one of Australia's leading providers of on-campus and online (distance) education programs in Australia. With more than 75 percent of students studying via distance or online, the delivery of external education resources continues to lead the way. Woven into the fabric of USQ is the vision and determination of many University and community members who, over the years, have been instrumental in implementing expansion and growth, shaping what is seen today.                                                    Source: this is an extract from the company's own website"},
{"employer_url": "https://www.seek.com.au/companies/university-of-the-sunshine-coast-433133", "employer_name": "University of the Sunshine Coast", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/university-of-south-wales-799230", "employer_name": "University Of South Wales", "employer_info": "With more than 30,000 students the University of South Wales (USW) is a major player in UK higher education - one of the UK's ten biggest campus universities by student number.\n\n\nWith campuses in Cardiff, Pontypridd and Newport, the University is renowned for its partnerships with major employers. These partnerships are one of the many reasons that 94% of our students are in employment or further study within six months of graduating.\nSource: this is an extract from the company’s own website."},
{"employer_url": "https://www.seek.com.au/companies/university-of-tasmania-432845", "employer_name": "University of Tasmania", "employer_info": "The University of Tasmania  can only ever be as good as the people who choose to work with us; our staff and students are our most important asset. Realisation of our vision is dependent on a talented\nworkforce, committed to the innovative thinking required to conceptualise and operationalise our strategy and accomplish our objectives. By building rewarding careers and a healthy and engaged workforce and culture, the University will continue to be an employer of choice."},
{"employer_url": "https://www.seek.com.au/companies/university-of-queensland-union-753221", "employer_name": "University of Queensland Union", "employer_info": "UQU is the hub of student life at the University of Queensland!\n\nWe represent the interests of UQ students and run independent services, events and outlets to enhance your student experience including Student Help On Campus (SHOC); 10 retail food and beverage outlets; and a fantastic campus culture. As an independent body, UQU represent students on all important university committees to ensure your voice is heard on all university matters.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/university-of-south-australia-432483", "employer_name": "University of South Australia", "employer_info": "As Australia's leading university for interdisciplinary research*, the University of South Australia is inspired by these challenges and committed to developing forward thinking, user-led solutions that have real impacts.  The researchers are globally connected and engaged, working closely with Governments, industries and communities to deliver responsive, clever and enterprising outcomes. With the high quality research, the ground breaking contributions are transforming lives every day. The university's flagship institutes are delivering fundamental advances in knowledge to address the needs of our changing world.                                  \nSource: this is an extract from the company's own website"},
{"employer_url": "https://www.seek.com.au/companies/university-of-queensland-432368", "employer_name": "University of Queensland", "employer_info": "A top 50 university\nUQ ranks in the top 50 as measured by the Performance Ranking of Scientific Papers for World Universities. The University also ranks 51 in the QS World University Rankings, 52 in the US News Best Global Universities Rankings, 60 in the Times Higher Education World University Rankings and 55 in the Academic Ranking of World Universities.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/university-of-canberra-high-school-875489", "employer_name": "University of Canberra High School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/university-of-new-england-433316", "employer_name": "University of New England", "employer_info": "Fast facts\n\nThe University of New England was formed in 1938 as the New England University College, a College of the University of Sydney. The University became fully independent in 1954 and pioneered teaching to external students by correspondence, making UNE Australia's most experienced provider of distance and now online education.\n\nUNE is Australia's oldest regional university offering more than 200 courses at undergraduate, postgraduate coursework and higher degree research levels. UNE has more than 20,000 current students and 1,200 staff.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/university-of-nsw-799150", "employer_name": "University of NSW", "employer_info": "Welcome to UNSW Australia (The University of New South Wales), one of Australia's leading research and teaching universities. At UNSW, we take pride in the broad range and high quality of our teaching programs. Our teaching gains strength and currency from our research activities, strong industry links and our international nature; UNSW has a strong regional and global engagement. \n\nSource: This is an extract form the company's own website"},
{"employer_url": "https://www.seek.com.au/companies/universal-music-437381", "employer_name": "Universal Music", "employer_info": "How we hire…\n\nThings move rapidly at Universal and the people we want are agile, creative and bold. They turn change into opportunity, love big challenges and getting things done. Working for Universal means working hard at what you love and being recognised for it. In joining us you can expect our commitment to opening doors for you, through internal promotion and global opportunities. We are proud to be an equal opportunities employer and committed to the principle of diversity.\n\nHow we develop…\n\nWe are committed to investing in and developing our people. We focus on helping individuals build the right capabilities to achieve career growth, deliver results and maintain our Global market leading position. Universal supports the development of individuals, offering tailored learning solutions, to assist our people in addressing the challenges and greater opportunities, in this dynamic and ever changing environment.\n\nSource: This is an extract from the company's own website"},
{"employer_url": "https://www.seek.com.au/companies/universal-magazines-436525", "employer_name": "Universal Magazines", "employer_info": "Do you understand how to hook a customers’ attention with a one liner?  Do you dream ways of getting in, getting relevant and making a deal?  Do you know what it means to work a list?  In these days of time-poor business managers it’s important to know how to jump the obstacles and get your message across to the people that matter.  Why? Because we can help them win bigger orders and more customers using our highly targeted digital and print media strategies.\nWe offer a way for businesses to save money by targeting potential buyers.  We proudly offer the most cost-effective marketing solutions in town, and want to hire people to help get our strategies known, understood and purchased.  If you enjoy the game of selling, if you are experienced in digital or print media sales, if you like to be working on solid products, if you want to have something to offer, please contact us today.  Our goal is to build our business by hiring experienced, switched-on and interesting people.\n\nSource: This is an extract from the company's own website"},
{"employer_url": "https://www.seek.com.au/companies/universal-fans-814402", "employer_name": "Universal Fans", "employer_info": "Universal Fans is Australia’s fastest growing ventilation specialist retailer, specialising in ceiling fans, cooling fans, exhaust fans and accessories. Our growth has been built on finding the right product and ventilation solution for each and every client assisted by our long-term, specialist trained sales staff who take the time to make sure every client (big or small) get the right product, right price, and best service. This is what sets us apart. We have experience in dealing with retail sales, trade, project and wholesale and are also big players in the online marketplace keeping ahead of the online retail market and its changes.\n\nOur current premises is located in South Oakleigh, where we have a stunning show room, large warehouse and spacious offices. We believe Universal Fans is a place of opportunity, where you can achieve great things and be surrounded by a skilled, friendly team."},
{"employer_url": "https://www.seek.com.au/companies/uws-college-799416", "employer_name": "UWS College", "employer_info": "Research at Western\n\n\nWestern Sydney University is a research institution driven by impact.\n\nWe believe excellent research and practical outcomes are essential parts of our overarching research mission. Our research has real impact upon the social, economic and environmental wellbeing of our regional, national and international communities.\n\nThe University invites outstanding graduate researchers, innovative new generation researchers and established researchers to consider joining or collaborating with us.\n\nProfessor Scott Holmes \nDeputy Vice-Chancellor and Vice-President (Research and Development)\n\nResearch Engagement, Development and Innovation (REDI)\n\nREDI provides an integrated suite of services supporting the University's research effort through the development of contracts and agreements, and the provision of application advice and grant writing support to researchers; research policy implementation and development; maintenance and provision of research data; and the monitoring and promotion of ethical research practice.\n\nContact:\nREDI Research\nGrants and Contracts\nResearch Ethics and Integrity\n\nREDI Business\n\nThe REDI Business team connects business, government and the community with Western Sydney University by establishing external linkages and identifying partnership opportunities for commercial research, professional consultancy, commercialisation opportunities, access to intellectual property and expertise, and to the University's cutting-edge research facilities. Our team of dedicated business support professionals is available to discuss your specific needs and interests.\n\nContact:\nREDI Business\nCentralised Research Facilities\n\n\nAbout Western Sydney University\n\n\nLeadership and Governance\n\nFind out about the governance and strategic directions of the University.\n\nResearch\n\nIf you are interested in what research the University is conducting, visit Research at Western Sydney University. If you are thinking of starting a research degree, visit the Graduate School.\n\nLearning and Teaching\n\nFind out about the University's commitment to learning and teaching.\n\nSchools and Research Institutes\n\nTake a look at what is on offer in the University's Schools and Institutes.\n\nCampuses and structure\n\nA bit lost? Find your way around the campuses and departments of Western Sydney University.\n\nIn the community\n\nWant to get involved with us? Contact Gateway.\n\nContact us\n\nGet in touch with Western Sydney University\nSource: this is an extract from the company’s own website."},
{"employer_url": "https://www.seek.com.au/companies/universal-communications-group-609484", "employer_name": "Universal Communications Group", "employer_info": "Universal Communications Group (UCG) is one of Australia’s and New Zealand’s leading suppliers of a range of broadband design, cabling and construction services, particularly for next generation cable networks.\n\nFor 20 years, we have provided innovative fulfilment solutions to the telecommunications sector, connecting premises to our clients’ networks. Over this time we have counted among our clients some of Australia’s and New Zealand’s largest and most respected blue-chip telecommunications operators.\n\nMore recently we have been heavily involved in the deployment of the National Broadband Network in Australia and the Ultra-Fast Broadband Network in New Zealand. UCG operates on both sides of the Tasman Sea, now boasting a team of designers, project managers, field supervisors and customer liaison personnel in all key regional locations. We are highly regarded, often being the “go-to” organisation to test or trial new concepts on behalf of our clients.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/universal-cranes-436090", "employer_name": "Universal Cranes", "employer_info": "Universal Cranes is one of the largest privately owned crane hire companies in Australia. With a hydraulic crane fleet range of 7T – 450T and crawler crane range of 50T - 600T plus heavy lifting and transport equipment, Universal Cranes can perform any lift, anywhere, anytime. We have branches in Townsville, Mackay, Rockhampton, Sunshine Coast, Brisbane (HQ), Gladstone, Ballina, Melbourne, South Australia and are affiliated with Gold Coast Cranes. Universal Cranes is also in partnership with Lifting Skills, a training school offering courses in dogging, rigging, crane operating, scaffolding and other areas of construction.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/unitywater-434062", "employer_name": "Unitywater", "employer_info": "Unitywater is the business that provides water supply and sewerage services to Moreton Bay and Sunshine Coast residential and business customers.\nWe began operations on 1 July 2010 and were established by the Queensland Government, under the South-East Queensland Water (Distribution and Retail) Act 2009, as part of the Queensland Government water reform program. We distribute and retail water supplied from the South East Queensland Water Grid, which was created to secure and efficiently manage South East Queensland’s water supplies.\n\nTwenty four hours a day, seven days a week, our priority is providing our customers with a high quality, safe and reliable water supply and sewerage service that is economically and environmentally sustainable.\nSource: this is an extract from the company’s own website"},
{"employer_url": "https://www.seek.com.au/companies/university-of-canberra-432931", "employer_name": "University of Canberra", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/unity-housing-company-868113", "employer_name": "Unity Housing Company", "employer_info": "Unity provides safe, secure and sustainable accommodation for people on low incomes. This ranges from people who simply need affordable housing to people who are vulnerable and may be at risk of or experiencing homelessness and people living with a disability.\n\n\nOur vision: Creating opportunities for people through affordable housing.\n\nUnity is a recognised leader in the provision, management and ownership of community housing, boarding houses and affordable housing. It comprises approximately 25% of the not-for-profit community housing sector in South Australia and is one of a select number of State Government nominated 'Preferred Growth Providers'.\nUnity's focus is to help build a sustainable housing system that provides options for a range of people in our community. We work in a way that makes a positive contribution to the communities that we are a part of. Ensuring that people have a safe, affordable place to live, regardless of their income, is at the core of our business. It's why we are here. \nSource: This is an extract from the company's own website"},
{"employer_url": "https://www.seek.com.au/companies/unity-health-874741", "employer_name": "Unity Health", "employer_info": "UnityHealth is an independent health information, education and technology consulting services company, specialising in Integrative Medicine. We aim to empower practitioners and healthcare professionals to combine the best of conventional and complementary medicines through the provision of our leading online education resources, IMgateway and iTherapeutics. Through our active working partnerships with leading organisations, we provide the necessary tools and resources to assist practitioners, pharmacists, allied health professionals and industry providers deliver the best possible health outcomes. Since 1998, UnityHealth has developed a number of innovative medical resources and information tools for practitioners and their patients, in the area of evidence-based complementary medicine.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/unity4-813788", "employer_name": "Unity4", "employer_info": "About Unity4\n\nUnity4 provides advanced contact centre capabilities, from technology to people, at home or in the office, powered by the cloud, driven by innovation.\n\nUnity4 is a large privately held organisation with operating companies in Australia, New Zealand, the United Kingdom and Canada.\n\nFunctionally Unity4 is split in to two divisions, Contact Centre Outsourcing and Contact Centre Technology.\n\nFacts at a Glance\n\nThe business was established 2000, the RapportCMS technology was released to market as a standalone offering in 2006.\nUnity4 is Privately Held by the original shareholders.\nUnity4 is Debt Free and has not taken external venture funding, private equity or market capital\nThe group has an Compound Annual Growth rate of 44.28 precent ( as of June 2011)\nUnity4 employs in excess of 650 people worldwide  (excluding independent agents on the platform)\nOver 11,000 active users on the RapportCMS platform worldwide\nUnity4 maintains its internal quality assurance program (U4RMS) and is OFCOM, ACMA, ATA. ADMA and DMA compliant\nUnity4 is PCI DSS compliant and externally certified\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/unitingcare-regen-753142", "employer_name": "UnitingCare ReGen", "employer_info": "ReGen’s purpose is to promote health and reduce alcohol and other drug related harm.\n\nUnitingCare ReGen is the leading alcohol and other drug (AOD) treatment and education agency of UnitingCare Victoria and Tasmania. ReGen is a not-for-profit agency, which has over 40 years experience delivering a comprehensive range of AOD services to the community.\n\nReGen is an equal opportunity employer.\n\nReGen has zero tolerance to child abuse and this applies to all groups particularly those that are at higher risk who might not feel comfortable reporting. This includes a commitment to cultural safety of culturally and/or linguistically diverse children (including Indigenous children) and children with a disability.\n\nReGen is committed to reducing the harms associated with Tobacco and staff should adhere to site specific guidelines that includes tobacco free at some locations.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/unitingcare-lifeassist-753093", "employer_name": "UnitingCare LifeAssist", "employer_info": "Who we are\n\nUnitingCare lifeAssist has been assisting vulnerable and disadvantaged people, as well as their carers and families, in Victoria since 1987. \n\nWe are a not-for-profit agency which provides government-funded services throughout Melbourne's Eastern and Northern Metropolitan Regions, Disability Solutions in the NDIS Regions and self-funded supports throughout metropolitan Melbourne, the Mornington Peninsula and some regional Victorian locations. We support people who are aged, people with disability and the carers of these people.\n\nWe assist over 4500 people annually through government-funded programs and countless more through either referral or self-funded services.\n\nWe are committed to achieve 'a good life for all'.  We assist you to achieve your goals to live the life you choose. We help you to live happily and productively in the familiar surroundings of your own home and community. We are committed to service excellence and are internationally accredited to the ISO 9001:2008 set of quality management standards.  \n\nWe continue to support people with short-term, long-term and even lifelong vulnerabilities.  We also acknowledge that at some stage in life potentially everyone will feel vulnerable.  Often this is because of some unexpected crisis or change in circumstance which can leave people feeling overwhelmed and not knowing where to turn for help.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/universal-institute-of-technology-802239", "employer_name": "Universal Institute of Technology", "employer_info": "The mission of Universal Institute of Technology is to provide quality vocational education and training through a suite of accredited courses that cater for both the international and domestic markets. Our overall aim is to provide education and training in a caring environment for a skilled and adaptable workforce to meet the ever-changing needs of industry.\nSource: this is an extract from the company’s own website."},
{"employer_url": "https://www.seek.com.au/companies/uniting-victoria-and-tasmania-434610", "employer_name": "Uniting Victoria and Tasmania", "employer_info": "Uniting works alongside people of all ages in local communities across Victoria and Tasmania. Our services reach to Albury-Wodonga in the north, Mallacoota in East Gippsland, the Wimmera region in the west, and across Tasmania.\n\nUniting is the community services arm of the Uniting Church in Victoria and Tasmania. We’ve been supporting Australians for over 100 years. We are 7000 skilled, passionate and creative people providing over 770 programs and services.\n\nWe empower children, young people and families to learn and thrive. We’re there for people experiencing homelessness, drug and alcohol addiction or mental health issues. We support people with disability to live the life they choose. We assist older people to maintain their independence and enjoy life. We provide people with opportunities to access training and meaningful employment. We’re proud to welcome and support asylum seekers to our community. We work to empower people with the information, skills and tools they need to live a healthy, happy life.\n\nAs an organisation, we celebrate our diversity and welcome all people regardless of ethnicity, faith, sexual orientation and gender identity. We acknowledge Aboriginal and Torres Strait Islanders as Australia’s First Peoples and as the traditional owners and custodians of the land on which we work.\nSource: This is an extract from the company's own website"},
{"employer_url": "https://www.seek.com.au/companies/universal-store-434662", "employer_name": "Universal Store", "employer_info": "UniversalStore.com is Australia's go-to location for the latest in youth street and casual fashion. Universal Store has retail locations around Australia supplying the latest in Mens and Womens fashion from leading fashion brands.\n\nAs a leading Australian online clothing store, UniversalStore.com's recent online fashion store relaunch has delivered increased functionality to allow you to find the exact fashion item you are looking for. You can now Shop By One Of Our 160+ Brands, Find your perfect item by filtering the style and size you are after using our Men's Shop-By or Women's Shop-By functionality, gain fashion inspiration from our 'Instashop' page or try our newly improved Fashion Search.\n\nUniversal Store stocks leading brands in Men's and Women's fashion including Minkpink, Lee, Wrangler, Zanerobe, Neuw, Nobody, One Teaspoon, Deus Ex Machina, Assembly, The Academy Brand, All About Eve, Herschel Supply Co., Happy Socks, Jelly Beans, Ladakh, Paint It Red, Res Denim, Rolla's, Stussy, Thrills, Uppercut Deluxe, Vans, Converse and More.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/uniting-communities-435991", "employer_name": "Uniting Communities", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/uniting-agewell-435430", "employer_name": "Uniting AgeWell", "employer_info": "At Uniting AgeWell we believe older people, like people of all ages, want to live in an environment of choice, empowerment and wellness – and to access support and care as they choose.\n\nOur focus is on supporting older people to experience a sense of wellbeing, choice and independence at every age and stage of their lives; to feel valued members of their community and to have easy access to the services they need to live the life they want.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/united-voice-435010", "employer_name": "United Voice", "employer_info": "United Voice is an organisation of over 120,000 Australian workers, united by our belief in the dignity of workers and the right to fair and just treatment at work. We are an active union, and we are passionate about organising to win.\n\nWe are people of diverse races, genders and ages, from every State and Territory. We have diverse backgrounds and a multitude of different skills, but we have the same goal—to be agents of positive social change and to continuously stand up for the type of society we believe in. Many of us work on a casual or part-time basis; 60% of us are women, and half of us are from culturally and linguistically diverse backgrounds. It is from this diversity that we gain great strength. \nSource: this is an extract from the company’s own website."},
{"employer_url": "https://www.seek.com.au/companies/united-transport-equipment-983141", "employer_name": "United Transport Equipment", "employer_info": "United Equipment, trading as United Forklift and Access Solutions, is today one of Australia’s largest privately owned forklift and access equipment companies. Our ambition is to be the best lifting solutions business in Australia by offering the right lifting and access solutions to meet our customers’ needs, by providing the best brands in the business, coupled with the best service and support second to none.\n\nSince our humble beginnings United has established a national footprint across Australia with branches in Perth, Bunbury, Darwin, Altona, Ballarat, Sydney and Brisbane. As the company continues to grow we expect to establish ourselves in other areas to further expand our national footprint and better service our customers.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/united-synergies-814228", "employer_name": "United Synergies", "employer_info": "The origins of United Synergies date back to 1989 when assistance to young homeless people was provided under a project known as the Noosa Accommodation Project (NAP). With community support from dedicated and determined campaigners such as local identity Mike St John (pictured), the Noosa Accommodation Project was incorporated in 1991 and received its first official funding in May 1992 to provide supported accommodation for young people aged 16-21 years.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/united-services-union-861486", "employer_name": "United Services Union", "employer_info": "The United Services Union (USU) has approximately 40,000 members and represents local government, energy, airline and clerical and administrative employees throughout NSW.\n\nThe USU:\nNegotiates your Award\nNegotiates Collective Agreements\nProtects your rates of pay\nProtects your conditions of employment\nProtects you against unfair dismissal\nConciliates and arbitrates disputes\nProtects your health and safety at work\n\nMany thousands of workers have chosen to join the USU, allowing us to provide membership services including industrial guidance, protection and a number of significant benefits to our members.\nYour union works on various campaigns aimed at improving the quality of life for our members and their families. \nThe USU has branches and organisers right across New South Wales so that we can be in the right place when you and your family need help. \nSource: this is an extract from the company’s own website."},
{"employer_url": "https://www.seek.com.au/companies/united-security-799485", "employer_name": "United Security", "employer_info": "For over 10 years, United Enterprises Australia has been providing a broad range of building and commercial property services to facilities of all sizes and uses – from residential and commercial facilities to government institutions and manufacturing plants.\n\nWith our 400 plus employees, partnership approach and technology-driven internal processes, we can tailor a service model that fits your exact needs.  Our whole-of-life approach to managing your property provides you with greater flexibility, improved business performance, a single point of contact, convenience and reduced costs.\n\nOver the years, we have steadily grown to become one of Australia’s preferred sub-contractors in cleaning, facilities services, security, grounds maintenance and engineering and construction works and have increasingly forged trusted relationships with direct clients. Source: this is an extract from the company’s own website."},
{"employer_url": "https://www.seek.com.au/companies/united-physiotherapy-group-983108", "employer_name": "United Physiotherapy Group", "employer_info": "United Physiotherapy Group is a provider of boutique high quality physiotherapy consulting services in Private Practice Clinics, Residential Aged Care & Community Care.\n\n\nFor over a decade, we have continued to deliver high quality individualised benchmark assessments, therapy and rehabilitation to our clients so that they can achieve great lasting results for their health.\nListening to our clients’ needs we have structured our delivery of services into a number of specialised divisions – Private Practice Clinics, Community Based Physiotherapy, Residential Aged Care Physiotherapy Services, Manual Handling Training to name a few.\n\nUnited Physiotherapy Group has grown into a strong network of physiotherapists nationwide throughout Australia who share a passion for assisting their clients to stay mobile and pain free as well as getting the most out of life. Our physiotherapists are dedicated to offering benchmark assessments, maintenance therapy and rehabilitation.\nSource: This is an extract from the company's own website"},
{"employer_url": "https://www.seek.com.au/companies/uni-span-802184", "employer_name": "Uni-Span", "employer_info": "Uni-span are proud and exclusive distributors of Ulma Formwork equipment. Our high quality products are innovative, cost effective and labour efficient. Both Unimesh ™ and BizSync are two of those innovative products and applications designed to improve operations and standard working procedures. We are members of the Scaffolding Association of QLD, Master Builders, Engineers Australia and the Zero Harm at Work \n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/uniradiology-982995", "employer_name": "Uniradiology", "employer_info": "Welcome to Uniradiology\n\nUniradiology is focused on offering little or no waiting time, bulk billing facilities and providing a high level of professional diagnostic services to referring doctors and patients. Together with our investment in the latest technology and our highly professional and regarded staff, Uniradiology is sure to be one of the leaders in diagnostic imaging.\n \nUniradiology provides a diverse range of bulk-billed radiological examinations and procedures to the local community through well-established sites across Australia.  Employing an array of ‘Low-Dose’ and high-end, innovative equipment, Uniradiology is committed to the very best in patient care.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/federation-university-australia-609467?child=433402", "employer_name": "University of Ballarat", "employer_info": "FedUni is regional Victoria's largest education institution, with campuses in Ballarat, Gippsland and the Wimmera providing easy access to study, and approximately 500 staff committed to teaching excellence and student support. Source: this is an extract from the company’s own website."},
{"employer_url": "https://www.seek.com.au/companies/unique-micro-design-982964", "employer_name": "Unique Micro Design", "employer_info": "Since 1983, Unique Micro Design (UMD) has been solving customers' needs for productivity improvement by adding real time visibility and control to software using edgeware, IoT and our engineering IoT solutions skills, which reflects our ability to: \n•Design and manufacture IoT devices and interface electronics \n•Source and integrate ICT products from our agencies \n•Support through our professional, engineering, software and support services. \n\nIn simple terms  we add eyes and ears to software. \n\nInternet of Things (IoT)\n\nThe Internet of Things (IoT) is an ecosystem of: \n• Devices and sensors\n• Application services\n• The Enterprise\nUMD provides products, systems and solutions in IoT. \n\nTo support this, UMD is divided into two sales teams: \n•Customer Service Team (for products); and \n•Business Solutions Team (for systems and solutions) \n\n\nUMD adding \"eyes\" and \"ears\" to software. \nSource: This is an extract from the company's own website"},
{"employer_url": "https://www.seek.com.au/companies/unico-813522", "employer_name": "Unico", "employer_info": "UNICO is a specialist Australian IT services company with unmatched expertise in developing intelligent solutions to the most complex challenges facing business. In a hyper-connected world we differentiate and enable our customers to compete through technology.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/union-club-hotel-799475", "employer_name": "Union Club Hotel", "employer_info": "Tucked away in the back streets of Fitzroy is The Union Club Hotel. Located on the corner of Gore and Webb Streets Fitzroy, the Union is a landmark corner pub and a true local. Come in and enjoy a great meal in the dining room or just a quiet afternoon beer in the sun filled public bar. In winter shoot some pool by the open fire whilst catching the footy on the big screen or under-cover in the heated beer garden. When the weather’s fine soak up the sun on the roof deck or relax with friends under the fig tree in the beer garden.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/undurba-state-school-820227", "employer_name": "Undurba State School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/underground-cable-systems-982750", "employer_name": "Underground Cable Systems", "employer_info": "Underground Cable Systems (UCS) has been designing and constructing electricity networks to the property development, infrastructure and construction industries for over 20 years. We build underground networks for our customers that become long-life assets for regulated electricity network companies.  Since 1995, UCS has constructed over 10,000 km of underground cable networks and built 2,150 substations and associated infrastructure. We also construct overhead pole networks for connection to our underground cable systems. UCS works closely with the electricity network utilities to ensure quality designs and final constructions meet the requirements of a long life, low maintenance electricity network.  Construction projects have been completed throughout Melbourne and Victoria from our Bendigo and Hallam depots.  Projects in Sydney and NSW are managed from our Campbelltown depot. \nSource: This is an extract from the company's own website"},
{"employer_url": "https://www.seek.com.au/companies/umagico-primary-health-care-centre-996000", "employer_name": "Umagico Primary Health Care Centre", "employer_info": "Umagico is one of the five communities which collectively form the Northern Peninsula Area, also known as the NPA. The landmass of the NPA consists of 1030 km2 in the northern most region of Cape York. Injinoo, New Mapoon, Seisia and Bamaga communities make up the remainder of the NPA.\n\nThe population of Umagico is approximately 281 people with 90% of the population identifying as Indigenous.\n\nicon\t\nThe Umagico Primary Health Care Centre is managed by a small primary health care team consisting of Indigenous health workers. The clinic is open Monday to Friday and encourages walk-ins and also provides appointments.\n\nicon\t\nThis health centre refers all acute presentations to Bamaga Hospital and manages clients at a primary preventative level including chronic disease care.  Staff also conduct annual adult health checks and provide a limited range of primary health and emergency care. Other programs are delivered from the clinic on a scheduled basis including men’s and woman’s health, maternal and child health and quality lifestyle programs.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/ulverstone-high-school-874024", "employer_name": "Ulverstone High School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/unilever-432698", "employer_name": "Unilever", "employer_info": "With more than 400 brands focused on health and wellbeing, no company touches so many people's lives in so many different ways.\n\nOur portfolio ranges from nutritionally balanced foods to indulgent ice creams, affordable soaps, luxurious shampoos and everyday household care products. We produce world-leading brands including Lipton, Magnum and OMO alongside trusted local names such as Rexona, Continental and Streets Ice Cream. Source: this is an extract from the company's own website"},
{"employer_url": "https://www.seek.com.au/companies/ulverstone-primary-school-874025", "employer_name": "Ulverstone Primary School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/ultraceuticals-813684", "employer_name": "Ultraceuticals", "employer_info": "Dr Heber and his highly skilled team of Australian and international formulators are dedicated to creating potent, effective products under the Ultraceuticals label. Ultraceuticals are at the forefront of innovation and use only the latest available ingredients and technologies to consistently release new products and improve existing ones.\n\nWith a combination of sophisticated, patented delivery systems and potent, proven anti-ageing stars like Vitamin A, Vitamin C and Alpha Hydroxy Acids (AHAs), each product is formulated with maximum safety and effectiveness, so you get results which you can actually see.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/ultradata-816897", "employer_name": "Ultradata", "employer_info": "Ultradata delivers world class technology solutions to the Asia Pacific financial services market.\nEstablished in 1977, Ultradata has a long and reputable history in supplying state of the art software solutions for core banking, trustee and funds management, and consumer finance products such as lending, debit and credit card, ATM and fraud detection systems. Ultradata also supplies internet, mobile and app banking software solutions which are installed in more institutions throughout the Asia Pacific region than any other vendor.\nTotally scalable, Ultradata applications are built with a single underlying database, a service-oriented architecture and tailored for each individual organisation.\nIn 2014 Ultradata further expanded its capacity in the digital banking field, by acquiring one of the largest suppliers of secure digital and marketing agency services to the Australian banking sector.\nOur vision is to be the premier provider of innovative software technology solutions and professional services unrivalled in the finance industry.\n\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/ultra-tune-434917", "employer_name": "Ultra Tune", "employer_info": "Welcome to Ultra Tune Auto Service Centres - a 100% Australian owned company with over 270 Service Centres Nationally. Ultra Tune provides both private and fleet motorists with a full range of car services, each designed to be performed in a structured series of operating procedures ensuring faster, more efficient and performance enhancing servicing.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/ultra-refrigeration-982664", "employer_name": "Ultra Refrigeration", "employer_info": "Welcome to Ultra Refrigeration\nUltra Refrigeration Pty Ltd is an Australian owned and operated company offering refrigeration and air conditioning installation and service to the commercial sector.\n \nUltra Refrigeration was established in 2001 emanating from a perception that there was a need within the industry for a company that went back to basics, one that possessed those attributes intrinsically sought by customers i.e., a company that is reliable, offering the highest standard of workmanship with a strong focus on customer service and satisfaction.\n \nThe core philosophy of Ultra Refrigeration; \"working together, we'll make it happen\".\n \nAs attitudes and business methods of other Refrigeration and Air Conditioning companies force them to focus inward as they expand their repertoire in order to be more competitive, Ultra Refrigeration endeavour to provide a superior standard of workmanship in all facets of the business, from design and sales, to installation, service and maintenance with a particular emphasis on premium customer service.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/ultimate-positioning-813866", "employer_name": "Ultimate Positioning", "employer_info": "UPG has been helping organisations in the South Pacific gather, analyse and use geospatial data for more than 125 years.  From urban and outback Australia to the shores of Papua New Guinea, we work with the world’s leading technology suppliers to deliver solutions that specifically meet our customer’s needs across industries including land surveying, construction, utilities and local government, mining, waste management and field services management.\n\nWe are part of a group of Trimble distributors with 11 offices across the region and that employs more than 150 solution and industry specialists. We’ve been a Trimble distribution partner in Australia since 1992.\n\nOur philosophy at UPG is to build and strengthen a long-term business relationship with you – in fact, our most long standing client has been with us for over a century. This relationship we’ll build with you, based on the values of excellence, teamwork and integrity means we’re not only here to provide the best solution, we’ll be there through installation, support, service and repair.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/umi-sushi-802167", "employer_name": "Umi sushi", "employer_info": "UMI SUSHI GROUP.....\n\n \n\nUmi Kaiten-Zushi (Haymarket) was first established in 2006, the owners of Umi were passionate about Japanese cuisine and in particular the art of sushi & sashimi making. Together with the top sushi masters, we spent years in perfecting our menu, trying our best to preserve delicate flavours of traditional sushi, whilst bringing innovation to the world of sushi. \n\n \n\nOur sister restaurant Umi Sushi + Udon (Darling Quarter) was created in 2011, with an objective to continue our tradition in providing huge selection of delicious sushi, as well as exploration into making inhouse sanuki udon with fresh & healthy ingredients. To cater for our growing Umi following, we expanded the range of traditional and modern Japanese a la carte dishes on offer. \n\n \n\nThe latest addition to the group includes Umi Sushi Express (City - Event Cinemas), which features mouthwatering savoury and sweet gyozas in exciting new flavours, as well as creative sushi that is sure to please hungry taste buds on the go.   \n\n \n\nOnce again welcome to “ The House of Sushi” and begin to enjoy our love affair. \nSource: this is an extract from the company’s own website."},
{"employer_url": "https://www.seek.com.au/companies/ulton-813885", "employer_name": "Ulton", "employer_info": "Why Clients Choose Ulton?\n\nUlton's Capability Statement\n\nUlton's service offerings have grown in response to ongoing demand from it's clients wanting a finance partner who can provide practical, sound, profit driven advice to help them and their businesses succeed. Our specialist advice, aims to improve financial outcomes in the areas of compliance, planning, management and performance. Our advisory experts have extensive knowledge and experience across many industries, so with Ulton as your financial and business partner, you will receive specific advice relevant to your needs.\n\nYour success… your life!\n\nSource: This is an extract from the company’s own website."},
{"employer_url": "https://www.seek.com.au/companies/unibooks-437270", "employer_name": "Unibooks", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/ultimate-off-road-campers-982599", "employer_name": "Ultimate Off Road Campers", "employer_info": "An off-road camper trailer from Ultimate Campers represents the very best in innovative Australian engineering.  Sleek contemporary styling, comfort, light weight, aerodynamic contours and fuel efficiency all combine to bring you a superior off-road performance - whether you you are heading to Cape York, across the Simpson Desert or along the Canning Stock Route.\n\nMade in Australia, by Australians for Australian off-road adventures.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/ultimate-merchandising-solutions-982594", "employer_name": "Ultimate Merchandising Solutions", "employer_info": "Ultimate Merchandising Solutions is a retail Services Company designed to provide clients with the best in field representation and customised field reporting.\n\nUltimate Merchandising Solutions offers a dedicated approach, which sees your products being represented by one dedicated team. This gives you greater control of your results and more \"return on your investment\".\n\nUltimate Merchandising Solutions operates throughout all of Australia supplying a full range of retail services, including:\n\nDedicated Services\nNew Line Speed to Market\nIn Store Merchandising tailored to customers' needs\nStock Rotation\nPlan-o-Gram implementation\nProduct Recalls\nNew store merchandising\nRefits\nNew Store Set Up\nDisplay building\nMystery Shopping\nHostess activity\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/ullrich-aluminium-434863", "employer_name": "Ullrich Aluminium", "employer_info": "At Ullrich Aluminium we believe in good old fashioned service. Many of our employees, including key personnel, have been in the company in excess of 10, 15 and 20 years. You won't find that level of experience elsewhere. That quality of accumulated knowledge guarantees good service and product knowledge. Our sizable client base can attest to that.\n\nThe company motto Quality, Service, Integrity means exactly that. Quality control with continuing improvements, unrivaled service with a money back guarantee and integrity in the market place.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/unilodge-436487", "employer_name": "UniLodge", "employer_info": "UniLodge is a leading provider of purpose built student accommodation with more than 56 properties across Australia and New Zealand. We own, operate and manage student accommodation.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/ugl-kentz-joint-venture-753049", "employer_name": "UGL Kentz Joint Venture", "employer_info": "Project Scope\nThe UGL Kentz Joint Venture provides the structural, mechanical and piping construction package for the Ichthys Project Onshore LNG Facilities in Darwin. This contract will provide more than 900 jobs for construction personnel. The contract scope includes the provision of services for site-wide installation of process trains, and additional pre-commissioning and commissioning expertise\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/ugm-435871", "employer_name": "UGM", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/worldmark-436795?child=1000099", "employer_name": "Ultimate Business Systems", "employer_info": "The WorldMark Group with over forty-five years experience in the automotive sector rank #1 as aftermarket service provider in Australia. MotorOne, our core business, markets products and services B2B to over 1200 motor vehicle dealerships. WorldMark’s strong retail presence is led by a number of retail businesses including the Tint a Car group with over 100 stores, state-of-the-art automotive training, customer touch-point programs, car enhancement products and a multitude of products and services that cover the full spectrum of automotive aftermarket. Source: this is an extract from the company’s own website."},
{"employer_url": "https://www.seek.com.au/companies/ugl-432388", "employer_name": "UGL", "employer_info": "UGL is a diversified services company delivering critical assets and essential services that sustain and enhance the environment in which we live. \n\nUGL is a leading provider of end-to-end outsourced engineering, asset management and maintenance services with a diversified end-market exposure across core sectors of rail, transport & technology systems, power, resources, water and defence.\n\nUGL partners are some of the world's largest blue-chip companies, government agencies, private enterprise and public institutions.\n\nOur capabilities extend across a broad range of services and whole-of-life solutions for diverse industries and in doing so provide access to world leading, sustainable and innovative technologies.\n\nSource: this is an extract from the company's own website"},
{"employer_url": "https://www.seek.com.au/companies/uhy-haines-norton-436668", "employer_name": "UHY Haines Norton", "employer_info": "UHY Haines Norton is an association of independent firms in Australia and New Zealand with a global reach via UHY International. Currently we have 9 offices across Australia and New Zealand, including all the major business centres. UHY Haines Norton celebrated its 25th anniversary in 2009. Our teams draw on the resources, knowledge and best practise of the Australian, New Zealand and global network. We are large enough to have the knowledge, systems and expertise to handle a wide range of client services, whilst at the same time being small enough to deliver a ‘partner’ lead personal service.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/ultimate-motorbikes-982595", "employer_name": "Ultimate Motorbikes", "employer_info": "Ultimate Motorbikes\n\n… where your ride begins!\n\nUltimate Motorbikes has three new exciting dealerships for your convenience, located in Springwood, Gold Coast and Ipswich. Ultimate Motorbikes specialises in new Kawasaki, Suzuki, KTM and Yamaha Motorcycles, plus we offer an extensive range of used Motorbikes from a variety of brands.\n\nWhether you’re buying your first LAMS motorbike or it’s time to upgrade to the latest model, we have many of the top motorbike brands, not to mention easy, hassle free finance available in-house.\n\nIf you are looking for your next pride and joy or simply looking to invest in motorcycle accessories, why not let one of our friendly staff help you in of what should be a fun and exciting experience\nSource: This is an extract from the company's own website"},
{"employer_url": "https://www.seek.com.au/companies/ulan-coal-799466", "employer_name": "Ulan Coal", "employer_info": "Welcome to Ulan Coal\n\nWelcome to Ulan Coal Mines Limited (UCML) one of the most established coal mining operations in the western coalfields of NSW. The mining operations at UCML are one of a number of mining assets owned and/or managed by Glencore. We consist of two approved underground mining operations (Ulan No.3 and Ulan West) and an Open Cut (not operating since end 2014). The 21 year conceptual mine plan involves open cut and longwall mining in the Ulan Seam. All associated underground, open cut mining and land management activities within UCML land holdings, as a collective, is referred to as the Ulan Mine Complex.\n\nThe proposed extension of the open cut, continued Ulan No. 3 underground and Ulan West underground are shown in the figure \"Ulan Coal Continued Operations Project Area\". A combined production rate of up to 20 million tonnes per annum (Mtpa) product coal is proposed for the 21 year mine plan, operations approved to 30 August 2031. The Project will employ approximately 931 people including ancillary contractors when at full production.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/ufs-dispensaries-814149", "employer_name": "UFS Dispensaries", "employer_info": "UFS is an abbreviation for United Friendly Societies.\n\nUFS Dispensaries is a not-for-profit, community based organisation running nineteen pharmacies (including five Melbourne based pharmacies), two pharmacy depots, four Medical Centres, a gift shop, a well-being centre and a pilates and yoga studio throughout Western Victoria, Australia.\n\nWho We Are?\nUFS is run by an elected Board of Directors and is owned by its members. While the business must be economically sound, profit is not the major objective. UFS exists to provide benefits to its members.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/ugar-primary-health-care-centre-995998", "employer_name": "Ugar Primary Health Care Centre", "employer_info": "icon\t\nUgar (Stephen Island) is situated in the Eastern Cluster of the Torres Strait Islands. The other islands in the cluster are Erub and Mer. It is home to the region’s smallest community of about 50 people and 98% of the population identify as Indigenous. The island can only be accessed by helicopter or dinghy.\n\nicon\t\nStephen Island Primary Health Care Centre is managed by staff from nearby Mer (Murray Island) through a one day a week fly-in/fly-out clinic.\n\nicon\t\nThis health centre offers a limited a range of primary health and emergency care services, including chronic disease, maternal and child care, lifestyle and emotional well-being, environmental health and mental health.\n\nicon\t\nFinancial assistance is available through the Patient Travel Subsidy Scheme to eligible patients who need to travel to other hospitals for procedures and tests not available locally.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/ubet-868266", "employer_name": "UBET", "employer_info": "TOP OF OUR GAME\n\nUBET champions making punting as thrilling as possible by delivering great odds, service, convenience and technology.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/ubercare-982497", "employer_name": "Ubercare", "employer_info": "Ubercare is the brainchild of South Australian businessman Simon Chappel. Ubercare has been developed in Adelaide and addresses two major trends within the Australian aged care industry – the increasing longevity of seniors, and rising consumer demand for in-home aged help. Launching in South Australia in March 2017, Ubercare has lofty goals to expand Australia wide and across the globe.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/unified-healthcare-group-436486", "employer_name": "Unified Healthcare Group", "employer_info": "Our team make a difference every day. We’re always looking to identify and develop new and innovative ideas that will make a difference for both our clients and the wider community. We encourage our team to collaborate, to share their ideas and to participate in creating solutions. We value leadership and commitment and we celebrate the success of our people.\n\nWe believe in connecting great people with great opportunities. Whether you are in Digital, Healthcare, Sales or Service, you’ll make a difference at UHG."},
{"employer_url": "https://www.seek.com.au/companies/ubobo-state-school-820575", "employer_name": "Ubobo State School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/ubs-432955", "employer_name": "UBS", "employer_info": "\n\n"},
{"employer_url": "https://www.seek.com.au/companies/ue-and-multinet-813673", "employer_name": "UE & Multinet", "employer_info": "All day, every day we’re working for our customers, bringing energy into your homes and businesses to keep your world running the way you want it to.\n\nAs The Intelligent Utility we’re giving our customers access to the best technology and the most advanced network, with a priority on efficiency and on building our reputation by meeting your current and future requirements.\n\nOur customers and stakeholders have high expectations about the level of service we provide, the focus we have on distributing safe and reliable energy, the value we deliver for them and how we respond to their needs, individually and as a community. These expectations are reflected in our values – safety, accountability, collaboration, communication, empowerment and respect – which guide us in everything we do.\n\nSource: This is an extract from the company's own website."}
]