[
{"employer_url": "https://www.seek.com.au/companies/landh-group-435938", "employer_name": "L&H Group", "employer_info": "\n"},
{"employer_url": "https://www.seek.com.au/companies/landcorp-wa-797021", "employer_name": "LandCorp WA", "employer_info": "LandCorp is a Government trading entity, established under the Western Australian Land Authority Act 1992 and responsible to the Minister for Lands, who also has responsibility for the Department of Planning and the Department of Transport."},
{"employer_url": "https://www.seek.com.au/companies/lander-and-rogers-lawyers-437806", "employer_name": "Lander & Rogers Lawyers", "employer_info": "Lander & Rogers is a leading independent Australian law firm operating nationally from Brisbane, Melbourne and Sydney.  We have seven main areas of practice and are a principal advisor to many publicly listed and private Australian companies, Australian subsidiaries of global companies, as well as all levels of government.\n\nWe provide practical legal advice, along with exceptional client service, and we are renowned in Australia for our down-to-earth and friendly culture.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/lancelin-primary-school-871449", "employer_name": "Lancelin Primary School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/land-surveys-814889", "employer_name": "Land Surveys", "employer_info": "Experience. Innovation. Flexibility. Value.\nEstablished in 1997 Land Surveys continues to grow and expand across Australia and overseas due to the demand for more comprehensive survey services in today’s dynamic market.\n\nWith over 200 professional and committed staff, Land Surveys provides full surveying services specialising in aerial surveys, engineering surveys, hydrographic surveys, land development, laser scanning, mining services, spatial data management & analysis, as well as a range of specialist services including utility mapping, concrete scanning, dilapidation surveys and monitoring. Land Surveys has offices around Australia and Internationally; Karratha, Port Hedland, Darwin, Brisbane, Sydney, Melbourne, Port Moresby and its head office based in Perth.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/land-development-agency-act-796104", "employer_name": "Land Development Agency ACT", "employer_info": "The Land Development Agency (LDA) is an ACT Government agency within the Chief Minister, Treasury and Economic Development Directorate portfolio. Its core business is developing and selling land on behalf of the ACT Government. The LDA is dedicated to achieving new standards of innovation, excellence and value in urban design and sustainable development. Its commitment has been recognised with multiple industry awards.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/lancemore-group-831088", "employer_name": "Lancemore Group", "employer_info": "It is better to travel well than to arrive  – Buddha\n\nOur collection of award winning boutique hotels are as individual as you are. We understand the reason you travel is for unique, tailor-made experiences which are in tune with your needs, so when you stay with us it's hard not to feel special.\n\nFrom our genuine service to our informal professionalism; our timeless designs and spectacular locations to our mouth-watering food and wine, we strive to get the little things right and to appreciate that time is the ultimate luxury.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/land-development-corporation-868192", "employer_name": "Land Development Corporation", "employer_info": "We assist enterprises by providing easy access to well-located industrial, commercial and residential land in Australia's Northern Territory. We play a crucial role in planning for economic growth and development and aim to deliver strategic land and investment opportunities to the Northern Territory market in a commercial manner.\n\nThe Corporation is committed to delivering developments that may not provide a sufficient enough return for the private sector to undertake on their own, and developments which are required by Government to increase the supply of land where short supply threatens the economic well-being of the Northern Territory.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/lancelin-health-centre-871448", "employer_name": "Lancelin Health Centre", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/land-titles-office-nt-867909", "employer_name": "Land Titles Office NT", "employer_info": "Land Titles Offices in the Northern Territory (NT) contain the public register of land.  Source: this is an extract from the company’s own website."},
{"employer_url": "https://www.seek.com.au/companies/lan-airlines-800417", "employer_name": "LAN Airlines", "employer_info": "Our fleet is composed of modern Boeing and Airbus aircraft, acquired to provide the best onboard experience. These aircraft feature state-of-the-art design and technology, providing you with greater comfort, security, and efficiency during your journey.  \nSource: this is an extract from the company’s own website."},
{"employer_url": "https://www.seek.com.au/companies/lambert-kitchens-929647", "employer_name": "Lambert Kitchens", "employer_info": "Lambert Kitchens is a family business, established in 1978. We have designed, manufactured and installed thousands of kitchens for people living in the Illawarra area over the past 38 years.\n\nLambert Kitchens has deliberately chosen to be the best at what we do, rather than the biggest. It is important to us that our customers are happy with their new kitchen and know they have received excellent service and value for money.\n\nAt Lambert Kitchens the goal is simple; to supply quality products, excellent pricing and outstanding service.\n\nWe appreciate it is a big decision for you to trust us with your money and your home; accordingly we offer many testimonials from happy and satisfied customers confirming our professional, efficient and courteous service. The key to our ongoing success is the number of referrals we receive from happy customers; people who are absolutely thrilled with their new kitchen.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/lambton-park-hotel-803737", "employer_name": "Lambton Park Hotel", "employer_info": "The LPH is a community focused hotel. Our aim is to provide the neighbourhood of Lambton with a friendly, welcoming & relaxed hotel atmosphere\nthat all can enjoy.\n\nThe Hoteliers Dan, Simon & Joel (also known as the three beards) having left the big smoke of Sydney and now ply their trade on the sunny shores of Newcastle, striving to turn the LPH into a destination of Newcastle. The trio bringing with them years of experience in various iconic establishments and have now embarked on an exciting project to bring the building back to its former glory & restore the vast historical character that lies beneath.\n\nOne of the great assets of the LPH is the location with the beautiful gardens of Lambton Park a perfect outlook to enjoy an afternoon drink on the terrace, or a quality meal from the Park Kitchen prepared by head chef Thomas Loeffler.\nThe LPH offers something for everyone whether it be family dining, lunch with friends or fun filled drinks post-work.\n\nSource: this is an extract from the company’s own website."},
{"employer_url": "https://www.seek.com.au/companies/lalor-secondary-college-800416", "employer_name": "Lalor Secondary College", "employer_info": "At Lalor Secondary College, all members of the school community continue to strive for excellence within a safe and supportive environment where diversity is valued. We understand the important role we play in our students’ lives and recognise that it is our responsibility to build our student capacity so that they are equipped to become socially responsible members of our community and a world that is becoming increasingly smaller. We hold strongly to our college values of pride, achievement, caring, cooperation and honesty, embedding them in our policies, practices and curriculum..\n\nOur school has undergone significant change over the last few years – both in terms of facilities and curriculum delivery. In 2014 we underwent our school review and have set our course for the next four years, with emphasis on student relationships and supporting programs. \n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/lakeside-cafe-800414", "employer_name": "Lakeside Cafe", "employer_info": "Lakeside Café in Oakden’s glorious natural surroundings and contemporary interior design, makes it the perfect place to relax with family and friends. \n\nWe’re open from 9am to 9pm, 7 days a week and provide home delivery to over 65 surrounding suburbs. Our extensive menu covers breakfast, lunch and dinner, so whether it’s a quick snack, lunch with family and friends or something to takeaway you’re sure to find the perfect meal. Our unique atmosphere and hospitality will have you coming back for more, but don't take our word for it, make an order and come see for yourself.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/lyons-early-childhood-school-871666", "employer_name": "Lyons Early Childhood School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/lambert-and-rehbein-814924", "employer_name": "Lambert & Rehbein", "employer_info": "We bring to your world a unique personalised service, innovative and creative thinking delivered by a group of professionals who share our passion for exceptional\nand sustainable outcomes.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/lyreco-434287", "employer_name": "Lyreco", "employer_info": "In 1926 Georges-Gaston Gaspard creates a bookstore in Valenciennes (North of France).\nProgressively the small bookstore grows and from retail company expands to a printing service company producing its own paper products range.\n\nIn 1936, Georges-Gaston Gaspard launches the building of a large warehouse in Valenciennes area, which becomes the main operating centre of the company. Georges-Gaston notices that delivering the products directly to the customers is more convenient for both customers and the company. A few years after its creation, the activity of the warehouse grows bigger than the retail store business.\n\n2nd World War affects nastily the Gaspard facilities, which are destroyed by an air raid. Georges-Gaston Gaspard decides to review the strategy of the company and decides, with his son Etienne, to close the retail store and focus on B to B service.\n\nIn 1956, Etienne Gaspard takes over the leading of the company. The first catalogue is launched in 1959.\n\nIn 1969, the current President of the company, Mr Georges Gaspard, son of Etienne, joins the company as a Sales Representative. After occupying several functions in the business, he is promoted Managing Director in 1979. Lyreco is created the same year.\n\nFrom the 80's to year 2005, Lyreco expands to Europe and Asia Pacific. \n\nToday, with a turnover of 2 billions € in 2014, the company ranks amongst the first worldwide distributors of Workplace supplies solutions and is active in 45 countries on 5 continents."},
{"employer_url": "https://www.seek.com.au/companies/lyondellbasell-australia-437529", "employer_name": "LyondellBasell Australia", "employer_info": "About Us\n\n \nLyondellBasell (NYSE: LYB) is one of the world's largest plastics, chemical and refining companies and a member of the S&P 500. LyondellBasell manufactures products at 55 sites in 17 countries. LyondellBasell products and technologies are used to make items that improve the quality of life for people around the world including packaging, electronics, automotive parts, home furnishings, construction materials and biofuels.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/lynx-it-753133", "employer_name": "Lynx IT", "employer_info": "Lynx IT specialises in the delivery of specialist IT software services. Since our inception in 2004, we have been a market leader in the delivery of numerous software projects, IT consulting services and support. Lynx IT have successfully developed and supported IT initiatives from small innovative start-up solutions up to multi-million dollar enterprise-scale systems.\n\nLynx IT offer the complete spectrum of IT delivery services, including Project Architecture, Design, Business Analysis, Code Development, Systems Integration, Testing, Business Intelligence and CRM. We have extensive experience developing and delivering solutions across traditional Desktop, Client-Server, Cloud, Digital and Mobile platforms. We have IT specialist consultants across a broad range of languages and platforms, and can build a team to meet every customer’s needs.\n\nOur business focus is the Melbourne commercial IT sector, in particular the Banking and Finance, Health, Manufacturing, Logistics and Wagering industries.\n\nWe are software professionals, with highly skilled people and mature processes that drive the delivery of our client’s software. Lynx IT are part of the Dialog Group of companies. Dialog is Australia’s leading privately owned IT organisation with over 1,200 consultants and offices in every major Australian city.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/lynwood-senior-high-school-871665", "employer_name": "Lynwood Senior High School", "employer_info": "Lynwood Senior High School was first established in 1974, not on its current site but in eight demountable classrooms in the grounds of Cannington Senior High School. The first Lynwood High Principal at this site was Mr. Bill Goulding with two Deputy Principals, Mrs. Meredith Crossing, and Mr. Peter Clark.\n\nMany of the students at this time came as migrants from the United Kingdom with their families. Today the school is a multicultural blend with student from various Asian countries, the Middle East and most recently African migrants.\n\nIn January 1975 the school opened its doors to Years 8 and 9 at the Metcalfe Road location where it is today. The school motto ‘Sincerity’ has been part of the school from these early times and the school crest which incorporates the image of a ‘Swan’ was the inspiration of Mr. Goulding the first Principal.\n\nThe original school uniform colour was mauve, fashionable in the 1970s, but in the 1980s the colours changed to the blue and yellow that the students wear today.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/lyneham-primary-school-871662", "employer_name": "Lyneham Primary School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/lynden-aged-care-800629", "employer_name": "Lynden Aged Care", "employer_info": "Gaffney House Hostel was opened in 1981 following a major community fundraising effort driven by Gerry Gaffney who was the Mayor of the City of Camberwell at that time. Since then a 30 bed high care wing and a 20 bed extra service wing have been added to the site.\n\nLynden has wonderful gardens with many comfortable indoor and outdoor areas for entertaining or simply relaxing.\n\nOur lifestyle program keeps residents active and entertained ensuring that their physical, mental and spiritual needs are met. Residents are encouraged to remain as independent as possible knowing that assistance is available as it is required. Music therapy, physiotherapy, podiatry, hairdressing and other services are also available.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/lyneham-preschool-871661", "employer_name": "Lyneham Preschool", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/lynch-meyer-lawyers-804634", "employer_name": "Lynch Meyer Lawyers", "employer_info": "Lynch Meyer Lawyers strongly support a number of organisations within the industry sectors in which we work.  We are actively involved through sponsorships, memberships, seminars and presentations, writing articles and contributing our time to various boards and committees.\n\nWe are proud to support a number of charitable organisations through the provision of pro bono legal services as well as sponsorship, fundraisers and donations.gold_alliance\n\nOur firm is a Law Society of South Australia Gold Alliance Firm.\n\nLynch Meyer Lawyers are also pleased to be associated with the Law Council of Australia’s Diversity & Equality Charter.  Our firm encourages and supports diversity in the workplace and we are particularly proud to have an equal gender split partnership.Diversity_Equality_logo\n\nFurthermore, our firm is committed to environmental sustainability and we have implemented a number of policies and procedures to support this.\nSource: this is an extract from the company’s own website."},
{"employer_url": "https://www.seek.com.au/companies/lyneham-primary-871663", "employer_name": "Lyneham Primary", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/lynbrook-hotel-437652", "employer_name": "Lynbrook Hotel", "employer_info": "Setting new standards of excellence in functionality and service; Lynbrook Hotel takes the traditional urban hotel experience to a sparkling new level.\n\nEnjoy the welcoming, cosmopolitan atmosphere from the moment you enter the foyer of one of Australia newest and grand hotels.\n\nComprising off International Buffet, Sportsbar with full TAB facilities, conference rooms and 4 star motel with spa rooms available.\n\nLet the Lynbrook Hotel satisfy all your entertainment and hospitality needs.\nSource: this is an extract from the company’s own website"},
{"employer_url": "https://www.seek.com.au/companies/lynch-group-434815", "employer_name": "Lynch Group", "employer_info": "The Lynch Group is recognized as world leaders in floral innovation, research and development.\nOur pool of internationally respected industry experts ensure that our design standards are parallel with overseas trends and that we continue to be seen as leaders in floral quality control and post-harvest techniques.\nWe are specialists in exporting Australian Wildflowers throughout the world.\nThe Lynch Group is the only national floral marketers in Australia with ISO & HACCP Quality Standard accreditation.\nOur team of technicians ensure that the Lynch Group is always at the leading edge in respect to the adoption of the latest postharvest techniques, to provide maximum value for our customers."},
{"employer_url": "https://www.seek.com.au/companies/lyneham-high-871660", "employer_name": "Lyneham High", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/ly-lawyers-804632", "employer_name": "LY Lawyers", "employer_info": "We are experts in Criminal and Traffic Law\n\nThis is all we do!\n\nWe are amongst the top Criminal Lawyers in Sydney attending courts across NSW and interstate.\n\nWe currently have offices in Pitt Street, Sydney (near the Downing Centre Court Complex), Parramatta (The Octagon Building) and Liverpool (Bigge Street).\n\nWe have won cases for our clients in NSW, Victoria, Perth, The Northern Territory and Queensland. We continue to travel regularly to other states in Australia, giving us a wide range of experience in representing our clients in different jurisdictions.\n\nSource: This is an extract from the company’s own website."},
{"employer_url": "https://www.seek.com.au/companies/lycopodium-434566", "employer_name": "Lycopodium", "employer_info": "\n\n"},
{"employer_url": "https://www.seek.com.au/companies/lynair-logistics-804633", "employer_name": "Lynair Logistics", "employer_info": "Lynair is a wholly Australian owned company specialising in air freight, ocean freight, customs clearance, country to country services and logistics throughout the world. Established in 1988, Lynair is acclaimed for providing outstanding performance and exceptional customer service. Our professionalism is evident in all aspects of international transportation and logistics and our expertise extends to designing and managing tailor-made distribution programs that meet all customer requirements, whether it is imports, exports, warehousing, distribution, ocean or air. Our value-added services ensure we adapt promptly to your future needs as they occur.\n\nWe realise that reliability and cost effectiveness of the distribution of goods is a key component to your company’s success and we are committed to meeting those needs. With safe and reliable control, at the best possible price, we will ensure that enhancing your position in the international marketplace is attainable.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/luxottica-433746", "employer_name": "Luxottica", "employer_info": "We're an Italian company, with our global head office based in Milan.\nWith over 7,000 retail stores and 70,000 employees spread across more than 130 countries, Luxottica is a clear market leader in the eyewear and eyecare market.\nWe manufacture, market and distribute a collection of luxury frames and sunglasses.  Our house brands (the ones we own) include Ray-Ban, Oakley, Persol, Vogue, Arnette  and our licensed product brands include Tiffany & Co., Prada, Dolce & Gabbana, Coach and Chanel.\nAcross Australia & New Zealand, we have over 800 retail stores and 5,000 employees across our 2 leading Optical brands – OPSM and Laubman & Pank plus our global Icon – Sunglass Hut\nSource: this is an extract from the company's own website"},
{"employer_url": "https://www.seek.com.au/companies/lynbrook-dental-care-932942", "employer_name": "Lynbrook Dental Care", "employer_info": "Welcome To Lynbrook Dental Care\nLynbrook Dental Care is focused on providing the highest quality family dental care, whilst continually placing patient care and well-being as our number one priority. We believe in a gentle and compassionate approach, providing care with empathy and understanding. It is our philosophy that we are partners in our patients’ health and well being, and therefore take a holistic approach to treat the person and not just the mouth.\n\nWe use the latest technology and modern techniques that you would expect at a cutting edge dental practice. This includes digital x-rays,intraoral cameras that allow you to see what the dentist can see, modern white cosmetic fillings and an integrated digital system.\n\nOur services include all family dental serivces including preventative dentistry, fillings and restorations, dental implants, oral surgery and extractions, wisdom teeth removal, crowns, bridges, veneers, tooth whitening, root canal treatment, gum disease therapy and children’s dentistry.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/lvmh-perfumes-and-cosmetics-813691", "employer_name": "LVMH Perfumes & Cosmetics", "employer_info": "PERFUMES & COSMETICS\n\nA major player in the perfumes, make-up and skincare markets, the Perfumes & Cosmetics division groups together major historic Houses as well as young brands with strong potential.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/luxe-bakery-sydney-932858", "employer_name": "Luxe Bakery Sydney", "employer_info": "Our experienced, artisan bakers specialize in sourdoughs using organic flour and traditional yeasted breads. We’ve also got hatted pastry chefs making croissants, tarts and pastries with only the freshest of ingredients.\n\nSince we have cafes and a bar, we create products that work in these environments. We understand what your venue needs, because we need it too. We’re small enough to tailor production to meet your needs and give you a point of difference, but we’re also large enough to produce consistent quality goods at competitive prices.\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/luxico-holiday-homes-932879", "employer_name": "Luxico Holiday Homes", "employer_info": "Combining the personalized service of a five star concierge with the space, privacy and amenities of a luxury family home, LUXICO delivers sophisticated solutions for the needs of modern travellers. \n Luxico's exclusively managed private homes, penthouse apartments and country estates are all personally selected for their space, privacy and stylish presentation. \n With the amenities and services of a five-star hotel but the space and privacy of a real home, Luxico is pioneering a new standard of luxury service. \n Guest are greeted on arrival (in English, French, Spanish, Chinese or Italian) by one of our friendly Superhosts. These are the people who leave quietly when they're not needed, but are always at the other end of the phone if a guest wants transport, tours, shopping or even something more extravagant such as in-house dining with a top chef. \n Whether it's a quirky terrace house in the heart of the city, a modern waterfront villa or an ultra modern penthouse, every Luxico property exudes character and charm and is furnished and maintained to meticulous standards to ensure our guests enjoy a truly memorable stay.  \nSource: This is an extract from the company's own website"},
{"employer_url": "https://www.seek.com.au/companies/luton-properties-932846", "employer_name": "Luton Properties", "employer_info": "Luton is a local company, established in Canberra in 1999. At the time, Director Richard Luton was already a formidable presence in the Canberra real estate market, as he set out with a dream to create a business based on his vision of 'putting the person back into real estate' - providing a personal and knowledgeable service tailored to individual client needs - a vision that still guides Team Luton today.\n\nOver the last seventeen years, Richard, his Directors, and his team of experienced sales and property management consultants have achieved significant results right across the Canberra region. Tailored marketing campaigns, outstanding client service, and excellent communication and negotiation between vendor and buyer are key to our success.\n\nAs the largest privately owned agency in Canberra, we offer our clients unequalled and consistent service from all of our nine offices, covering Canberra completely. We are one company with one Principal and a strong team of Directors providing strategic direction.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/lutheran-aged-care-437844", "employer_name": "Lutheran Aged Care", "employer_info": "Residential Living\nOur residential care homes offer 24 hour support and care for those who may need that level of care to maintain their quality of life. Our homes are buzzing with life and people, but also provide many beautiful garden areas and quiet private areas, including your own tastefully decorated room and ensuite\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/luther-college-800621", "employer_name": "Luther College", "employer_info": "Luther College is one of 86 schools of the Lutheran Church of Australia, 15 of which are in Victoria. Luther College commenced in 1964 and in 2014 celebrated its 50th Anniversary.\n\nAs a Christian school Luther College values service, community, excellence and integrity. The College's extensive programs give students the opportunities and experiences to grow and prepare to successfully contribute to society with confidence and dignity. \n\nThe statement Greater care. Greater learning. encapsulates a central philosophy of a Luther College education.  It is our belief that if the students of Luther College are nurtured in their adolescent years, encouraged in pursuing their dreams and challenged with an engaging curriculum, they will grow into responsible and motivated young adults.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/lutheran-community-care-609552", "employer_name": "Lutheran Community Care", "employer_info": "Lutheran Community Care is a well established, not-for-profit organisation that provides services to people from all backgrounds in more than 20 locations in urban and regional Queensland.\n\nSource: this is an extract from the company's own website"},
{"employer_url": "https://www.seek.com.au/companies/lush-cosmetics-806529", "employer_name": "Lush Cosmetics", "employer_info": "LUSH is an international retailer of fresh handmade cosmetics that is known worldwide for our unique bath and beauty products, amazing skin and hair care, personalized customer service, environmental activism, and a fun & funky store atmosphere.\n\nWe are dedicated to the practices of fair trade sourcing and supporting sustainable communities as well a giving back to organisations that can make a difference through our Charity Pot Program. If you are enthusiastic about customer service, passionate about products, and thrive in a team environment, then the Lush Life is right for you!\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/lunar-mining-804629", "employer_name": "Lunar mining", "employer_info": "Lunar Mining is a locally owned, Emerald based Underground Mining Services Company that has been servicing the coal mining industry in the Bowen Basin since January 2013. With our business premises located in Emerald, our base in Central Queensland allows us to specialise in servicing coal mines throughout the Bowen and Galilee Basin.\n\nLunar Mining provide the labour hire of experienced, safety conscious mineworkers, trades personnel, supervisors and ERZ Controllers to local coal mining sites. We have a quality workforce of permanent and contract employees providing safe, productive and cost effective outcomes for our customers.  Our teams are highly skilled and have an outstanding safety and production record throughout Central Queensland.  We also offer a quality service for the efficient and cost effective refurbishment of drill steels, monorail, pumps, hoses, pipes and conveyor structure.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/luna-park-sydney-433906", "employer_name": "Luna Park Sydney", "employer_info": "Luna Park Sydney is an entertainment precinct of many faces.\n \nThese days you’re just as likely to visit this superbly restored fun-park to catch a concert at the Big Top, eat classy cuisine at The Deck or take in the million dollar views as you are to ride the Tango Train or Ferris Wheel, as folks have been doing since 1935.\n \nNow as then, Luna Park is just for fun. It's a people’s park where you can throw a party for the kids, host your dream wedding or stage a gala for thousands in the state-of-the-art Crystal Palace. Click below to travel through time and experience Luna Park's history.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/lundavra-state-school-820006", "employer_name": "Lundavra State School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/luna-park-melbourne-434133", "employer_name": "Luna Park Melbourne", "employer_info": "Overlooking the famous Port Phillip Bay, this historic park has been a destination for Melbourne families for the past century. With 2012 celebrating 100 years of fun-filled adventures, Luna Park continues to surge forward with a generous mix of heritage listed attractions and brand new thrill rides to satisfy all thrill seekers.\nThe most famous of the Park’s attractions is its Scenic Railway Roller Coaster, a large wooden coaster that projects its passengers, at high speed, around the outside of the entire Park. It boasts the title of being the oldest continually operating wooden roller coaster in the world and the only one of its kind with a standing brakeman in control aboard its moving carriages. This world famous roller coaster will not only provide you with heart-stopping dips and turns, but also the most stunning views of Port Phillip Bay St. Kilda has to offer.\nLuna Park offers a range of attractions for all ages from mini roller coasters such as the Silly Serpent, to nail biting thrill rides such as the Pharaoh’s Curse and Power Surge. A day at Luna Park cannot be missed when visiting Melbourne, no matter your age.\nSource: this is an extract from the company’s own website."},
{"employer_url": "https://www.seek.com.au/companies/lumina-chartered-accountants-804626", "employer_name": "Lumina Chartered Accountants", "employer_info": "Lumina provides specialist outsourced accountancy services and acts as the accounting and finance department for organisations ranging from multi-nationals establishing a presence in Australia through to small and medium sized Australian Securities Exchange listed companies. Services span accounts payable, document management and payroll through to efficient taxation structuring, complex international consolidations and preparation of financial statements. \n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/lumo-energy-433027", "employer_name": "Lumo Energy", "employer_info": "We're an Australian-based home and business energy retailer supplying electricity and gas.  Formerly known as Victoria Electricity, South Australia Electricity, Queensland Electricity and New South Wales Electricity, we came together under one name and launched Lumo Energy in 2010.  Today, we're approaching half a million customers with a thriving Melbourne-based workforce of 600.\n\nSource: this is an extract from the company's own website"},
{"employer_url": "https://www.seek.com.au/companies/luma-pictures-932777", "employer_name": "Luma Pictures", "employer_info": "Luma is a world class creative studio with offices in California and Australia. This is where we build compelling and beautiful art, technology and culture. We formed in 2002, with divergent interests, in a tumultuous visual effects industry, always keeping with a steady goal to create standout work, with exceptional and friendly people… and to have a lot of fun along the way!\n\nA long road and many years later, we find ourselves fortunate enough to marry those divergent interests with our global family, to create everything that inspires us.\nCombining the strengths of our artists, designers, strategists and writers, Luma Pictures has united varied interests and passions to create original content, spanning production and distribution of motion pictures, episodic, new media, and mixed reality, along with sound design and music production. \nSource: This is an extract from the company's own website"},
{"employer_url": "https://www.seek.com.au/companies/lumen-christi-college-800617", "employer_name": "Lumen Christi College", "employer_info": "\n\n\n\n"},
{"employer_url": "https://www.seek.com.au/companies/lululemon-athletica-434894", "employer_name": "Lululemon Athletica", "employer_info": "Founded by Chip Wilson in Vancouver, Canada in 1998, lululemon is a yoga-inspired, technical athletic apparel company for women and men. What started as a design studio by day and yoga studio by night soon became a standalone store in November of 2000 on West 4th Avenue in Vancouver’s Kitsilano neighbourhood.\n\nOur vision for our store was to create more than a place where people could get gear to sweat in, we wanted to create a community hub where people could learn and discuss the physical aspects of healthy living, mindfulness and living a life of possibility. It was also important for us to create real relationships with our guests and understand what they were passionate about, how they liked to sweat and help them celebrate their goals. Today, we do this in our stores around the globe. \n\nSource: this is an extract from the company’s own website."},
{"employer_url": "https://www.seek.com.au/companies/ludmilla-primary-school-988208", "employer_name": "Ludmilla Primary School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/lucas-434586", "employer_name": "Lucas", "employer_info": "Lucas Drilling Services provides a comprehensive suite of services to the coal and coal seam gas sectors; including exploration, production and directional drilling, workover and well completion services. In addition to these various drilling techniques, we provide a range of specialty services including engineering services for well design and drilling optimisation and professional steering services and tools for directional drilling programmes.\n \nWe own the largest fleet of drilling rigs in Australia (77 multipurpose rigs) and employ more than 630 staff. We work with global resource companies; our customers are responsible for many of the largest energy projects and export commodities in Australia.\n \nOur decades of drilling experience (we pioneered the development of horizontal directional drilling in Australia) and commitment to reliable program delivery, result in safe and productive drilling services for customers and communities alike.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/lu-simon-builders-995243", "employer_name": "LU Simon Builders", "employer_info": "Ready personnel and the ability to mobilise our own assets in an instant means speed, security and savings. If you need 1000 tonnes of scaffolding, we have it. A dozen luffing cranes or 100 sheds? They’re in the yard. This guarantees that we are not subject to market fluctuations or capital equipment shortages.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/lube-mobile-436337", "employer_name": "Lube Mobile", "employer_info": "Right from the beginning, in 1982, Lube Mobile strived to be different to an ordinary mechanic. Throughout the company's growth and evolution, to our current position as market leader, we have constantly sought to solve the traditional problems of car service and repair for our customers.\n\nLube Mobile today remains a 100% Australian-owned company with over 250 employees, a host of workshops nationwide and a genuine belief that taking care of your car can be easy, fast, hassle-free and very cost effective. We have served thousands of satisfied customers, and built a solid base of people who enjoy the convenience of mobile mechanical workshops for their everyday servicing and repairs, as well as for breakdowns.\n\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/lucas-real-estate-437876", "employer_name": "Lucas Real Estate", "employer_info": "RESOURCES\nWelcome to the Lucas resource centre. \n\nOur information hub will provide current market reports and market trends as well as a vast array of tools, tips and industry insights for vendors, buyers, landlords and tenants alike.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/loyalty-corp-australia-pty-ltd-932721", "employer_name": "Loyalty Corp Australia Pty Ltd", "employer_info": "\n\n\n"},
{"employer_url": "https://www.seek.com.au/companies/lucas-total-contract-solutions-436205", "employer_name": "Lucas Total Contract Solutions", "employer_info": "For over 40 years Lucas TCS (Lucas Earthmovers) has worked on a National basis with some of Australia’s leading Mining & Civil major companies. The diverse local & national mining and civil landscape has delivered challenging projects, which has enabled Lucas TCS to develop key services such as their own aircraft fleet.  Additional services such as a full mobile camp for remote projects & site remediation capabilities complement the existing services and the extensive range of mining and civil solutions the company already offers.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/ltt-814212", "employer_name": "LTT", "employer_info": "Who are we?\nLTT is a national vocational education and training provider that specialises in Laboratory Operations, Pathology, Health and Building Studies. Whether you want to improve your career opportunities, employment prospects, or gain a pathway to further tertiary study, our trainers provide practical hands-on training and industry-relevant skills that lead to real outcomes.\n\nWhat do we do?\nLTT delivers a range of courses with qualifications that employers seek, offering nationally recognised qualifications across various levels including:\n\nCertificate II to teach you a range of introductory skills to get you started in the workplace or provide you with skills that your employer wants\nCertificate III and IV to provide you with advanced level skills to get you promoted or job ready \nDiplomas and Advanced Diplomas to build your technical expertise and practical skills to help progress your career \nShort courses to brush up on your skills, learn something new, or help you progress your study further \n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/lowmead-state-school-820330", "employer_name": "Lowmead State School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/lucky-7-436548", "employer_name": "Lucky 7", "employer_info": "Lucky 7 supports the independent convenience channel. All of our stores are locally owned & operated with over 150 sites Australia wide. We offer a great range of value convenience products & monthly specials. Find your nearest store today!\n\nBECOME A LUCKY 7\nLucky 7 is a banner first & a buying group second & as such our members enjoy the same level of supplier trading support & service as any other major convenience banner group. We provide a full formatted style retail operation & program for independent retailers.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/lushous-clothing-800620", "employer_name": "lushous clothing", "employer_info": "With more than 20 years experience of trading in Ladies Fashion, Lushous Accessories has excelled in providing and innovating upon the latest styles sourced from all over the U.S.A and Europe . All styles are then modified and adjusted to suit the Australian fashion market to ensure we have the most up to date and current ranges. Our design team makes several trips every year to make sure they are always on top of the hottest fashion trends so we always have the latest and greatest stock for our clients. \n\nWith factories and offices in China, Lushous Accessories specializes in having a very high quality of clothing at very low and competitive prices. The company has gained lot of knowledge and experience in all areas of fashion and as a result our staff always do their best to provide a reliable and friendly customer service.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/lowes-433445", "employer_name": "Lowes", "employer_info": "ver 110 years and still going strong\nLowes is a leading Australian menswear, young menswear and schoolwear retail chain offering well-made clothing at affordable prices.\nAs a family-owned business, Lowes is part of a small but elite group of companies, which have been in business for over 110 years and are still 100% Australian owned.\nFor over a century, the company has been built on integrity, forward planning and financial success. Today, with over 218 stores nationwide, it continues to expand steadily as it has for many years.\nIn a brand conscious society, while many outfitters have paid dearly to charge more for a somewhat pretentious, upmarket image, Lowes have maintained a simple, down to Earth integrity in the way they have conducted business for over a century. Since it was founded in 1898, it has grown from a traditional “value for money” menswear store to become a well-known Australian icon in its own right.\nToday, Lowes continues to offer the public a range of well-made clothing at affordable prices. Lowes has expanded from its traditional offering of menswear and business wear to offer a full range of school wear, young mens wear, sportswear, active wear, footwear and work wear.\nCome and discover this Australian icon at a store near to you.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/loves-data-932661", "employer_name": "Loves Data", "employer_info": "Loves Data is all about getting the most out of your data. We’re about getting to the good stuff and skipping the fluff. We’re specialists in Google Analytics and Google AdWords and have consulted with some of the biggest brands and trained thousands of people to do it themselves.\n\nBefore we began to focus on all things data, we designed and built websites. We soon discovered more and more of our clients wanted to know how their sites were performing. I came across the newly launched Google Analytics about the same time in 2005 (wow, how time flies).\n\nI loved Google Analytics from the beginning. I absolutely loved how easy it was to start collecting data and reporting on trends. Google invited us to become a Google Analytics Certified Partner in 2007. I’ve been showing people how to understand and apply their data to improve their online marketing and digital channels, ever since.\nSource: This is an extract from the company's own website"},
{"employer_url": "https://www.seek.com.au/companies/lowood-state-school-820594", "employer_name": "Lowood State School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/lower-tully-state-school-819510", "employer_name": "Lower Tully State School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/lourdes-hill-college-800599", "employer_name": "Lourdes Hill College", "employer_info": "Lourdes Hill College is an independent Catholic college providing education for around 1200 girls from Years 7 to 12. We exist to make known the love of God and to inspire young women to create a world that reflects the teachings of Jesus Christ. We embrace the Benedictine values of genuine community, compassion, effective listening and moral stability, and valuing prayer and peace. \n\nEstablished in 1916 by the Sisters of the Good Samaritan, our heritage is rich and places strong emphasis on education and the importance of balance between work, prayer and recreation in life. \n\nToday, we offer our students the learning and support they require to reach their full potential. Our approach helps students to become flexible thinkers and life-long learners. We teach the skills to step forward and meet every challenge and achieve success in this information and knowledge age.\n \nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/lovisa-432607", "employer_name": "Lovisa", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/lowes-petroleum-service-438740", "employer_name": "Lowes Petroleum Service", "employer_info": "Lowes Petroleum has been leading the way in fuel and lubricant distribution since 1977.\n\nLowes Petroleum has come a long way since its humble beginnings with one truck and one driver in small regional town of Boggabilla, NSW in 1977. Today we have expanded our fleet and our distribution network throughout Queensland, New South Wales and Victoria.\n\nLowes Petroleum, we pride ourselves on consistently providing quality products as well as better and more effective solutions for our customer’s ever changing needs.\n\nWith extensive local experience in rural and regional Australia, Lowes Petroleum is able to offer local service through our network of bulk fuel and lubricant depots, delivery vehicles and retail service stations delivered by a team of people who understand the local communities in which we operate.\n\nWe have a broad base of customers from the primary producer, industrial, mining, transport and retail sectors. Each year we sell and deliver over 1 billion litres of petroleum products to the regional and rural parts of Australia.  \nSource: this is an extract from the company’s own website."},
{"employer_url": "https://www.seek.com.au/companies/louis-dreyfus-company-814148", "employer_name": "Louis Dreyfus Company", "employer_info": "Louis Dreyfus Company is a leading merchant and processor of agricultural goods, leveraging its global reach and extensive asset network to deliver for its customers around the world - safely, responsibly and reliably. Today we help to feed and clothe some 500 million people, originating, processing and transporting approximately 81 million tons of commodities annually.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/lotus-glen-health-service-821449", "employer_name": "Lotus Glen Health Service", "employer_info": "GP Clinic\nDiabetic Clinic\nNurses Clinic\nOptometrist Clinic\nPodiatrist Clinic\nChronic Disease Clinic\nSmoking Cessation Clinic\nPrison Mental Health Service Clinic\nDental Clinic\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/love-real-estate-800602", "employer_name": "Love Real Estate", "employer_info": "The Tradition Behind the Name\n\nWhen Ted Love opened his doors of his first agency in Reservoir in 1945, little did he expect the enthusiasm and commitment to service would create a company that would set the standard for the industry to follow.\n\nNow selling to the children, grandchildren, nieces, nephews and friends of past clients, Loves have established themselves as leaders in the marketplace.\n\nAt Love Real Estate we believe that to go into partnership with you, our vendor, we as your agent have the necessary skills, knowledge and personal values to achieve the highest price in today’s marketplace.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/louis-vuitton-434473", "employer_name": "Louis Vuitton", "employer_info": "Over the past 160 years, Louis Vuitton has constantly reinvented itself and actively embraced the technical and artistic revolutions of each era. It continues to express distinctive pioneering spirit, panache and fantasy, always inspired by the soul of travel. This inspiration is seen in the fresh creative momentum Nicholas Ghesquière has brought to women’s ready-to-wear collections, Kim Jones’ work on men’s collections, the launch of innovative new products, or artistic collaborations that celebrate the iconic Monogram signature.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/lotus-glen-correctional-centre-985708", "employer_name": "Lotus Glen Correctional Centre", "employer_info": "The Lotus Glen Correctional Centre, located 25 kilometres south of Mareeba, accommodates high and low security prisoners and provides a remand and reception function north of Innisfail.\n\nThe centre has a total capacity of 498 (398 within the secure unit and 100 at the centre's farm).\n\nThe centre services the Cape York Region including Cairns, isolated communities and Torres Strait Islands. Its prisoner population is generally comprised of approximately 70 percent Aboriginal and Torres Strait Islander people.\n\nThe centre provides prisoners with meaningful work opportunities in industry and farm work areas which provides skills that can be used by the prisoners on release in the local region.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/lotterywest-436247", "employer_name": "Lotterywest", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/lorraine-lea-435615", "employer_name": "Lorraine Lea", "employer_info": "We understand that you want more from your shopping experience – more personal attention, more style, more value, more service and more fun. You have a passion for good things in your home, so our commitment is to search for the best selection, value and quality merchandise and to supply a personal and fulfilling service right to your Host's front door. Our friendly, knowledgeable Independent Stylists are always here for you and are committed to delivering a shopping experience you will remember. In the end our promise is simple: We want to make sure that your home looks great and you are proud of it.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/lowther-hall-anglican-grammar-school-800609", "employer_name": "Lowther Hall Anglican Grammar School", "employer_info": "Lowther Hall has a reputation for providing a well-rounded education for girls in an intimate environment of 800 students from Kindergarten to Year 12. We are a diverse, open-entry school where students are known and well catered for from their very first day.We pride ourselves on offering  academic programs which support and challenge each student to achieve her best, and we seek to assist girls to understand a wide range of academic disciplines and co-curricular pursuits. \n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/lota-state-school-819876", "employer_name": "Lota State School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/lorna-jane-432878", "employer_name": "Lorna Jane", "employer_info": "For 25 years, Lorna Jane has empowered women to lead their best active lives. Now, we’re investing in talented people to grow our global business.\n\nSource: this is an extract from the company’s own website."},
{"employer_url": "https://www.seek.com.au/companies/lorimer-homes-804605", "employer_name": "Lorimer Homes", "employer_info": "Lorimer Homes is a family owned business that starts with myself Les Lorimer (owner/ project manager), and includes my daughter Katie Ybarra (office manager). I got started in the building industry in 1978 and learned the industry starting out as a carpenter, and working my way up through the ranks, until branching off on my own both through remodels and new construction. At 55 years old, building houses is something I enjoy and truly love to do. I personally over see all phases of the company and make the necessary decisions needed to improve the quality and workmanship that we at Lorimer Homes strive to provide our customers.\n \n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/loreto-normanhurst-814820", "employer_name": "Loreto Normanhurst", "employer_info": "Loreto Normanhurst is a leading Sydney independent, Catholic secondary boarding and day school for girls.  Established in 1897, the school is part of a worldwide network of Loreto schools under the care of the Loreto Sisters (IBVM), and is one of seven Loreto schools in Australia. \n\nLocated in Sydney’s leafy Upper North Shore, less than 30 kilometres from the Sydney CBD, the school is set on over 25 acres of glorious grounds, and offers state of the art facilities for approximately 900 students, over 200 of whom are boarders from Country NSW.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/loreto-mandeville-hall-toorak-834446", "employer_name": "Loreto Mandeville Hall Toorak", "employer_info": "Loreto Mandeville Hall Toorak is an independent Catholic school that nurtures the faith and education of girls from Preparatory to Year 12. Additionally, we offer a co-educational early learning Centre at  St Peter’s Early Learning Centre, Toorak. \n\nFor over 400 years, Loreto Schools have been educating young women all over the world. Loreto Toorak continues this tradition. We believe in providing our girls with the challenges they need to excel in life as it is through life’s challenges that we grow and discover our true selves. We provide these challenges in a nurturing environment that encourages our girls to become the best they can be. \n\nAs a school, we embrace the Loreto values of freedom, justice, sincerity, verity and felicity. These foster a deeper understanding of ourselves and each other, and encourage compassion for the wider community. Our Founder Mary Ward believed “Women in time to come will do much”.  Accordingly, a Loreto graduate today is a confident, engaged and optimistic woman.  \nSource: this is an extract from the company’s own website."},
{"employer_url": "https://www.seek.com.au/companies/loreto-kirribilli-813838", "employer_name": "Loreto Kirribilli", "employer_info": "As one of seven Loreto schools in Australia, Loreto Kirribilli was founded by the Loreto Sisters whose 17th Century founder, Mary Ward, recognised the critical difference that education could make to her troubled world, especially through the education, care and development of faith in women.\n\nThe community of Loreto is committed to living up to the expectations of Mother Gonzaga Barry, who stated:\n\n“What the world needs is a wise, lovable and well-educated woman.”\nThe Loreto Kirribilli tradition combines a strong program of religious education and pastoral care, excellent academic outcomes and a wide choice of co-curricular activities supported by talented and experienced staff and an up-to-date, fully equipped campus.\n\nOur educational philosophy, based on the belief that women can excel, with an emphasis on social concern and student leadership, helps us encourage these qualities in our girls – and in our teaching and non-teaching staff.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/loreal-australia-433955", "employer_name": "L'Oreal Australia", "employer_info": "Present in more than 130 countries, L'Oréal Paris grew from one philosophy: to innovate and offer top performing products at great prices to the greatest number of consumers possible. A philosophy which stems from the research carried out in our laboratories and our will to make professional expertise accessible. \nSource: this is an extract from the company's own website"},
{"employer_url": "https://www.seek.com.au/companies/loreto-college-ballarat-800593", "employer_name": "Loreto College Ballarat", "employer_info": "We provide a spirited Catholic education that values, engages and empowers young women for their global future.”\n\nLoreto College is a welcoming, friendly community where each person is valued and where spirituality and learning are nurtured. With the Catholic perspective that formed the spirit and virtues of Mary Ward, young women are educated to strive for personal excellence.\n\nLoreto College has its foundation in the gospel of Jesus Christ and is proud to be part of and contribute to the larger Catholic community. Loreto College builds on a strong and proud tradition of the education of girls, one which strives to offer “a Catholic education which liberates, empowers and motivates students to use their individual gifts with confidence, creativity and generosity in loving and responsible service.”\n\nThe five pillars of Freedom, Justice, Sincerity, Verity and Felicity summarise the vision of Loreto Education. We are a Catholic School with the expressed aim of living out the values of the Gospel. We are a Loreto school in the spirit of Mary Ward that believes strongly ‘that women in time will come to do great things.’\nThe History of Loreto College Ballarat\n\nThe Loreto school in Ballarat was the first Loreto school in Australia, established by Mother Gonzaga Barry and her community of sisters in 1875 following an invitation from the Bishop of Ballarat to establish a school for girls.\nMother Gonzaga had come to Australia from Ireland instilled with the educational vision of Mary Ward, who more than 400 years ago was committed to education for women built on ‘the qualities of freedom, justice and sincerity’.\n\nHolding close her faith and these ideals, Mother Gonzaga established Loreto schools in Ballarat vowing to ‘educate the whole child’ so that every girl, despite her background, was given ‘… a chance of distinguishing herself…’\n\nIt was Mother Gonzaga’s view that offering girls a rounded education, including the sciences, ‘would bring about reforms and improvements not yet dreamt of’.\n\nMother Gonzaga’s educational endeavors came to include two schools for girls in Ballarat, at Mary’s Mount and Dawson Street, as well as primary schools. From these beginnings, Mother Gonzaga’s extraordinary vision and ability also saw Loreto schools established in Melbourne, Sydney, Brisbane, Adelaide and Perth.\n\nIn 1978, Dawson Street Day School and Mary’s Mount were formally amalgamated to form Loreto College Ballarat, with Years 7 – 8 at Dawson Street and Years 9 – 12 at Sturt Street – Mary’s Mount. In 2007, Loreto’s junior and senior campuses were combined on the one campus at Sturt Street following the construction of the Mary Ward Centre for Years 7 -8.  The Mary’s Mount Centre, a performing arts centre housing a 500 seat theatre, music and dance studios, classrooms and multimedia labs, was opened in 2015. The building of the Mary’s Mount Centre provided space for the redesign and development of a new contemporary learning space, the Mulhall Centre. Year 9 students commenced classes in the Mulhall Centre in 2016\nSpiritual and Religious Development\n\nA vigorous belief in the capacity and responsibility of women to contribute significantly to society and the church underlies the emphasis on our tradition of the education of girls.\n\nLoreto College is a Catholic school and it is important for us as educators to join parents in guiding the spiritual and religious development of students – both as individuals and as part of the community in which they live, learn and pray.\n\nIn Religious Education classes, Loreto College students explore the teachings of our faith through the Awakenings religious education program, as well as participation in Liturgy, Prayer, Retreats and Action for Justice and Peace.\n\nLoreto College strives to be a place where the extraordinary reality of being ‘made in the image and likeness of God’ and being able to ‘find God in all things’ underpins and brings vitality to all that students undertake. It is within this context that the Loreto College community attempts to nurture students so they may see God in all that they do and experience.\n\nWe do however, recognize that in today’s open and pluralistic society, there may be frequent questions and challenges raised by our students which we seek to deal with seriously as we attempt to support our students’ search for a faith to which they can honestly assent and commit.\n\nIt is our faith in God and the spiritual traditions left to us by Mary Ward and Mother Gonzaga Barry and their faith filled companions which allow us to encourage students to explore the contemporary world as part of their individual spiritual journey\nSource: this is an extract from the company’s own website."},
{"employer_url": "https://www.seek.com.au/companies/lord-nelson-brewery-hotel-804602", "employer_name": "lord nelson brewery hotel", "employer_info": "Welcome to the\nLord Nelson\nBrewery Hotel\nSydney’s oldest continually licensed hotel, located in the historic Rocks precinct and home of Australia's oldest pub brewery. The Lord is recognised around the world for its award-winning beers, wine list, food and accommodation.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/lord-of-the-fries-434876", "employer_name": "Lord of the Fries", "employer_info": "The idea behind Lord of the Fries began over late night snack excursions early in 2004. Mandy (Toronto) and Mark (Melbourne) met while living in Taiwan (Tainan). Their love for fries drew them closer, and their disdain for nasty frozen chemical fries inspired them to create the perfect fry.\n\nThey wanted fresh potatoes, thick but not too thick, crispy but not too crunchy, delicious and saucy, the mission began.\n\nIt was the beginning of a vegetarian fast food revolution.\n\nLanding in Melbourne in August, 2004, they decided to take the best fries you will ever try to the people! What better way than a mobile chip van now all they needed was a name.\n\nThis is where Sam (Mark’s brother) comes sizzling into the story. Being a creative wiz, he crowned the venture LORD OF THE FRIES.\n\nThe Lord was born!!\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/look-print-834859", "employer_name": "Look Print", "employer_info": "Since 1991, Look Print has been operating independently. With all its facilities onsite we are able to successfully maintain complete control of customer service, pre-press, printing, finishing, delivery and installation, both Australia wide and worldwide.  \nLook Print is proud to have been fulfilling some of Australia’s most successful companies with their large format digital printing needs for over 20 years.\nLook Print is Australia ‘s largest capacity large format digital printer. Our facilities and resources include:\n\n \n•11 different print technologies (more info)\n•18 printers\n•53 staff members\n•Over 3000m² of production facilities across two premises\n•More than 350m²/hr print capacity, up to 24hrs a day, 7 days a week\n\n \n No matter how big the job, we have the technology, expertise and capacity to deliver. With a comprehensive range of print technologies we are able to manage your entire promotional campaign, ensuring colour consistency across the board\nSource: this is an extract from the company’s own website."},
{"employer_url": "https://www.seek.com.au/companies/loot-homewares-434370", "employer_name": "Loot Homewares", "employer_info": "committed to exploring and understanding the difference between House and Home. This started with the conscious decision to call our company Loot 'Home'wares and not 'House'wares.\n\nYour House is a structure built to shelter you from the elements and keep your belongings safe. Your Home is a quintessential member of your family. A living extension of your own personality, where you gather with your loved ones to celebrate all the best moments of your life, from a simple meal to the wildest of parties.\n\nOur aim is to provide our customers with the most powerful gift we could find -Choice.\n\nHuge ranges of colours, sizes, materials and concepts. Allowing you to mix and match, to create your own palette, your own designer spaces, your own -HOME.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/looma-remote-community-school-871626", "employer_name": "Looma Remote Community School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/lonsdale-hotel-438269", "employer_name": "Lonsdale Hotel", "employer_info": "Our modern Bistro offers a fantastic atmosphere with unique environmentally friendly eco fires, quality food and a comprehensive selection of wines beers and non-alcoholic drinks.\n\nOur three senior Chefs create wonderful monthly specials to complement our extensive menu.\n\nThe outdoor dining area overlooking our award winning gardens is perfect for a family or corporate celebration.\n\nThe Bistro has continuous dining from 11:30am until 10:00pm, 7 days of the week.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/lonsdale-financial-group-796818", "employer_name": "Lonsdale Financial Group", "employer_info": "Working with financial planning and aligned accounting practices since 1985, we understand what you need from a dealer group.\n\nWe are a boutique group with the added benefit of being part of the IOOF group, a leading provider of quality financial services in Australia.\n\nThis means that you not only have the benefit of working with a dedicated dealer group team, but you also have access to a large array of resources and technical knowledge that comes from being part of a larger group.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/longridge-group-861460", "employer_name": "Longridge Group", "employer_info": "L O N G R I D G E  G R O U P\n\nNo matter who we are, or where we live, nothing we create has the same emotional attachment as our home. And no wonder, it's the sum of so much of our energy, resources and imagination. It's there to keep us safe, to keep us comfortable, to make living more enjoyable and, it's a measure of our achievement.\n\nThrough our various brands we've introduced specific themes to match the needs and expectations of our clients, whether practical or emotional.\na contemporary fresh look and thinking in our urban living and affordable range; \nGallery Living\na range of architect designed upmarket homes distinguished by their creative use of space and light to enhance modern and changing lifestyles; Longridge Homes\ninnovatively designed and built spacious homes for ultimate relaxation - sea change, tree change or weekender; Sarah Homes\na range of innovative designs for extended living with Atlas Independent Living Units, Atlas Modular Extensions, Atlas Transportable Homes; Atlas Living.\nThere is of course one common thread in our various product ranges - design. It's the one element we don't ever compromise and it is the Longridge Group difference: Homes designed to make you feel good about life.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/longreach-state-school-819556", "employer_name": "Longreach State School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/longreach-school-of-distance-education-820109", "employer_name": "Longreach School of Distance Education", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/lucky-star-tavern-804623", "employer_name": "Lucky Star Tavern", "employer_info": "Welcome To Lucky Star Tavern\nA suburban Brisbane tavern with all of the charm and friendliness that comes with a family owned Australian Hotel. \nConveniently located at the Jackson Road Shopping Centre, cnr of Hellawell and Jackson Roads Sunnybank Hills, this hotel offers a spacious and relaxing bistro serving up the best quality food, a main bar with 11 TV's showing all live sport, TAB terminals, keno and a gaming room boasting 35 of the latest pokies. There is something for everyone at our family friendly hotel.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/longreach-state-high-school-820325", "employer_name": "Longreach State High School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/longreach-regional-council-804599", "employer_name": "Longreach Regional Council", "employer_info": "The iconic Longreach Region in Central Western Queensland is situated 700 kilometres from the coast, west of Rockhampton, and covers an area of 40,638 square kilometres (roughly the size of Denmark). The Region encompasses the outback townships of Longreach, Ilfracombe, Isisford and Yaraka and the entire population is approximately 4,300 people. The main industries are cattle and sheep production and tourism. You can travel to this unique part of Queensland by road, rail or plane.\n\nLongreach serves as the administrative centre for the Region and is home to the Australian Stockman's Hall of Fame, Qantas Outback Founders Museum and Longreach Powerhouse Museum. Attractions in the outlying centres include Ilfracombe's ‘Machinery Mile', Isisford's ‘Outer Barcoo Interpretive Centre' and Yaraka's ‘Mt Slocombe Lookout'.\n\nSource: This is an extract from the company’s own website."},
{"employer_url": "https://www.seek.com.au/companies/longreach-hospital-821484", "employer_name": "Longreach Hospital", "employer_info": "The Longreach Hospital is currently undergoing a $7 million upgrade and refurbishment as part of a $51.58 million statewide Rural hospital rectification works program due for completion by mid-2014.\n\nAllied health and community services include dental, dietetics, physiotherapy, podiatry, occupational therapy, speech pathology, social work, community health, women's health, child health and mental health.\n\nVisiting specialist services include cardiac outreach team, child psychiatrist, general surgeon, obstetrician and gynaecologist, oncologist, paediatric team, palliative care/pain specialist, psychiatrist, respiratory physician, audiologist, gastroenterologist, neurologist (consult only), ophthalmologist, orthopaedic surgeon.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/lowood-state-high-school-819558", "employer_name": "Lowood State High School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/long-service-payments-corporation-932467", "employer_name": "Long Service Payments Corporation", "employer_info": "Portable long service for workers in the building and construction industry has been around since 1975.\nThe original legislation was administered by the Long Service Leave Division of the Builders Licensing Board until 1982, when the Building & Construction Industry Long Service Payments Corporation was established.\nIn 2010, legislation changed our name to the Long Service Corporation to enable us to administer additional portable long service schemes in New South Wales.\nOn 1 July 2011, the Contract Cleaning Industry (Portable Long Service Leave Scheme) Act 2010 commenced and we now administer long service schemes for workers in both the building and construction and contract cleaning industries in New South Wales.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/longford-primary-school-tas-988206", "employer_name": "Longford Primary School TAS", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/lonely-planet-434013", "employer_name": "Lonely Planet", "employer_info": "At Lonely Planet we tell it like it is, without fear or favour. There's a whole world of amazing sights, hotels, travel companies and gear manufacturers out there - and we want to tell you which ones we think are best. But we never compromise our opinions for commercial gain. If you read something written by a Lonely Planet author, you can guarantee they've been there, had a look for themselves and are telling you what they really think. It's trusted advice from a trusted source\n\n\nSource: This is an extract from the company's own website"},
{"employer_url": "https://www.seek.com.au/companies/lombard-the-paper-people-435241", "employer_name": "Lombard The Paper People", "employer_info": "In 1969, when most are thinking of retiring, Alexander and Madeleine Lombard - both in their 60’s - established Lombard The Paper People with their youngest son Claude, in the shed of their Box Hill home. From the beginning, Lombard The Paper People revolutionised the paper industry by pioneering new methods and issues that have now become standard industry practice. The company is a pioneer in the support of ecological and environmental awareness causes such as “Save the Whales”, recycling news print, and were the first to supply photodegradable and biodegradable plastics.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/london-tavern-caulfield-south-437772", "employer_name": "London Tavern Caulfield South", "employer_info": "PORTS BAR MENU AVAILABLE ALL DAY FRIDAY TO SUNDAY!!\n\n\nThe London Tavern is the place to meet with friends, have a meal and enjoy a drink, all in a welcoming and comfortable environment. We offer affordable and delicious meals in our bistro and we can also host your next function.\n\nAll this along with our Thirsty Camel Bottle Shop, Courtyard, Daily Meal Specials , Seniors Lunch and Dinners, weekly Bottleshop specials, the London Tavern has something for everyone.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/logicar-932340", "employer_name": "Logicar", "employer_info": "Welcome to Logicar: The specialists in EFI spare parts, workshop equipment and ECU reconditioning\nLogicar are backed by the Stillwell Motor Group (SMG), one of Australia’s largest privately owned dealer groups with key brands such as BMW, Jaguar, Land Rover, Nissan, Renault, Volvo and VW. \nSMG have supported Logicar to recently expand interstate with branches now covering Victoria, Tasmania and South Australia. With distribution channels opening up across other states Logicar are able to support customers on a  truly national basis. \nOur dedicated equipment team pride themselves in providing customers the very best in sound advice, training and support when capital purchase needs arise. With late model vehicles requiring the latest up to date equipment we recognise the fact that customers need dependable equipment and trustworthy support to truly benefit from their investment. Our work really starts after the transaction is agreed upon to ensure your equipment is correctly prepared, installed and your staff are suitably trained by our qualified specialists. This assures customers they will truly benefit and extract maximum value from their investment.\n \nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/loloma-jewellers-800581", "employer_name": "Loloma Jewellers", "employer_info": "Established in 1959, Loloma Jewellers has grown to become one of the most prestigious jewellery showroom chains across Australia.\n\n\nFounded by Graham Jackson and  the Jackson family, Loloma – Fijian for “a gift of love”, takes pride in designing quality jewellery inspired by a team of specialist gold and silver craftsmen. Diamonds are meticulously handpicked by our qualified gemmologists where each diamond is accompanied by an evaluation certificate, assured only by Loloma Jewellers guarantee of quality. Loloma Jewellers stock only the best and is renowned for the large selection of diamonds, gemstones, opals, pearls, gold and watches the company has on offer.\n\n\nLoloma Jewellers, an industry pioneer takes to the world a wealth of expertise combining fine jewellery and quality service.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/lollipops-playland-and-cafe-435823", "employer_name": "Lollipops Playland and Cafe", "employer_info": "ABOUT US\n\nLocated in a large, open, high stud building, LOLLIPOP’S PLAYLANDs are ‘Pay for Play’ indoor entertainment centres, designed for children 1-11 years. Children between these ages pay to enter, must wear socks, and can stay as long as they like. Children under one enter free.\n\nLOLLIPOP’S PLAYLANDs have two main areas of activity – Casual players (with parents), and Birthday Parties. Most LOLLIPOP’S are open 7 days per week (including most Public Holidays) from 9.30am- 6pm.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/logicamms-433964", "employer_name": "LogiCamms", "employer_info": "LogiCamms delivers multidiscipline engineering consulting, project delivery, asset performance and maintenance services to multiple industries across our Consult, Deliver and Maintain business lines. LogiCamms offers a comprehensive range of value driven and market leading capabilities from our Consult, Deliver and Maintain model that extends across our three industry markets Hydrocarbons, Minerals and Metals and Infrastructure. We bring together extensive capabilities with flexible assurance processes that are optimal for brownfield projects and assets.\n\nSource: this is an extract from the company’s own website"},
{"employer_url": "https://www.seek.com.au/companies/logsys-power-services-932377", "employer_name": "Logsys Power Services", "employer_info": "Logsys Power Services\n\nLogsys Power Services was established in 2006, with our head office in Joondalup, WA. Logsys Power Services employs around 160 dedicated electrical industry professionals and specialises in electrical installation and maintenance.\n\nvisit website \n\nLogsys Engineering Services\n\nLogsys gives you comprehensive options for pole restoration, pole strengthening, above ground pole repair and wood pole maintenance. These options are designed as cost-saving, asset-preserving alternatives to pole change outs.\n\n\nLogsys Eco Energy\n\nLogsys Eco Energy is the WA distributor for Plug&Sun™ Concentrator Photovoltaic systems, a self sustaining source of cleanenergy that doesn't require any fuel or water and produces no noise or CO2 emissions.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/loganholme-state-school-819683", "employer_name": "Loganholme State School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/loganlea-state-high-school-820430", "employer_name": "Loganlea State High School", "employer_info": "Our beautiful coeducational school is situated on 56 hectares of prime river front land. It is a large, centrally located high school in Logan City, with an enrolment of approximately 550 catering for students, years 7 to 12, from a variety of cultural backgrounds.\n\n\n \n\nOur aim is to provide the best education possible to all students so that they may become active and resilient citizens of the future, living out the schools vision of “… making a difference for every student”. In this way, we seek to provide a well-rounded education with opportunities for intellectual, social and emotional growth throughout the six vital years of high school.\n\n \n\nOur expansive curriculum programs cater for each individual student. The academic program is complimented by sporting, cultural, recreational and leadership activities.  We recognise that everyone is different, and that it is that difference that enriches our community. We want our students to challenge their minds, release their creativity, and embrace lifelong learning and growth.\n\n \n\nWe are privileged to have vibrant and talented staff dedicated to teaching your children. It is with their help, support and guidance that your child will reach their full potential. As a community, we wish to work seamlessly with our families, the students and the school. \nSource: This is an extract from the company's own website"},
{"employer_url": "https://www.seek.com.au/companies/logan-village-state-school-819962", "employer_name": "Logan Village State School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/logan-city-special-school-820304", "employer_name": "Logan City Special School", "employer_info": "Welcome to Logan City Special School\nWelcome to the community of Logan City Special School and Early Childhood Developmental​ Program (ECDP). At Logan City Special School and ECDP we cater for students who require significant adaptations to access learning through a high level of individualised programming by specialist teachers.\n\nIf you are a new family to our school I hope that you enjoy being part of our school. We welcome your input and involvement because we believe that the best outcomes are achieved when family, carers and school all work in partnership. If you have any questions or concerns please contact the school.\n\nWe look forward to establishing a quality, caring and dynamic learning environment for your son or daughter.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/logan-city-electrical-436204", "employer_name": "Logan City Electrical", "employer_info": "Logan City Electrical and LCE QLD Contracting PTY LTD are privately-owned Electrical Contracting and Service companies, which were established in the Logan City more than 30 years ago by the current Managing director Mr Peter Burnitt. Based in Slacks Creek, Queensland, it has become renowned for its high standard of service and expertise.\nSource: this is an extract from the company’s own website."},
{"employer_url": "https://www.seek.com.au/companies/logan-reserve-state-school-819993", "employer_name": "Logan Reserve State School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/logan-hospital-800579", "employer_name": "Logan Hospital", "employer_info": "one of the fastest growing regions in the state and provides a range of specialty services for children and adults. Our emergency department is one of the busiest in the state, seeing more than 75,000 presentations each year.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/loddon-shire-council-804588", "employer_name": "Loddon Shire Council", "employer_info": "The Loddon Shire Estimated Resident Population for 2016 is 7,291, with a population density of 0.01 persons per hectare.\nLoddon Shire is located in central Victoria, about 175 kilometres north-west of the Melbourne CBD.\n\nThe Loddon Shire Community Profile provides demographic analysis for the Shire and its suburbs based on results from the 2011, 2006, 2001, 1996 and 1991 Censuses of Population and Housing. The profile is updated with population estimates when the Australian Bureau of Statistics (ABS) releases new figures.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/lockyer-valley-regional-council-806528", "employer_name": "Lockyer Valley Regional Council", "employer_info": "​The Lockyer Valley region is ideally situated being less than a one hour's drive from inner city Brisbane.\n\nIt straddles the Warrego Highway and covers an area of approximately 2,200 sq kms.\n\n\n\nThe population is growing quickly and there are currently around 35,000 residents.\n\nProjections by the Department of Infrastructure and Planning show that the Lockyer Valley region's population is expected to grow to 57,443 by 2031 or by an average of 2.4% per annum.\n\nSource: This is an extract from the company’s own website."},
{"employer_url": "https://www.seek.com.au/companies/logan-central-community-health-centre-821539", "employer_name": "Logan Central Community Health Centre", "employer_info": "Logan Central Community Health Centre is a multidisciplinary facility that provides community health programs and clinics for adults and children. We have medical, nursing, allied health, and administrative staff who work together to provide you with the highest quality care.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/lockyer-district-state-high-school-819968", "employer_name": "Lockyer District State High School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/lockrose-state-school-820157", "employer_name": "Lockrose State School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/lockridge-community-health-centre-795993", "employer_name": "Lockridge Community Health Centre", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/lockhart-state-school-820009", "employer_name": "Lockhart State School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/lockridge-primary-school-871610", "employer_name": "Lockridge Primary School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/lockheed-martin-434246", "employer_name": "Lockheed Martin", "employer_info": "Lockheed Martin's involvement with, and support for Australia began in the early-1940s, when the Royal Australian Air Force (RAAF) began flying the legendary 'Hudson' bomber. By the time of Japan's entry into World War II, the RAAF had taken delivery of 152 Hudsons.\nOver the ensuing 55 years, this founding relationship has grown into an extensive partnership with the Australian Department of Defence, national security agencies and local industry spanning the air, land, maritime, information technology, and space domains. Lockheed Martin has also expanded in civil business areas, such as information technology, transport & logistics and energy.\nLockheed Martin is also an acknowledged leader in the delivery of world class simulation and training systems. Focusing on fixed wing pilot and aircraft maintainer training through to automated ship control systems,\n\nSource: this is an extract from the company’s own website"},
{"employer_url": "https://www.seek.com.au/companies/lockhart-river-primary-health-care-centre-821584", "employer_name": "Lockhart River Primary Health Care Centre", "employer_info": "Lockhart River provides health services to the community of Lloyd Bay and the Claudie River.\nIt offers primary clinical care and primary healthcare services through strong partnerships between nursing staff, and Aboriginal and Torres Strait Islander health workers.\nRoutine services are offered from Monday to Friday with 24-hour emergency services.\nLockhart provides a suite of regular visiting medical, community and allied health services in partnership with other health and social service providers, including diabetes educators, podiatry, paediatricians, hearing health, mental health, maternal, child health, eye specialists, and ear nose and throat specialists.\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/lochington-state-school-820329", "employer_name": "Lochington State School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/loccitane-435898", "employer_name": "L'Occitane", "employer_info": "Ever since it was founded in 1976, L'OCCITANE has nurtured simple values: authenticity, respect and sensoriality. This is more than a philosophy; it is a commitment that, over the years, has influenced many of important decisions. All of our actions and choices are guided by a twofold desire: to preserve and to pass on. It is this that gives our brand its life force, its meaning and its purpose.\nRespectfulness is at the heart of L’OCCITANE’s values, helping to guide its social policy, with the following major points: \n• Development of human resources to support the group’s growth while allowing employees to express their potential career aspirations \n• Work / life balance \n• The integration of people with disabilities: The openness to diversity, particularly disabled people who are enrolled in the human resources policy of the company, and bound by the actions of the disability team. 2012 L’OCCITANE now has over 2,000 stores all over the world! \n\nSource: This is an extract from the company's own website"},
{"employer_url": "https://www.seek.com.au/companies/local-government-association-of-the-nt-868141", "employer_name": "Local Government Association of the NT", "employer_info": "The Local Government Association of the Northern Territory (LGANT) was first incorporated in 1992 as the single peak body representing Local Government in the Northern Territory.\n\nLGANT is established as a body corporate by virtue of Section 242 of the Local Government Act of the Northern Territory. LGANT has a constitution , governance charter, strategic plan and annual budget which form the mainstay of its authority and operations.\n\nLGANT is managed by an Executive Committee made up of four members from municipal councils and four from shire Councils. Executive Committee meetings are held monthly. The Executive Committee has power under LGANT’s Constitution to make decisions in between general meetings of LGANT which are usually held in May and November of each year.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/locker-group-435517", "employer_name": "Locker Group", "employer_info": "Established in 1956 Locker Group has consistently grown, through product expansion, acquisition and merger and now has several manufacturing facilities and sales offices throughout Australia, New Zealand and Asia. Locker Group’s extensive product range services a broad market space.\n\nLocker Group services the architectural and construction industries with a range of expanded and perforated metal, wire mesh and curtains utilised in facades, balustrades, screening and interior applications.\n\nSource: This is an extract from the company's own website"},
{"employer_url": "https://www.seek.com.au/companies/localsearch-436203", "employer_name": "LocalSearch", "employer_info": "Over 2 million directories delivered FREE of charge throughout 34 regional areas of Queensland, New South Wales & Northern Territory. LocalSearch is a market leader in connecting buyers with sellers.\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/local-government-procurement-932157", "employer_name": "Local Government Procurement", "employer_info": "LGP provides fully integrated procurement services. These services include establishing contract panels, consulting, professional development and contract management.  Our customers include NSW councils, not for profit organisations, universities, state government agencies and departments.\n\nLGP is a business arm of Local Government NSW (LGNSW), the membership association for all councils in NSW. LGP is also a ‘prescribed entity’ under s55 of the Local Government Act 1993 (NSW) and the Local Government (General) Regulation 2005 (NSW). This means that councils do not need to go to tender for values greater than the tendering threshold (as they normally would be required to do) and may, instead, utilise supply arrangements coordinated by LGP.\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/logan-diggers-816762", "employer_name": "Logan Diggers", "employer_info": "Diggers Services Club employs up to one hundred (100) staff with fantastic opportunities throughout a wide cross section of hospitality including restaurant, café, kitchen, gaming, bottle shop, cellar, bingo, functions, reception and bar. We are an equal opportunity employer, where recruitment and promotion within the Club is based on merit.\nIt’s the Club’s policy and in the best interest of both the Club and new team members that staff are adequately trained and skilled in their areas of operation.  Diggers Services Club is therefore committed to ensure training is made available so your needs as well as the needs and expectations of the Club are met.\nWe will provide you with every opportunity to expand your hospitality knowledge and skills and encouraged you to be actively involved in seeking and suggesting ways in which we can provide better service and products to our members and guests.\nWe consider our staff to be the Club’s greatest assets. There are many venues who offer similar products, however it’s the quality of our staff that places the Diggers Services Club above our competitors.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/loan-gallery-800576", "employer_name": "Loan Gallery", "employer_info": "The process of buying your home can be confusing and intimidating. When buying 'Off-The-Plan' or a house and land package (where the home is being built) and you need to arrange draw-down payments from your loan as building progresses, it becomes even more difficult. Add: arranging inspections and valuations and applying for the first home owners grant - suddenly what should be a joyous, exciting time can all too often become one big strain!\nHere at Loan Gallery, We're Here to Help.\nTalk to us. Our long-term experience working directly hand-in-hand with builders and development companies over many years and many thousands of successful loans, has made this our speciality field. We care and we will be with you from the first cup of coffee right through to the day you move in and then beyond, helping you as your lifestyle changes and your loan requirements change with it.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/lmw-437841", "employer_name": "LMW", "employer_info": "\n\n\nLMW has a long and proud history as leaders in the provision of commercial and residential property valuations and we have over 250 people working throughout our offices across Australia. \n\n\nWe provide property valuation, research and property advice to homeowners, investors, developers and lenders.\n"},
{"employer_url": "https://www.seek.com.au/companies/lloyds-register-834832", "employer_name": "Lloyd's Register", "employer_info": "Lloyd's Register - improving safety, quality and performance \n\n\nLloyd’s Register (LR) is a global engineering, technical and business services organisation wholly owned by the Lloyd’s Register Foundation, a UK charity dedicated to research and education in science and engineering. Founded in 1760 as a marine classification society, LR now operates across many industry sectors, with over 9,000 employees based in 78 countries.\n\nWe have a long-standing reputation for integrity, impartiality and technical excellence. Our compliance, risk and technical consultancy services give clients confidence that their assets and businesses are safe, sustainable and dependable. Through our global technology centres and research network, we are at the forefront of understanding the application of new science and technology to future-proof our clients businesses.\nSource: this is an extract from the company’s own website."},
{"employer_url": "https://www.seek.com.au/companies/lloyds-banking-group-432667", "employer_name": "Lloyds Banking Group", "employer_info": "We are a financial services group with millions of UK customers with a presence in nearly every community; we are familiar on the high street and with over 1 million businesses through our portfolio of brands.\n\nOur business is focused on retail and commercial financial services. We thrive based on how well we serve our customers; on our relationships within the communities we serve; and on helping Britain prosper.\n\nThrough our branches and businesses, our Group has the potential to reach every family, business and community in the UK. We place immense value on our purpose, helping Britain prosper, driven by our desire to give back to the communities in which we operate.\n\nThrough our day-to-day business and through our community and charity work we believe that giving back to communities is not simply a measure of our success, but it is fundamental to what the Group stands for. \n\nSource: this is an extract from the company’s own website"},
{"employer_url": "https://www.seek.com.au/companies/lloyds-international-433573", "employer_name": "Lloyds International", "employer_info": "Lloyds Bank International Limited has registered the business names of Lloyds Bank, Lloyds Bank International, Lloyds Bank Premier Banking, Lloyds Bank Private Banking, Lloyds Bank Commercial Banking, and Lloyds Bank Offshore Internet Banking in Jersey and the Isle of Man. \nLiving, working or retiring in another country can be rewarding, but also comes with its own challenges. International banking can help you manage your finances in multiple countries and currencies. \nLloyds Bank international banking solutions are designed for people who need to deal with the complexity of international life including:\n\n\n\n\nWho is it for?\n-'Expats' moving abroad for work or retirement\n-People moving to the UK for a short or medium length of time, whether it’s for work or to invest in the UK\n-Investors who need to manage assets in multiple currencies and across several countries \nSource: This is an extract from the company's own website"},
{"employer_url": "https://www.seek.com.au/companies/ljm-marketing-804577", "employer_name": "LJM Marketing", "employer_info": "LJM was established in 1996 with a view to provide an outsourced co packing solution to the FMCG industry.\nLJM is now a substantial 3rd party co packer to a blue chip clientele list that includes many of Australia’s premier Manufacturers.\nLJM is located in Victoria and New South Wales with packing facilities of approximately 10,000 square metres with additional warehousing facilities in excess of 4,000 square metres.\nLJM 's accreditations include ISO, HACCP & AQIS.\n\nSource: This is an extract from the company’s own website."},
{"employer_url": "https://www.seek.com.au/companies/livingstone-christian-college-800570", "employer_name": "Livingstone Christian College", "employer_info": "Livingstone Christian College commenced in January 2002 to provide a distinctly Christian education for students in the northern Gold Coast suburbs. Located in Ormeau, Livingstone is a non-denominational College that offers a safe, caring community in which students are encouraged to achieve excellence in academic, sporting and cultural endeavours.\n\nLivingstone caters for all stages of schooling life, offering Childcare (for children from six weeks of age), a Pre-Prep year, a seamless education from Prep to Year 12, and vocational training opportunities through its Trade Training Centre. Vacation Care, Before and After-School Care are also provided onsite.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/livingsocial-436789", "employer_name": "LivingSocial", "employer_info": "LivingSocial is the local marketplace to buy and share the best things to do in your city and beyond. With unique and diverse offerings each day, we inspire members to discover everything from weekend excursions to one-of-a kind events and experiences to exclusive gourmet dinners to seasonal family outings and more. \nLivingSocial is a leading marketplace to buy and share the best things to do in your city – or wherever you may be.\n\n We provide a trusted, convenient source for finding value on everyday items and activities and identifying novel, enriching and fun experiences for you to enjoy and share with your friends.\n\n With thousands of unique and diverse offers every day, we inspire our members to discover everything from weekend excursions to international travel, from exclusive gourmet dinners to family outings and more. \n\n We help local and national businesses grow by introducing them to high-quality new customers. We deliver compelling and cost-effective marketing solutions for businesses large and small and provide our partners with the tools to make our members their regulars. \nSource: This is an extract from the company's own website"},
{"employer_url": "https://www.seek.com.au/companies/living-waters-lutheran-college-800565", "employer_name": "Living Waters Lutheran College", "employer_info": "Each Lutheran school belongs to a well organised system with a long and distinctive tradition and:\nis based on some solid understandings about people and life,\nprovides a caring environment,\nembraces high standards of teaching and learning,\npromotes Christian growth and development\nworks as a team with parents.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/livingstone-international-436245", "employer_name": "Livingstone International", "employer_info": "Livingstone is a wholly owned Australian business established in 1984. The company began as a sole proprietorship distributing a limited range of medical products and has grown into one of Australia's largest marketers, importers, exporters and distributors of medical, surgical, dental, laboratory, scientific, veterinary, beauty, first aid & safety and office supplies products.\n\nLivingstone provides value for money; a 'one stop shop' service to a customer base of over 50,000 customers located throughout Australia and overseas. Its customer profile includes dentists, doctors, vets, first-aiders, schools, universities, nursing homes, childcare centres, beauty salons, pharmacies, hospitals, pathologies, laboratories and industrial and government accounts.\n\nLivingstone International currently operates from 2 facilities in Sydney, totaling 16,800 square metres; Rosebery with 10,000 square metres and Turrella with 6,800 square metres. We also have an office in Melbourne. Currently, Livingstone International has in excess of 70,000 items in stock. Warehouse facilities in Rosebery and Turrella have the capacity to deliver in excess of 1000 orders per day. Livingstone also has warehouses in Victoria, South Australia and Western Australia, which speeds up delivery times.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/living-care-813648", "employer_name": "Living Care", "employer_info": "Living Care operates 7 Independent Living Retirement Villages, 9 Residential Care Services and 6 Home Care Services providing various combinations of aged care services in different locations throughout New South Wales.\n\nWe provide Home Care Services (Level 1, 2, 3 and 4 packages) in 5 locations providing support for consumers in their own homes through our Living Care Home Care Services, and operate a Day Respite Centre located in North Nowra for people with dementia.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/liverpool-catholic-club-437158", "employer_name": "Liverpool Catholic Club", "employer_info": "The LCC Events Complex (the Complex) is set on 46 acres of land adjacent to the Liverpool Catholic Club. The Complex is situated on the ground floor and has two separate grand entrances and foyers. The Complex has onsite parking reserved for over 500 cars with additional general parking for over 300 cars. \n\nThe LCC team has successfully fulfilled individuals' private function needs for over 10 years. In November 2001,  a major expansion of facilities was completed including the building of four major new function rooms, two new foyers and surrounding areas. The expansion has resulted in the creation of Western Sydney's premier function venue.\n\nThe Complex features technologically advanced facilities including new sound and lighting systems that are suitable for the most extravagant function and are certain to astonish both you and your guests.\n\nThe Complex has full catering and bar facilities and can cater for a formal banquet through to a small cocktail function. Our team of talented chefs can create an innovative menu choice to suit individual requirements and budgets. \n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/liverpool-plains-shire-council-804567", "employer_name": "Liverpool Plains Shire Council", "employer_info": "Liverpool Plains Shire is a vibrant, dynamic and economically strong rural area located four hours north of Sydney and 45 minutes south of the regional centre of Tamworth. The region has a rich agricultural history and picturesque beauty encompassing the foothills of the Great Dividing Range and the sweeping expanse of the fertile Liverpool Plains. The area offers the opportunity for a true rural lifestyle in a friendly atmosphere with excellent transport links.\n\nServing a population of around 8,000 residents, Liverpool Plains Shire Council has an annual budget of approximately $25m and a staff of 132. Council offers a range of benefits to employees including a 9 day fortnight, training and study assistance.\n\nPlease make sure you read the Job Application Guide and address the appropriate selection criteria before submitting your application. Please be aware all contact details can be found within the position descriptions.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/li-ve-tasmania-984015", "employer_name": "Li-Ve Tasmania", "employer_info": "The origin of Veranto is tied to the history of the then Retarded Children’s WelfareAssociation (RCWA). Established in 1952, the RCWA set up employment opportunities and accommodation for young people with intellectual disability during the 1950s and 60s.Yallambee Hostel was opened in 1956 to provide accommodation for out-of-town children attending special education in Hobart.\n\nIn 1970, after the RCWA bought land at Warrane, it founded Oakdale Lodge to provide\n\naccommodation for people working at the nearby sheltered workshop. When the RCWA wound up in 1992, a number of separate, independently managed not-for-profit organisations were created. Oakdale Lodge Yalambee was set up to manage Yallambee and the Lodge. This later became Oakdale Services Tasmania\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/littles-lawyers-804562", "employer_name": "Littles Lawyers", "employer_info": "We specialise in helping people achieve just outcomes,\non a ‘no win, no fee’ basis.\n\nTHE INCORPORATED LEGAL PRACTICE\n\nLittles Lawyers is the trading name of the Incorporated Legal Practice (ILP) Littles Lawyers Pty Ltd ACN 129117 255. Littles Lawyers was incorporated on 7 January 2008 and now operates across Australia.\n\nSource: This is an extract from the company’s own website."},
{"employer_url": "https://www.seek.com.au/companies/little-zaks-academy-815206", "employer_name": "Little Zak's Academy", "employer_info": "Early childhood is a significant period of our life during which the greatest brain development and growth occurs. It is a time when experiences influence attitudes, dispositions and learning. At Little Zak’s Academy our aim is to provide excellence in early childhood care and education in a safe, welcoming, adopting and nurturing environment.\n\nLittle Zak’s Academy is privately owned and family run, with a strong commitment to participative, consultative and collaborative management. Our philosophy has been developed in consultation with staff and families, and we welcome visits, ideas and suggestions.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/little-real-estate-609492", "employer_name": "LITTLE Real Estate", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/little-learning-school-814215", "employer_name": "Little Learning School", "employer_info": "Providing quality care since 2004, Little Learning School takes pride in the high quality of care and learning we offer. Our priority is to offer you and your child the best education and care in beautifully presented centres.\n\nSince opening our very first centre, we knew that we could make a difference to children’s lives through combining education and care. This is the reason that we offer several extra curriculum programs designed specifically for Little Learning School Children.\n\nOur exclusive Learn to Read programs are highly regarded in the industry as the very best early literacy program and have changed the lives of children as they prepare to begin school. The Ready to Read program will give your child the best possible start prior to school.\n\nSource: This is an extract from the company’s own website."},
{"employer_url": "https://www.seek.com.au/companies/loan-market-436295", "employer_name": "Loan Market", "employer_info": "We've been helping people into homes for two decades.\nFounded in 1995 by Sam White, Loan Market is a member of the White Family Group of Companies.\n\nThe business rapidly grew through the 90's and by 2001 the company's loan book reached $1 billion. In 2003, the Loan Market brand was launched and the company had over 200 brokers throughout Australia. By 2014 our brokers had secured over $47 billion of home loans for thousands of Australians. Today, Loan Market has cemented itself as one of the largest mortgage brokers in Australia.\n\nOver the past decade, Loan Market has expanded into New Zealand growing our network to over 1,000 brokers internationally.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/little-kickers-437305", "employer_name": "Little Kickers", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/litmus-group-437328", "employer_name": "Litmus Group", "employer_info": "Litmus Group is a division of PPB Advisory and a management consulting firm focussed on strategy execution to improve the enterprise value of its clients.\n\nPPB Advisory is a leading advisory firm that is focussed on helping organisations navigate critical and complex issues, improve their performance and realise their strategic goals.\n\nLitmus has access to international expertise through its global membership of Cordence Worldwide, an international partnership of locally focused consulting companies with common values. Through this partnership, we offer our clients the global knowledge and cross-industry experience from more than 2,600 consultants in 22 countries.\n\nCollectively we have a team of around 350 people across Australia and Singapore working with clients around the world. We:\n◾provide strategic, operational and financial advice\n◾optimise workforce asset and enterprise value\n◾manage enterprise risk\n◾lead major transactions involving changes of ownership or capital structures\n◾advise on complex business restructures and turnarounds\n◾undertake forensic investigations\n◾provide insolvency services to companies and individuals.\n\nFrom complex business problems involving multiple stakeholders to an individual’s business challenges, we’re trusted by our clients to deliver successful outcomes skilfully and sensitively. \nSource: This is an extract from the company's own website"},
{"employer_url": "https://www.seek.com.au/companies/lithgow-aged-care-800544", "employer_name": "Lithgow Aged Care", "employer_info": "Lithgow Aged Care Limited is a community owned and operated aged care provider.\n\nAs an aged care facility, Lithgow Aged Care Ltd's role is to provide for elderly residents who have found it difficult to remain in their home and require assistance with their daily care needs.\n\nLithgow Aged Care Ltd provides the support they need to live a comfortable, fulfilling life in the community they know and also for those relocating the region. The decision to move into aged care is sometimes not easy and Lithgow Aged Care Ltd is dedicated to developing a facility and environment that respects resident’s independence, dignity and individuality. \n\nOur Mission:\nWorking with residents and the community as partners in care.\n\nOur Vission:\nTo be a leading provider of quality aged care services.\n\nOur Guiding Principals:\n​Dignity, Comfort, Respect and Trust. \nSource: This is an extract from the company's own website"},
{"employer_url": "https://www.seek.com.au/companies/lite-n-easy-433888", "employer_name": "Lite n Easy", "employer_info": "Lite n' Easy delivers great tasting, healthy meals that make it easy to lose weight and manage your weight. It's also a convenient solution for time poor people who are too busy to shop or cook every day. \n\nWhatever your motivation, we're confident Lite n' Easy will work for you. To find out more about how Lite n' Easy works, simply click on any of the links to the right.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/litchfield-council-804552", "employer_name": "Litchfield Council", "employer_info": "With the increasing number of people residing in the Darwin rural area, and in pursuit of its long standing policy to enable local people to determine their local affairs, the Northern Territory Government recognised a need to examine options for a form of Local Government to be established there.\nAs a result of this initiative, the Darwin Rural Advisory Council was formed by the then Minister for Community Development, the Hon Ian Tuxworth MLA, in March 1983 to consider various options. This Council consisted of the following members:\nThe inaugural meeting was held on 17 March 1983 at the Freds Pass Community Hall. Following many meetings and widespread consultations, the final report was presented to the Hon Daryl Manzie MLA, Minister for Community Development, on 22 June 1984.\nFollowing widespread consultations with community groups and residents, Cabinet approved in principle on 24 May 1985, the establishment of Local Government in the outer Darwin rural area. A further Cabinet decision on 3 September 1985 approved the constitution of a new municipality to consist of four wards, with elections for one alderman from each ward, and a mayor from the whole of the Shire, to be held on 7 December 1985. (The Local Government Act was subsequently amended to permit the Council to alter the members' titles to president and councillors, with effect from 1 July 1986).\nSource: this is an extract from the company’s own website."},
{"employer_url": "https://www.seek.com.au/companies/liquid-rock-constructions-803932", "employer_name": "Liquid Rock Constructions", "employer_info": "High-quality concreting services  in Melbourne Metro  \n\n\n\n\n\nYour concrete needs are our speciality     \n\n\n\n\n\n\nMake sure that your next construction project is built to last. For superior concrete formwork services consult with the experts at Liquid Rock Constructions. No matter what the size of the job, Liquid Rock Constructions has the team and the equipment to do it right.\n\nWe work to budget and on schedule, every single time. Our quality workmanship, attention to detail, and strong work ethic guarantees a great result. We're customer focused and always strive to exceed expectations. If you want dependable concrete formwork, speak to one of the leaders in the industry. Liquid Rock Constructions provides concrete formwork for residential, commercial, and industrial clients throughout Melbourne and the greater metropolitan area. Contact us today for a detailed and highly competitive quote.\n\nComprehensive concreting services    \n\n\n\n\n\n\nFrom high-end residential jobs to large scale industrial work, Liquid Rock Constructions is the team you need for quality concrete work in Melbourne. If you need excavation, formwork, steel fixing, or concrete placing and finishing, call us today.\n\nWe'll make sure the job gets done right.\n\nOur team is skilled, efficient, and highly experienced in the concreting field. Ensure the success of your next building project. Contact Liquid Rock Constructions for a quote.\n\n\n\n\n\n\nCompany profile    \n\n\n\n\n\n\nFirst established in 2001, Liquid Rock Constructions has grown from working mainly in the residential sector to taking on larger industrial jobs as well as multi-storey developments. This sustained growth is due to the vision and drive of our directors.\n\nWith more than 50 years of combined experience, our directors have diversified the company and cemented our path to success. Liquid Rock Constructions consists of seven teams and eight trucks. We currently employ 60 personnel, including project managers, estimators and skilled tradesmen.\nSource: this is an extract from the company’s own website."},
{"employer_url": "https://www.seek.com.au/companies/liquorland-432444", "employer_name": "Liquorland", "employer_info": "Liquorland is one of Australia’s largest alcohol stores, stocking a wide range of local and imported wines, beers, ciders, Champagne, spirits and premixed drinks across more than 600 locations nationwide.\n\nOrder today 1300 300 640\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/little-grove-primary-school-871582", "employer_name": "Little Grove Primary School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/liquip-victoria-931801", "employer_name": "Liquip Victoria", "employer_info": "Welcome to Liquip Victoria –\nVictoria’s specialist Road Tanker equipment installer and distributor. We’re also an industry leader in the design and supply of bulk liquid storage, dispensing and transfer systems.\n \nLocated in Sunshine West, we are an authorised Liquip Equipment distributor and the states leading solution provider of Road Tanker equipment solutions including servicing, maintenance and repair. We also specialise in the design and construction (along with all the associated maintenance and repair) of fuel terminals, depots and commercial fuel installations, including permanent and temporary storage and dispensing systems.\n \nIf you have a requirement related to petrochemical transfer and storage solutions, please talk to us today\nand we'll assist you with the most efficient, cost-effective and safest method to achieve it.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/liquor-marketing-group-437807", "employer_name": "Liquor Marketing Group", "employer_info": "Welcome to\nLiquor Marketing Group\n\n\nEstablished in 1977, LMG is one of Australia’s leading alcohol marketing groups, proudly representing more than 1,400 independent operators in the off-premise market. \n\nLMG provides independent retailers with the negotiating power, consumer brand expertise, professionalism and support to compete successfully in the off-premise retail marketplace.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/liquid-learning-group-609488", "employer_name": "Liquid Learning Group", "employer_info": "Our purpose is to create fertile ground for new thinking about how organisations can \novercome the barriers to achieving peak performance. Built around a portfolio of \nunique events, we provide our clients with the knowledge, inspiration and leadership \nskills needed to excel in a changing environment.\n\nEstablished in 2004, Liquid Learning is a leading professional development provider\nwith an expanding international footprint. Currently active in over ten countries, \nwe research, produce and deliver an extensive range of conferences, exhibitions, \nworkshops and in-house training engagements. These events attract the participation \nof business leaders and professionals from many of the world’s leading brands. \n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/lions-eye-institute-816760", "employer_name": "Lions Eye Institute", "employer_info": "The Lions Eye Institute (LEI) is a not-for-profit centre of excellence that combines world class scientific research into the prevention of blindness with the highest level of eye care delivery.  It incorporates one of Australia’s largest ophthalmic practices, including a Day Surgery Unit and a Laser Vision Centre.  The LEI also houses the Lions Eye Bank, Lions Optics, Lions Outback Vision and the Lions Save-Sight Foundation WA.\n\nOur activities are underpinned by a continuous improvement program and worldwide collaborative research as we strive to achieve our Vision – To prevent and cure blindness and eye disease.\n\nOur Clinical Services are internationally recognized for providing high-quality care, a dedicated, passionate and professional team, continued investment in the latest equipment and technology, ongoing ISO 9001 accreditation and strong patient satisfaction ratings.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/liquefy-health-865475", "employer_name": "Liquefy Health", "employer_info": "At Liquefy…\n• We are innovators in health.\n• We strive to bring society the most innovative health products the earth has to offer.\n• We aim to provide accessible healthy alternatives to everyone.\n• We are passionate about improving the health consciousness and wellness of the world.\n• Ultimately, we are working to become to healthiest company on the planet."},
{"employer_url": "https://www.seek.com.au/companies/lipman-995242", "employer_name": "Lipman", "employer_info": "OUR FOCUS ON REGIONAL EXCELLENCE\n\nWe are passionate about delivering excellence in construction throughout regional New South Wales via our Port Macquarie, Bathurst and Lismore regional offices. Our Regional capability is founded upon senior staff who have lived and operated in these communities for a lifetime. It is these people who have built strong relationships with regional clients, subcontractors and suppliers.\n\n \n\nThe commitment of our people in these regions ensures that all Lipman commitments and goals are translated into our regional involvement, which can be relied upon by all those we come into contact with us in these districts. The communities in these regions can be assured that we are in for the long haul.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/lion-finance-434893", "employer_name": "Lion Finance", "employer_info": "We purchase delinquent credit facilities from credit providers through Lion Finance Pty Ltd, our dedicated purchased debt subsidiary. This often takes the form of purchasing “debt ledgers”, which are collections of outstanding debt accounts credit providers sell instead of continuing their efforts to recover the debt. We then assume the obligations and benefits of the original credit provider through managing the collection of these accounts.  \n\nYou are provided with a home loan comparison as part of our FREE Service\nYou are shown how much you can borrow and which loans are best suited for your individual situation\nYou will be dealing with one of QLD's leading mortgage broking firms, which has been providing solutions for Australian's for the past 6 years.\nYour loan managed by our experienced from application to settlement leaving you to focus on getting your new home just right\nYou have access to our financial planning service which provides you with a financial roadmap on how to achieve your financial goals and a wealth protection strategy so your home and family's lifestyle is protected should something unexpected happen.\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/lion-batteries-437996", "employer_name": "Lion Batteries", "employer_info": "Welcome to Lion Batteries\n\nLion Batteries offer a complete range of quality battery products for all automotive, marine, agriculture, motorcycle, deep cycle, traction, standby, solar and specialty purposes.\nWith Lion Batteries you can have confidence in using quality battery products with proven performance, supported by a technically competent and customer focused Australian owned family company.\n\nLion Automotive Batteries are available in 3 Calcium/Calcium ranges, Lion Black Conventional Low Maintenance, Lion Blue Economy Sealed Maintenance Free and Lion Red Premium Sealed Maintenance Free. A complete range of AGM and Gel batteries along with other speciality applications create an impressive product offer.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/lion-433344", "employer_name": "Lion", "employer_info": "\n\n"},
{"employer_url": "https://www.seek.com.au/companies/linville-state-school-819824", "employer_name": "Linville State School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/linley-valley-pork-931708", "employer_name": "Linley Valley Pork", "employer_info": "Linley Valley Pork is a premium product sourced from pigs raised in Western Australia. The pigs are fed on a nutritious diet of Western Australian grains such as barley, wheat and lupins which is specifically formulated to meet the pigs’ nutritional requirements. This in combination with the high standard of care our farmers provide ensures that the pork produced is of the highest standard and quality for our customers.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/linneys-jewellery-931713", "employer_name": "Linneys Jewellery", "employer_info": "To own a piece of Linneys jewellery is to write your own chapter in the rich history of this extraordinary Western Australian story.\n\nTo wear one of Linneys’ designs is to feel the passion and creative energy that has been at the heart of this iconic jeweller for more than four decades.\n\nLinneys is a jeweller without peer.\n\nIts history dates back to the early 1970s and a special partnership between two equally passionate men, Alan Linney and Bill Reed.\n\nA marine biologist by training, Bill had a vision to take Broome pearls to the world and Alan’s extraordinary, free-flowing designs and retail experience made this dream a reality.\n\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/link-group-435971?child=433719", "employer_name": "Link Market Services", "employer_info": "Link Group administers financial ownership data and drives user engagement, analysis and insight through technology. We deliver complete solutions for companies, large asset owners and trustees across the globe. Our commitment to market-leading client solutions is underpinned by our investment in people, processes and technology.\nSource: this is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/linkforce-engineering-433111", "employer_name": "Linkforce Engineering", "employer_info": "Linkforce Engineering's is specialists in maintenance services and capital works projects\nThey offer integrated engineering servicing capabilities are versatile, efficient and are designed to optimise productivity. With our own workforce, scaffold equipment, cranes, plant and logistics ? we can plan and deliver on any project, large or small.\n\nWe provide maintenance shutdown services; develop and expand upon infrastructure projects; deliver access scaffolding solutions; undertake fabrication and welding services; and supply modern and specialist crane and plant equipment to worksites throughout WA.\n\nOur professional servicing capabilities are delivered to the mining, construction and infrastructure sectors.\nSource: this is an extract from the company's own website"},
{"employer_url": "https://www.seek.com.au/companies/link-health-and-community-834389", "employer_name": "Link Health and Community", "employer_info": "In 2015 we changed our name to Link Health and Community to reflect the expansion of our service delivery and eliminate confusion with other Monash based services.  From 2000 to 2015 we were called MonashLink Community Health Service Limited . However we have a long and rich history stretching back to the formation of the Waverley and Chadstone services as separate community health services in the early 1970s.. \nVision\n\nHealthier people participating in their communities.\n\nMission\n\nTo provide integrated health and community services in Melbourne's east and southeast. \n\nValues\n\nWe care for our community and for the people who use our service.\n\nWe listen to people who need our services and we advocate for our community.\n\nWe provide accessible, innovative and high quality services and programs.\n\nWe partner with other organisations to ensure the development and delivery of better services.\nSource: this is an extract from the company’s own website."},
{"employer_url": "https://www.seek.com.au/companies/links-hope-island-golf-club-931692", "employer_name": "Links Hope Island Golf Club", "employer_info": "Links Hope Island is the ultimate setting for your corporate or social functions and events.\n\nGone are the days of sitting in a confined room with fluorescent lighting… shed some light on your next conference or event and treat your staff & clients. With views of the golf course and surrounding waterways Links Hope Island’s conference and event rooms provide an elegant yet functional setting for functions of all kinds and sizes. Featuring over 2,800 square metres in flexible space, we can serve groups of 2 to 200. Whether your event is for business or pleasure, you’ll appreciate our central location to both Brisbane and the Gold Coast, our great value, and our focus on exceptional service! Call us now to start discussing  your event. It will be everything you for hoped and more….\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/linfox-432404", "employer_name": "Linfox", "employer_info": "\n\n"},
{"employer_url": "https://www.seek.com.au/companies/lindisfarne-primary-school-871565", "employer_name": "Lindisfarne Primary School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/lindisfarne-anglican-grammar-school-800527", "employer_name": "Lindisfarne Anglican Grammar School", "employer_info": "Lindisfarne Anglican Grammar School has one overriding focus - helping our students excel in life. We achieve this through a balanced learning program that ensures students achieve their academic potential while accumulating important life skills.\n\nOur learning environment encourages and stimulates students and prepares them emotionally and academically for their adult years.\n\nThe idyllic setting for Lindisfarne is perfectly suited for this purpose. Overlooking the Terranora Broadwater in the semi-rural coastal hinterland of the Tweed Valley, the school has a deep sense of community.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/lindsay-transport-435939", "employer_name": "Lindsay Transport", "employer_info": "Lindsay Australia Limited is an ASX (Code: LAU) listed integrated transport, logistics, and rural supply company.\n\nThe Group’s major activities are road transport, logistics, and warehousing services as well as specialist services to rural suppliers, with an emphasis on the horticultural industry.\n\nOUR SUCCESS\nOur success is attributed to our long-standing commitment to continually improve our business practices and provide a superior level of customer service.\n\nWe are proud of our people and equipment. Lindsay Australia’s goal is to ensure that the best people are employed and given the right tools to succeed in their position and be an asset to the business.\n\nOur history and reputation is attributed to being an industry leader in areas of innovative technology solutions that provide both business and customer efficiencies and a safer work environment for our people.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/dulux-group-796894?child=434502", "employer_name": "Lincoln Sentry", "employer_info": "DuluxGroup is a manufacturer and marketer of products that protect, maintain and enhance the spaces and places in which we live and work.\n\nFrom household rooms transformed by the latest designer colours, to the ripe tomatoes in the garden, to the latest in garage door design and technology, to the industrial coatings that protect landmark infrastructure such as bridges and the construction chemicals that reinforce them; DuluxGroup products are at work. Our brands have been woven into the fabric of the communities where we operate, helping consumers to live better and more comfortable lives.\n\nDuluxGroup employs approximately 4,000 people in Australia, New Zealand, Papua New Guinea, South-East Asia and China.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/lincolnshire-arms-hotel-803894", "employer_name": "Lincolnshire Arms Hotel", "employer_info": "We’ve got options for groups of all sizes, from just a handful of close friends or if you want to invite the whole gang it’s possible for us to close the Linc Bar and reserve the area for your party exclusively. There’s usually no minimum spend and we can cater with finger food. Just ask us.\n \nThe Linc is the perfect venue for your next function. Whether it’s a corporate lunch, 18th or 60th Birthday, we have you covered.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/lincoln-electric-436787", "employer_name": "Lincoln Electric", "employer_info": "OUR COMPANY\nLincoln Electric’s commitment to providing the most innovative, cost-effective, quality welding and cutting solutions is one that has guided our company for more than 100 years. This, coupled with our technological leadership and worldwide manufacturing and distribution resources, enables us to provide competent and reliable solutions for each of our customers. \n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/lincoln-college-800526", "employer_name": "Lincoln College", "employer_info": "Choosing a place to live whilst studying is an important decision. Your accommodation option can impact on the quality of your university experience, even on your life path.\n\nWhat-ever your background, Lincoln College will give you the best start during this important stage whilst you transition to full independence and a professional career. Everything is taken care of for you so that you can focus on settling into university life in Adelaide.\n\nLincoln is a dynamic learning community where you can express yourself in the way that feels right for you. We are a multicultural college where differences are celebrated and diversity is valued.\n\nYour wellbeing is at the heart of everything we do. Our aim is to see you achieve your academic goals, and that you have a lot of fun in the process! Our leading academic program and pastoral care network will ensure you get the right academic and personal support you need. We also have a packed calendar of sporting and social events to keep you smiling. You can also pursue your creative side with our art and music facilities and activities.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/linc-tasmania-796048", "employer_name": "LINC Tasmania", "employer_info": "We connect Tasmanians to learning and information, their history and their communities. We also connect people from around the world to Tasmanian resources.  \n\nAround the state and online\nBorrow l​ibrary items\nFind information and research\nImprove reading, writing and maths skills\nDiscover fun activities for the kids\nLearn how to use a computer\nJoin a short course and learn something new\nResearch family history\nAccess Tasmanian archival and heritage material\nVolunteer\nUse our friendly social spaces​\n\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/link-group-435971", "employer_name": "Link Group", "employer_info": "Link Group administers financial ownership data and drives user engagement, analysis and insight through technology. We deliver complete solutions for companies, large asset owners and trustees across the globe. Our commitment to market-leading client solutions is underpinned by our investment in people, processes and technology.\nSource: this is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/lincraft-432772", "employer_name": "Lincraft", "employer_info": "Lincraft has always been led by skilled retailers with a vision that has allowed the company to diversify and grow, with over 70 stores in Australia and New Zealand and exciting plans to open even more!\n\nOwners John Maguire and Brian Swersky established Lincraft Australia in 2005, with the retail chain specialising in craft, fabric, yarn, haberdashery, window furnishings, manchester and fashion accessories. The business prides itself on valuing the ever changing and evolving world of craft, sending our most passionate buyers to the ends of the earth to the world’s major craft, yarn and fabric fairs, with strict instructions to source the latest in fashion and creative ideas, and return with fresh inspiration for our customers.\n\nAt Lincraft, our aim is to inspire – and we know that nothing is more rewarding than creating something with your own hands. Once the love of craft starts, it can be difficult to stop! That’s the inspiration behind Lincraft’s “How To Make” series – bags to bolero’s, slippers to hoodies, patchwork quilts to Christmas scrapbooks - an entire library of free projects that are easy to do, hard to resist and available in store or online.\n\nLike any craft, we've perfected ours by giving our valued shoppers the largest range of quality products at the best price. The Lincraft Price Guarantee promises that if you find a cheaper price on a stocked item - we will beat that price by 15%.*\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/linc-energy-437000", "employer_name": "Linc Energy", "employer_info": "Linc Energy is an oil and gas company with a world-class commodity portfolio that includes oil, gas and coal resources. The Company applies conventional production techniques and its own advanced technologies to extract value from the development of these resources. "},
{"employer_url": "https://www.seek.com.au/companies/lin-andrews-real-estate-800523", "employer_name": "Lin Andrews Real Estate", "employer_info": "Lin Andrews, Founder and Group Chairman, shares……\n\n“Our Group history goes back to 1969 when my wife (Bunty) and I sat one Saturday night free from socialising. We paused to consider our privileges….\n\nOur questions… “How can our lives make a difference?” That night we resolved to do something very bold!\n\nAt the time of these decisions, South Australia was implementing its Development Act 1967 – 1972 and talking a lot about tourism.\n\nWe built holiday flats at West Beach and then at Grange. These were followed by an office building, a warehouse and several homes.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/lindisfarne-north-primary-school-871564", "employer_name": "Lindisfarne North Primary School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/linde-material-handling-436873", "employer_name": "Linde Material Handling", "employer_info": "Productivity\nLinde’s unique, long service intervals reduce operating costs and Linde forklifts have been shown to consume up to 30 per cent less fuel than competitor models engaged in the same tasks.\n\nValue\nEvery Linde forklift is engineered to deliver exceptional economy over a very long working life, because we understand reliability, durability, fuel and operator efficiency play a key role.\n\nOne-stop shop\nWhen it comes to solutions the best one we can offer you is also the easiest and most practical. That’s because Linde truly is a one-stop shop for all your material handling equipment requirements.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/lilydale-district-school-871552", "employer_name": "Lilydale District School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/lillywhite-hotel-group-438267", "employer_name": "Lillywhite Hotel Group", "employer_info": "The Lillywhite Hotel Group (LHGroup) is privately owned and operated by Reg & Ann Lillywhite.\n\nThe Group consists of Seven Hotels including The Bohle Barn, The Graham Hotel, The Durack Tavern, Sovereign Tavern, The Stuart Hotel, The Riverview Tavern and Bushland Beach Tavern, as well as thirteen detached bottleshops all run under the Cellarbrations buying group.\n\nOur Hotels are located in North Queensland region with Hotels in Townsville, Charters Towers and Mareeba as well as in Brisbane.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/ligeti-partners-834635", "employer_name": "Ligeti Partners", "employer_info": "Ligeti Partners are a specialist insurance and commercial dispute resolution practice providing legal services to insurers, self-insureds, public companies and Local Government. Established in 1980, the firm is the largest specialist practice handling motor vehicle insurance and property damage claims and recoveries nationally. We offer a “whole of country” service, through our offices in various States and extensive network of Agents. \n\nWe base our business on honesty, teamwork, clear communication and commitment to our people and our clients. We provide accurate and pragmatic advice, personalised service and prompt resolution of disputes. We also give generously to the community in which we work. \n\nAt Ligeti Partners, we work as a team with our clients to deliver on their commercial objectives and enhance their reputation. Our firm has a history of building and maintaining long term client relationships. A number of our clients have been with us since the firm was established and there are several who have trusted us with their insurance claims and commercial litigation matters for 10 and 20 years.  \nSource: this is an extract from the company’s own website."},
{"employer_url": "https://www.seek.com.au/companies/lifeview-834538", "employer_name": "Lifeview", "employer_info": "Lifeview is an award winning aged care provider offering lifestyle choices in a supportive, homely, residential environment. Residents enjoy peace of mind and live well through exceptional care, entertainment and dining experiences.\n\nOur Philosophy\n\nYour loved one deserves the best in life. It's our privilege to help them to live the possibilities.\n\nAt Lifeview Our View: To be an example of excellence by providing exceptional, inclusive service, whilst creating treasured moments.\n\nLifeview homes are designed to help people live active lives with plenty of social activities and community involvement. This, coupled with our exceptional care and warm, welcoming environment, is what Lifeview is all about.\n\nOur dynamic leadership team, led by Chief Executive Officer, Madeline Gall, is committed to providing a level of service that’s a world away from the traditional nursing home model.\n\nOur 4 core L.I.F.E Principles: Laugh, Integrity, Focus, Engage, support our philosophy and guide everything we do from the way we manage staff and services to how we communicate and interact with the residents.\n\nLiving at Lifeview\n\nOur homes have been in operation since the 1990s and September 2011 saw the birth of Lifeview Residential Care where all homes now operate under the same umbrella. We are Australian owned and operated and we offer both permanent and respite care.\n\nLifeview homes are located from the sea to the hills in Melbourne's south eastern suburbs at Chelsea, Emerald, Cranbourne and Wheelers Hill.\n\nOur welcoming homes have an intimate feel and residents enjoy an active social calendar, excellence in hospitality and the very best standard of care.\n\nAll Lifeview residences offer single rooms with en suite.\n\nLifeview is Rainbow Tick accredited.\n\nOur View: To be an example of excellence by providing exceptional, inclusive service, whilst creating treasured moments.\nSource: this is an extract from the company’s own website."},
{"employer_url": "https://www.seek.com.au/companies/liftform-931308", "employer_name": "Liftform", "employer_info": "Liftform is a privately owned formwork and precast services company that started in 2010 and has built up a reputation as a leader in the building and construction industry from concept and design right through to construction. With over 50 years combined experience managing formwork and precast erection projects no project is too big or too complex.\n\nWorking closely with our clients we deliver projects on time and to the highest standards which has enabled us to establish long term relationships with them.\n\nLiftform believes a key component to building great structures is building great talent within the organisation. Our ability to bring the highest value to our customers begins by providing our supervisors and employees with the right balance of education, learning experiences and tools.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/lifestyle-solutions-433241", "employer_name": "Lifestyle Solutions", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/lifestart-cooperative-813426", "employer_name": "Lifestart Cooperative", "employer_info": "Lifestart, a not for profit organisation and registered charity, provides early intervention and school age years inclusion support programs and supports to children and young people 0 - 24 years living with disability or developmental delay. Lifestart uses a family/person centred approach to meeting the priorities and needs of children and young people, their families and carers. It is based on the concept of partnership with children and young people, their families and carers, to assist and empower them to participate meaningfully and inclusively in our community.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/lifeline-432764", "employer_name": "Lifeline", "employer_info": "We are a responsive and accessible community-based organisation engaging with individuals, families and communities to develop their skills and resilience to facilitate positive change. This is expanded more in our Social Justice Charter. \n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/lifehealthcare-834368", "employer_name": "LifeHealthcare", "employer_info": "One of Australia’s leading independent medical device distributors. Our strength lies in offering the scale of a multinational without being constrained by a single foreign parent company.\nAt LifeHealthcare we bring Australian and New Zealand healthcare professionals innovative medical devices by partnering with world class companies who share our vision for innovation and making a real difference to people’s lives.   Together with our partners all over the world, our people work closely with healthcare professionals to ensure the highest standards of patient care.\n\nLifeHealthcare was formed in 2006 with the vision to create a leading Australian and New Zealand Medical Device company that is capable of delivering the best technologies through…\nAt LifeHealthcare we’re so much more than a medical device company, every day we work together to improve patient outcomes, offering unique solutions to complex problems.\n\nOur size means we’re agile, able to push the boundaries and we don’t back away from a challenge. We know that when it comes to patient outcomes, it’s our job to perform.\n\nOur team of dedicated employees work together with commitment to get the job done, having fun along the way.\nWe’re a growing organisation, which means things are changing all the time and we’re always looking for driven and motivated team members who bring solutions, not just problems.\n\nOur people have a “can do” attitude and embrace change and growth, challenging the status quo, you’ll find we are always looking for that next exciting idea that gets results.\nBy joining LifeHealthcare, you’ll be participating in an organisation that is growing, in an expanding industry, which means plenty of opportunities for you to explore.\nSource: this is an extract from the company’s own website."},
{"employer_url": "https://www.seek.com.au/companies/lifecare-437232", "employer_name": "LifeCare", "employer_info": "The origins of LifeCare began in 1985. The LifeCare name came from a highly successful network of practices in Perth. Around the same time Sports Medicine Centres of Victoria developed a number of large multi-disciplinary sports medicine practices based on successful practices at Prahran and Ashwood.\n\nIn 2000 LifeCare and Sports Medicine Centres of Victoria merged to become the largest network of physiotherapy and allied health private practices in Australia at that time.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/lifeflight-australia-834333", "employer_name": "LifeFlight Australia", "employer_info": "LifeFlight is a world leader in aeromedical care and Australia's most diversified service with both a fixed and rotary wing fleet. \n\nWe help seriously ill and injured patients around Australia and the world to quickly get the medical care they need.\n\nFrom rapid response, to inter-facility transfers our team of more than 400 staff members, including aviation crew, support staff, and over 100 doctors are a lifeline to vulnerable individuals.   \nAs a leading Australian charity we operate 13 rescue helicopters and three air ambulance jets across 12 locations. Eight of these are LifeFlight’s own aeromedical bases. We supply doctors and nurses to all Queensland-based rescue helicopters, the iconic Royal Flying Doctors aircraft as well as road ambulance services. \n\nOur staff are specially trained in pre-hospital retrieval medicine through our internationally recognised training academy. \nSource: this is an extract from the company’s own website."},
{"employer_url": "https://www.seek.com.au/companies/life-without-barriers-432541", "employer_name": "Life Without Barriers", "employer_info": "\n\n"},
{"employer_url": "https://www.seek.com.au/companies/liebherr-436244", "employer_name": "Liebherr", "employer_info": "Liebherr-Australia Pty. Ltd. was first incorporated as a company in 1981 and shortly after this time the new head office complex in Adelaide (South Australia) was built. Since then the company has expanded considerably with offices throughout the country. Today Liebherr-Australia Pty. Ltd. sells and supports a range of Liebherr products in Australia and New Zealand including mobile and crawler cranes, offshore cranes, deep foundation machines as well as earthmoving and mining equipment. \nIn addition to the sales and services offered, the Adelaide, Perth, Mackay and Mt Thorley sites are home to bucket manufacturing and bucket repair facilities.The company also operates a national distribution centre and a remanufacturing centre. Both are established to provide industry best practise standards of remanufactured components and parts for our customer’s fleets.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/life-technologies-435787", "employer_name": "Life Technologies", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/life-education-800501", "employer_name": "Life Education", "employer_info": "Life Education exists to empower children and young people to make safer and healthier choices through education.\nLife Education has been empowering children and young people to make safer and healthier choices through education for more than 35 years. We believe that each child should be living to their full potential. To meet this vision we design programs that are relevant to Australian children and young people every day, as well as their families and communities. We are now the largest non-government provider of drug and health education, operating in all States and Territories.\nSource: this is an extract from the company’s own website"},
{"employer_url": "https://www.seek.com.au/companies/liberty-financial-435859", "employer_name": "Liberty Financial", "employer_info": "Today, we provide a wide range of loans for your home, your car and business, as well as investments and products from other financial institutions. We and our staff have been recognised with numerous industry awards and accolades. In short, we are an alternative that offers innovative solutions at competitive prices to support customers with greater choice and freedom.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/liamsans-security-solutions-803861", "employer_name": "Liamsans Security Solutions", "employer_info": "What We Are About?\n\nLiamsans is a family owned business fostering strong family values and a commitment to providing high quality services to our clients. We are resposive and flexible to the changing needs of our clients and the environments we work in. Our aim is to have a strong ethical working relationship and clear communication with our clients.\n\nOur Staff\n\nOur staff are carefully chosen and are of the highest calibre having SA Police clearances and SA Security Licenses. Staff are highly skilled and supplied with easily recognizable uniforms, ID Badges on view at all times and drive current model vehicles badged with Liamsans logo and colours.\n\nWe have grown and expanded our business by developing a culture that recognizes and rewards innovative and resourceful people who have a commitment to embrace solutions of excellence.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/liaise-marketing-437570", "employer_name": "Liaise Marketing", "employer_info": "Liaise Marketing, established in 1998 have proven themselves to be a reputable and honest Merchandise/Brokerage company.  Their success within the retail sector encompassing grocery stores, discount department stores, Chemist Warehouse and Priceline can be attributed to their specific mandate to \"Drive Sales\" and \"Build Brands\".\n \nA devotion to caring for their employees has meant a comparatively low employee turnover rate and many long term employees.  This stable base of experienced team members results in quicker and more accurate execution.\n \nTheir in-house developed reporting methods and performance measuring techniques are an industry benchmark. \n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/linkcare-australia-931654", "employer_name": "Linkcare Australia", "employer_info": "The principal directors, Michael Thorbecke and Peter Keil founded Linkcare Australia in 1995. Adina Friede — specialising in Aged Care Placement Services — joined Linkcare in 2007.\nInitially the organisation specialised in providing social work and discharge planning services to hospitals and welfare provider agencies, such as local government. Over the years we have expanded the service to encompass nursing homes and their need for social work, as well as a counselling service. We also assist individuals to navigate their way through the aged care system, including residential placements.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/life-letters-931176", "employer_name": "Life Letters", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/lg-electronics-433204", "employer_name": "LG Electronics", "employer_info": "LG's innovative technologies, unique products, and cutting-edge designs are an investment in the future.\nWith 2014 global sales of USD 55.91 billion (KRW 59.04 trillion), LG comprises four business units - Home Entertainment, Mobile Communications, Home Appliance & Air Solution, and Vehicle Components - and is one of the world's leading producers of flat panel TVs, mobile devices, air conditioners, washing machines and refrigerators. LG Electronics is a 2014 ENERGY STAR Partner of the Year.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/lhd-lawyers-803860", "employer_name": "LHD Lawyers", "employer_info": "Experts in personal injury, compensation, litigation and commercial law.\nLHD Lawyers is a leading Australian law firm providing quality legal services to individuals, businesses and communities for over twenty-five years.\n\nThe firm has helped thousands of Australians to settle compensation claims as a result of motor accidents, workers compensation, negligence and public liability issues. It also has a strong track record in running complex and high profile class actions and supporting businesses in settling complex commercial disputes.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/lexus-815155", "employer_name": "Lexus", "employer_info": "THE LEXUS STORY BEGAN WITH A SINGULAR VISION TO CREATE THE FINEST CARS EVER BUILT. FROM THE MOMENT THE FIRST LEXUS, THE LS 400, WAS OFFICIALLY UNVEILED IN 1989, OUR UNCOMPROMISING PURSUIT OF QUALITY AND CRAFTSMANSHIP AND INDUSTRY-LEADING CUSTOMER SERVICE HAS PLACED LEXUS AT THE FOREFRONT OF PROGRESSIVE LUXURY. DISCOVER MORE ABOUT WHAT MAKES LEXUS SO UNIQUE.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/leyburn-state-school-820416", "employer_name": "Leyburn State School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/lexmark-international-435183", "employer_name": "Lexmark International", "employer_info": "Since 1991, Lexmark has been a recognised and lauded leader in imaging and output solutions that help people and organisations improve process and reduce their costs.  Lexmark’s award winning imaging and output technology has continued to evolve as the world becomes more digital and connected. \n\nLexmark sells its products and services in more than 170 countries, and is a recognised global leader by many of the technology industry’s leading market analyst firms.  Lexmark has also acquired and integrated several strategic software companies since 2010, further expanding the company’s breadth of offerings to include innovative software solutions.  \n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/lexisnexis-433552", "employer_name": "LexisNexis", "employer_info": "\n\n"},
{"employer_url": "https://www.seek.com.au/companies/levi-strauss-813557", "employer_name": "Levi Strauss", "employer_info": "But it takes more than our strong, enduring brands — which also include Signature by Levi Strauss & Co.™ and Denizen® — to succeed. It takes people to bring our product to life every day. I see these talented and creative folks at our headquarters in San Francisco and in our offices around the world. They’re proud to be here, working for a company that has long been a leader — not just in what we do, but how we do it.\n\nBut it takes more than our strong, enduring brands — which also include Signature by Levi Strauss & Co.™ and Denizen® — to succeed. It takes people to bring our product to life every day. I see these talented and creative folks at our headquarters in San Francisco and in our offices around the world. They’re proud to be here, working for a company that has long been a leader — not just in what we do, but how we do it.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/leura-smilemakers-930964", "employer_name": "Leura Smilemakers", "employer_info": "Smilemakers is an aspirational practice with a strong service ethic. We believe our patients want and deserve the best treatment that can be provided and we provide this treatment in a sincere and caring environment as painlessly as possible. We respect our patients as people and respect the gift of the time and money that they are investing in pursuit of their dental well-being.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/levantine-hill-930972", "employer_name": "Levantine Hill", "employer_info": "A magnificent vineyard estate in the Yarra Valley, taking its name from the Levant, the blessed, ancient biblical lands.\nThe Estate\n\nLevantine Hill is the perfect merger of two vineyards right in the heart of the Yarra Valley. On the one side, a vineyard producing superior grapes since the 1990s; on the other, lovingly planted family blocks right alongside a Truffiére surrounding our Homestead. Together, this combined estate is pure testament to the passion and toil of dedicated human hands and man’s tenuous relationship with the nurturing love of Mother Nature.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/leukaemia-foundation-814229", "employer_name": "Leukaemia Foundation", "employer_info": "The Leukaemia Foundation is Australia's peak body for blood cancer, funding research and providing free services to support people with leukaemia, lymphoma, myeloma and related blood disorders, and their families.\n\nWe have an unwavering focus on reducing the impact of blood cancer and related blood disorders by providing free practical and emotional support, and funding research to improve treatments and find cures. Our work also includes raising awareness of the impact within the community, advocacy, and contributing to the international blood cancer sector to improve quality of life for the person and their family.\n\nWe receive no ongoing government funding and we rely on the generous support of the community to fund our Vision to Cure and Mission to Care.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/lesmurdie-senior-high-school-871535", "employer_name": "Lesmurdie Senior High School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/leos-fine-food-and-wine-436872", "employer_name": "Leo's Fine Food and Wine", "employer_info": "In 1971 Le Rose Nominees Pty. Ltd. opened its first supermarket in Seaford, Victoria. Since that date, the Directors, Leo and Rose Blake, have purchased and on sold many stores culminating today into two formats.\n\nLeo's Fine Food & Wine concentrates on gourmet and creative style foods, whilst also fulfilling the basic supermarket requirements. The future location of these sites will be in the inner suburban areas.\n\nThe Maxi Foods brand places an emphasis on product and price, marketing the brand mainly through handbill distribution in the outer suburban areas of Melbourne.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/lesmurdie-primary-school-871534", "employer_name": "Lesmurdie Primary School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/leonora-hospital-871530", "employer_name": "Leonora Hospital", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/lifestyle-fitness-437679", "employer_name": "Lifestyle Fitness", "employer_info": "WHY CHOOSE KO LIFESTYLE & FITNESS?\nWe are the most versatile and family friendly fitness studio in the eastern suburbs. We are famous for our unique personalized touch, that is having unbelievable weight loss and strength gains results for men and women. At our centre not only do we offer value and variety but we guarantee you workout with a trainer supporting you all the way. And the best part is every session is different! Our trainers have over 15 years experience and are driven on customer results!\n\nOur passion and commitment is to support you all the way on your journey to a healthier lifestyle. KO‚ Personal Training's unique approach provides a complete range of services that deliver proven results.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/leonda-by-the-yarra-930852", "employer_name": "Leonda By The Yarra", "employer_info": "Where your dream day will come true\n\nCreate the most memorable day of your life within the surrounds of the willows on the banks of the Yarra River, where the culmination of riverside surrounding, restaurant-style cuisine and exceptional service will ensure all aspects of your special day are perfectly realised in one of Melbourne’s leading elegant wedding reception venues – Leonda By The Yarra.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/leonora-community-health-service-871528", "employer_name": "Leonora Community Health Service", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/leonora-district-high-school-871529", "employer_name": "Leonora District High School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/leonards-advertising-930847", "employer_name": "Leonards Advertising", "employer_info": "Australia’s oldest accredited media agency (circa 1926). It was the ideas business back then, it still is today. Leonards have maintained a philosophy that all communications, marketing strategies or content must revolve around your brand, your message, your objectives.\n\nRelationship building with our clients goes beyond fulfilling a brief. Leonards will strive for a partnership, the key to achieving results that ensure efficient and rewarding outcomes. For over a decade now Leonards has demonstrated this as a preferred supplier to Local Government.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/leo-pharma-437410", "employer_name": "Leo Pharma", "employer_info": "LEO Pharma has its own sales teams in 61 countries and employs around 4,800 people worldwide. The company is headquartered in Denmark and is wholly owned by the LEO Foundation.\n\nGlobally LEO Pharma develops, manufactures and markets pharmaceutical drugs for dermatologic and thrombotic patients in more than 100 countries. To realise our vision of becoming the preferred dermatology care partner improving people’s lives around the world, we are expanding into new regions and markets, reaching more patients and societies with drugs and therapies that address unmet medical needs.  \nBy uniting globally under a shared vision and mission, we can develop and adapt to an ever-changing environment – while remaining true to our core beliefs and business strategy.  \nOur mission\n\nWe help people achieve healthy skin.\n  \n\nOur vision\n\nWe are the preferred dermatology care partner improving people’s lives around the world.\nThe LEO Foundation was created in 1984 and assumed full ownership of LEO Pharma two years later. The LEO Foundation is an independent, private institution whose aim is to ensure the continuance of the LEO Pharma group of companies.\n\nThis makes LEO Pharma a stable place to work and provides the stability needed to plan focused, long-term research and development programmes for medicines and therapies addressing unmet patient needs. Foundation ownership also allows LEO Pharma to make fast decisions.\n\nThe Board of Trustees of the LEO Foundation are committed to the long-term success of LEO Pharma\nSource: this is an extract from the company’s own website."},
{"employer_url": "https://www.seek.com.au/companies/lenovo-433905", "employer_name": "Lenovo", "employer_info": "\n\n"},
{"employer_url": "https://www.seek.com.au/companies/lendlease-432357", "employer_name": "Lendlease", "employer_info": "Headquartered in Sydney, Australia, Lendlease has approximately 12,000 employees internationally. Our regional head offices are located in New York, Singapore and London. \n\nEvery day, people around the world live, work, shop, play or travel via an asset created by Lendlease. We build cities from scratch, including the infrastructure to connect people, with skills to design, develop, fund, build and manage the places we create. Creating places that galvanise communities and infrastructure that supports and connects people is what we do. We’re shaping city skylines, creating iconic structures, breathing new life into forgotten precincts and creating places and spaces for generations to enjoy."},
{"employer_url": "https://www.seek.com.au/companies/lenards-432943", "employer_name": "Lenards", "employer_info": "Lenard's Chicken is Australia's favourite chicken shop. Available at over 300 locations throughout the country, our unique concept of value-adding ingredients and flavours to fresh chicken has established us as a leader in the fresh food marketplace.\n\nThis year we have embarked on an exciting new chapter in our 30 year journey. Along with a massive reinvigoration and overhaul of the store design, comes the introduction of a long awaited speciality range of hot products, lead by our amazing infused Roast Chicken. This is sure to tantalise your taste buds for another 30 years!\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/leona-edmiston-436546", "employer_name": "Leona Edmiston", "employer_info": "Leona Edmiston is the unquestionable doyenne of Australian Fashion design. With 30 years of her effortless style, glamour and sophistication gracing the catwalks, workplace, red carpets and landmarks of the World, Leona’s signature style continues to dazzle.\n\nNo women’s wardrobe is complete without a Leona Edmiston ‘Frock’, statement heels, bag or pins - as Elle Macpherson, Dannii Minogue, Jennifer Hawkins and Susan Sarandon (just a few of the loyal fans) will attest.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/lenah-valley-primary-school-871522", "employer_name": "Lenah Valley Primary School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/lennock-motors-930807", "employer_name": "Lennock Motors", "employer_info": "The friendly staff at Lennock Motors have been selling and servicing new and used vehicles in Canberra and the surrounding region. Our modern showroom and large display areas allow customers to casually browse the great range of Nissan Vehicles. Our friendly staff are specialists who are proud of their association with Nissan, and look forward to assisting you when searching for your new or used Passenger and Commercial vehicles.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/lennox-head-pharmacy-800484", "employer_name": "Lennox Head Pharmacy", "employer_info": "Rob Blackburn – B.Pharm. MPS\nRob studied at The University of Queensland and then worked in England for 3 years gaining experience in hospital and community pharmacy before moving to Lennox Head.\n\nHe has lived in Lennox Head for over 20 years.\n\nPaul Gilbert – B.Pharm. MPS\nI was born in South Africa, to a South African pharmacist father, and an Aussie mother. Mum hailed from Grafton. I moved to Australia in 1991, and have worked in most of the states. I finally landed in Ballina in 1998, and moved to join Rob in the Lennox Head Pharmacy in January 2014. I believe that a small personal pharmacy DOES make a difference to people’s health, and I look forward to the many challenges, and obviously getting into the local community.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/leinster-community-school-871519", "employer_name": "Leinster Community School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/leinster-community-health-service-871518", "employer_name": "Leinster Community Health Service", "employer_info": "Julia Creek Hospital transitioned to the McKinlay Shire Multi Purpose Health Service in 2012. The service is a Level 2 service as categorised by the Clinical Services Capability Framework.\nMcKinlay has a flexible bed capability with 10 beds for general medical and surgical, and simple paediatric admissions. There are also two residential aged care beds with capability of expanding to seven beds if required, as well as one palliative care bed.\nIn 2014, McKinlay received funding to upgrade the kitchen with modern facilities to better support the nutritional requirements of patients.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/leichhardt-state-school-819729", "employer_name": "Leichhardt State School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/leigh-creek-outback-resort-930696", "employer_name": "Leigh Creek Outback Resort", "employer_info": "The township of Leigh Creek is located 567km North of Adelaide, approximately a 6 hour drive from the CBD. Situated on the edge of the Northern Flinders Ranges, Leigh Creek is the perfect destination for visitors seeking a variety of activities and experiences!\n\nIt has been developed as a new township because the original settlement at Leigh Creek, located 13 km north of the present site, happened to be under the coal seam. In 1977 the new town site was chosen and by 1980 the first houses were occupied. The entire old town was auctioned off. Such is the economic imperative which drives this community.\n\n It is a modern township with a series of neat modern roads and small, attractive plots of land on which standard modern houses had been built to house the workers and their families who previously provided the labour force for the huge Leigh Creek open cut coal mine which exists 22 km north of the town.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/leica-geosystems-436384", "employer_name": "Leica Geosystems", "employer_info": "Leica Geosystems – when it has to be right \nRevolutionising the world of measurement and survey for nearly 200 years, Leica Geosystems creates complete solutions for professionals across the planet. Known for premium products and innovative solution development, professionals in a diverse mix of industries, such as aerospace and defence, safety and security, construction, and manufacturing, trust Leica Geosystems for all their geospatial needs. With precise and accurate instruments, sophisticated software, and trusted services, Leica Geosystems delivers value every day to those shaping the future of our world.\n\nLeica Geosystems is part of Hexagon, a leading global provider of information technologies that drive productivity and quality across geospatial and industrial enterprise applications. Hexagon’s solutions integrate sensors, software, domain knowledge and customer workflows into intelligent information ecosystems that deliver actionable information. They are used in a broad range of vital industries. \n\nHexagon (Nasdaq Stockholm: HEXA B) has more than 16,000 employees in 46 countries and net sales of approximately 3.0bn EUR. Learn more at hexagon.com and follow us @HexagonAB\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/leica-microsystems-874701", "employer_name": "Leica Microsystems", "employer_info": "Leica Microsystems\n\nLeica Microsystems develops and manufactures microscopes and scientific instruments for the analysis of microstructures and nanostructures. Widely recognized for optical precision and innovative technology, the company is one of the market leaders in compound and stereo microscopy, digital microscopy, confocal laser scanning and super-resolution microscopy with related imaging systems, electron microscopy sample preparation, and surgical microscopy.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/leica-biosystems-813728", "employer_name": "Leica Biosystems", "employer_info": "As a recognized market leader of histopathology solutions, Leica is committed to attracting and retaining highly qualified top performers who want to work with an innovative company to make a real difference in supporting patient care, personalized medicine, and research for Healthcare and Life Science.\n\nHere at Leica we believe diversity is important to ensure an innovative environment. Different educational, cultural and occupational backgrounds invite new ways of doing things, sharing ideas and working together.\n\nWe are looking for individuals who will fit in with our culture and contribute in their own unique way, demonstrating passion in what they do, committed to do what it takes, and have a proven track record of initiative and success. Come join our team and share your talent, expertise and use your knowledge to expand your experience.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/legrand-814842", "employer_name": "Legrand", "employer_info": "About Legrand Australia\n\nPart of the global Legrand network, with a presence in more than 70 countries and a workforce of more than 35,000 people, we are specialists in designing and manufacturing products for electrical and digital building infrastructures. Discontent with making purely functional products, we aim to set the benchmark for both technological innovation and inspirational design of everyday items, boosting the profile of modern electrical systems within both the Trade and Consumer sectors. To offer the most efficient and comprehensive service for large building projects, we continue to develop and hone a broad and diversified product range so you can enjoy the convenience of working with one trusted supplier who will support you before, during and after the installation process.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/legra-engineering-803826", "employer_name": "Legra Engineering", "employer_info": "Legra Engineering Pty Ltd was established in 1984 after the successful development of a Blasthole Dewatering Pump Unit for the Coal Fields in Central Queensland. Legra Engineering began exporting to the USA in September 1989 and to Chile the following year. After assessing the American market, further models were introduced to best service these requirements.\n\nSource: This is an extract from the company’s own website."},
{"employer_url": "https://www.seek.com.au/companies/leeming-primary-school-871506", "employer_name": "Leeming Primary School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/legion-cabs-800476", "employer_name": "Legion Cabs", "employer_info": "Today, Legion Cabs is one of Sydney's most highly regarded taxi services. Operating in Sydney and its outskirts, Legion Cabs has a fleet of over 500 taxis and has been in operation since 1947.\n\nLegion Cabs has approximately 65 committed staff operating from its NEW state of the art headquarters at 139 Princes Hwy Wolli Creek, ranging from management, administration staff, call center operators and console operators.\n\nLegion Cabs is considered one of the more progressive and fresh thinking taxi service providers in the industry, offering the highest professional standard in service and support to cater for our clients transport needs. With focus on the environment, Legion Cabs recently joined to its fleet, environmentally friendly Toyota Hybrid cars.\n\nLegion Cabs completes over 50,000 booked jobs per month for both individuals and corporate organisations.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/leeman-primary-school-871505", "employer_name": "Leeman Primary School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/leeming-senior-high-school-871507", "employer_name": "Leeming Senior High School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/leed-engineering-and-construction-803811", "employer_name": "Leed Engineering and Construction", "employer_info": "Leed is a dynamic, award-winning, privately-owned multi-disciplinary engineering and construction company, specialising in complex infrastructure projects. Founded in 2001, Leed has grown rapidly to become a national civil infrastructure contractor with offices in Adelaide, Melbourne and Bendigo, delivering projects throughout metropolitan, regional and remote areas of Australia.\nSource: this is an extract from the company’s own website."},
{"employer_url": "https://www.seek.com.au/companies/leeming-senior-high-school-education-support-centre-871508", "employer_name": "Leeming Senior High School Education Support Centre", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/lee-crane-hire-930559", "employer_name": "Lee Crane Hire", "employer_info": "Lee Crane Hire has clients in the heavy engineering, building and construction, mining, manufacturing, maintenance, road and rail industries - plus general hire jobs.\n\nThe company has depots in Biloela and Gladstone, employing over 100 personnel. Our growing fleet of 70 cranes range from 2.6T to 280T - all available for either wet or dry hire.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/lee-brothers-fencing-815026", "employer_name": "Lee Brothers Fencing", "employer_info": "Lee Brothers Fencing is a proud family owned business founded in 1948 by brothers Jack and Brian Lee. Their mission was to provide quality domestic fencing for the residents of Melbourne’s Northern suburbs as well as operating their timber yard in Thornbury.\n\nAs their reputation for service and quality grew, the brothers soon began to develop quality commercial and industrial fencing solutions. From humble beginnings to the now large-scale operation the key focus has always been to provide customers with the highest quality fencing solutions. All fences and gates can be manufactured to order on our main Preston site by our professionally trained staff in compliance with Australian Standards.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/life-insurance-direct-australia-931172", "employer_name": "Life Insurance Direct Australia", "employer_info": "Compare and Apply\n\nWe make the comparison and application process as simple as possible, firstly we provide you a free comparison report to help you easily compare different policies from the leading life insurance companies, we then answer any questions you may have around your specific requirements to assist you in finding a policy! Once you are happy to proceed we complete your application with you over the phone!\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/ledar-group-834597", "employer_name": "Ledar Group", "employer_info": "Around the Clock Customer Hotline & Make Safe Service.\nCommitted to Reducing Claim Life & Exceeding Customer Expectations. \nMajor Loss Rebuild Specialists.\nManaged Fast-Tracked Minor Claims.\nExpert Cost Plus Solutions. \nLatest Technology: Quotes, Updates, Photos & Reports Submitted from Site. \n\nSource: this is an extract from the company’s own website."},
{"employer_url": "https://www.seek.com.au/companies/leda-holdings-930544", "employer_name": "Leda Holdings", "employer_info": "Established in 1976 by Executive Chairman Bob Ell, Leda continues to concentrate on acquiring premium development and project sites with its aim to maximise long-term activity and returns. Leda's carefully considered and innovative policy of creating and managing its own asset portfolio has resulted in its resilience during major economic downturns, which is unequalled in Australia's property development history.\n\nLeda's extraordinarily experienced teams focus on long-term asset growth. The Leda philosophy is to avoid exploitation and short-term expediency. For Leda's portfolio, development is through investment. Risk is managed by pre-letting major developments. Through this approach, Leda has gained strong credibility with conservative institutional investors, enabling Leda to pre-sell major non-portfolio developments.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/lebara-mobile-435546", "employer_name": "Lebara mobile", "employer_info": "The Lebara Group was founded in 2001 by Rasiah R Leon, Baskaran Kandiah and Ratheesan Yoganathan. \nThey shared a vision to shake up the international calling market.\n\nThe trio were in Norway, en route to the airport when inspiration struck: Ratheesan noticed the imposing Telenor building and wondered why they couldn't create a company of their own. On arrival at the airport, the partners borrowed a pen and some paper from the information desk and the concept of Lebara was born - the name coming from the first two letters of the partners names. Now over a decade old, Lebara is one of Europe's fastest growing mobile companies with five million active customers, 1,000 employees worldwide and operations in eight countries.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/leda-education-support-centre-871503", "employer_name": "Leda Education Support Centre", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/leaseplan-australia-434154", "employer_name": "LeasePlan Australia", "employer_info": "Present in 32 countries, LeasePlan is the world leading vehicle and fleet management company, operating a fleet of more than 1.42 million vehicles worldwide. LeasePlan provides its clients with the opportunity to outsource their fleet and the day-to-day management of its vehicles. \nLeasePlan Australia opened in it doors in 1988 with three people and one computer. Today, we have offices in Melbourne (HQ), Canberra, Sydney, Brisbane, Adelaide, Perth and Hobart, we manage over 97,000 vehicles and employ around 380 staff."},
{"employer_url": "https://www.seek.com.au/companies/leo-burnett-435098", "employer_name": "Leo Burnett", "employer_info": "Whatever we do, we strive to do with maximum impact. We believe ideas with impact will not only increase our clients’ bottom line, they can also change the world.\n\nAs a boutique multinational, our positioning is unique because we walk like an independent with the backing of a helpful sophisticated global network. It's the best of both worlds, where our clients don't have to compromise on creative agility for scale and world-class expertise. We are a fully integrated multi-speed company covering all services including digital, social, shopper, design, content and strategy.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/learning-links-813833", "employer_name": "Learning Links", "employer_info": "Learning Links was established in 1972 by parents concerned about the lack of appropriate education and support services to meet their children’s needs.\n\nToday, our focus is on preventing learning difficulties from causing disadvantage.\n\nWhat we do\n\nLearning Links works in collaboration with schools, early childhood settings and parents to help children with learning disabilities and difficulties.\n\nThese include conditions such as ADHD, high functioning Autism, Dyslexia, Dyscalculia, fine and gross motor delays and speech and language delays. The children are often anxious, have trouble communicating and interacting with others, and many have behavioural issues. In the later years they are often challenged in literacy, numeracy and impacting on their ability to complete education and participate in the community.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/learn-to-trade-930494", "employer_name": "Learn To Trade", "employer_info": "The Forex Market is the largest and most liquid market in the world. Discover how you can have your share at this immersive 2 hour Workshop taught by Greg Secker’s Senior Trader. He will show you how to generate an immediate income, using Greg’s professional trading strategies, simplified to work for you.\n\nYou’ll be learning from the best\n\nMaster Trader Greg Secker and founder of multi-award winning education company ‘Learn to Trade’ have taught over 200,000 ordinary people how to makeover their financial future.\n\nCalled upon as a trading ‘guru’, Greg’s opinions on Forex Market Direction and Trading Opportunities are regularly featured on major market channels including CNBC, Skynews, Bloomberg, TV3 Ireland, Channel M and BEN TV.\n\nGreg has shared the stage with Tony Blair, Sir Richard Branson, Lord Alan Sugar, and Robert Kiyosaki.\n\nGreg and Learn to Trade’s sole mission is to help the everyday man to blaze a path to financial freedom.\n\nLet us show you that only around 30 minutes a day can take you towards the lifestyle and rewards you deserve – by trading Forex. And anyone, from any background, can learn to do it.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/ledonne-constructions-803809", "employer_name": "Ledonne Constructions", "employer_info": "Ledonne Constructions has been established for over 29 years and specialises in providing outstanding water and wastewater  solutions to its clients. Ledonne Constructions has been successful in delivering major projects in both New South Wales and Victoria.\n\nLedonne Constructions are accredited under the Office of Federal Safety Commission (OFSC) and the company is third party accredited to ISO9001:2008 (Quality), AS4801:2001 (WHS) and ISO14001:2004 (Environmental).  Ledonne Constructions also have endorsement under the Australian Government Building and Construction WHS Accreditation Scheme.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/learn-and-laugh-childrens-centre-814400", "employer_name": "Learn and Laugh Children's Centre", "employer_info": "Learn & Laugh is custom-designed and purpose-built to meet the emotional, physical, and cognitive needs of young children. Children and parents enter our building through a foyer area that features the children's work and leads into our parent meeting area. This area is where Parents can meet and spend periods of time with their children before and after their time at Learn & Laugh. Our Foyer area also includes an office and resource room.\n\nOur Centre is accessed through a security protected door, which requires visitors and parents to \"BUZZ\" and identify themselves prior to gaining access to the building. The Foyer is where you will find parent communication pockets, and other forms of communication with families.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/ledified-814963", "employer_name": "Ledified", "employer_info": "LEDIFIED IS LEADING AUSTRALIA’S LED REVOLUTION\n\nLEDified is Australia’s largest full service LED specialist. LEDified designs and procures its own class-leading, patented LED products direct from world class manufacturers. From LED downlights in the home, to LED highbays in the warehouse and everything in between, LEDified has the right LED to suit your needs.\n\nThe migration to LED lighting is supported by the Australian Government phase-out of inefficient lighting as well as the state based Victorian VEET and NSW i-PART programs. These initiatives are helping everyone from households to large corporations make the switch to LED lights. Contact us today to learn why retrofitting LEDified LEDs is a great idea for your home or business.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/leanyer-recreation-park-868040", "employer_name": "Leanyer Recreation Park", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/lecornu-furniture-800465", "employer_name": "Lecornu Furniture", "employer_info": "Lounge, Bedroom, Dining, Office and Outdoor Furniture and Flooring Specialists."},
{"employer_url": "https://www.seek.com.au/companies/leda-primary-school-871504", "employer_name": "Leda Primary School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/league-engineering-803803", "employer_name": "league engineering", "employer_info": "League is an engineering service company, providing Project, and Production Solutions, to the manufacturing and  construction industries.  \nIndustries have changed the way that they do business, more and more depending on outsourcing to solve maintenance and project issues and to top up labour resources to handle those peak manufacturing loads. It takes a particular type of engineering company to handle all of these requirements. A company that employs only the best in their trade, has practical and experienced management, and works toward longstanding relationships with industry leaders.…….Welcome to League.\n\n   \n\n\n\nPlease take some time to have a look around our website. Our aim is to make a site that is fun, practical and informative for both our customers and our employees. It must be above all else, a good communication device for all that use it. We welcome suggestions and accept articles and advertising material from all for consideration to be included in our quarterly newsletter.\n\nSit back, relax and enjoy, because you have League  on the job!\nSince 1984 The directors at League have provided engineering support services to leading Manufacturing, Construction and Government Agencies. Adopting an open-book approach to the way we conduct business has established a long list of Business partners keen to work with our League industry specialists.\n\nOur Account Managers are available to discuss any manufacturing, maintenance or project issues that may occur. We have a team of Industry Specialists that will be able to provide solutions for just about anything.\n\nOur staff have been carefully selected based on qualifications, experience and safe work practices. All trade qualified and industry experienced from Managing Director level down. We feel that it is necessary for a complete understanding of our customer’s requirements and that’s why we recruit only the best.\n\nOur industry specialist sales team will be happy to visit you on site to discuss your needs and let you see the difference   when you have  League   on the job!\nSource: this is an extract from the company’s own website."},
{"employer_url": "https://www.seek.com.au/companies/leanyer-primary-school-988205", "employer_name": "Leanyer Primary School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/leap-legal-software-800462", "employer_name": "Leap Legal software", "employer_info": "LEAP is focused on the needs of law firms 1 to 100 people, which is why more than 5,000 law firms in Australia use LEAP software.\n\nTo ensure our software is the best possible practice management solution, LEAP commits more than $8,000,000 a year to Research and Development. We are the only Australian legal software provider to have a true cloud based product for lawyers.\n\nLEAP has been helping lawyers since 1992, our people have extensive experience working with law firms and understand your needs and challenges. See our Leadership Team.\n\nWe understand it can be difficult to find, retain and afford good staff. Therefore, LEAP is designed to be practical and user friendly so everyone can easily use the same system, even those without legal experience.\n\nIf you need to downsize your firm, LEAP can help you do this while still retaining your current working capacity or if you are starting a new firm, LEAP provides you with everything you need to run your own firm.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/leading-edge-telecoms-435328", "employer_name": "Leading Edge Telecoms", "employer_info": "Leading Edge Telecoms  Mt Waverley is a boutique Technology Business Partner that takes pride in our exceptional customer delivery and experience.\nWhenever you buy any of the vast Technology solutions from Leading Edge Telecoms – whether that is a prepaid or post paid mobile phone, data solutions or a business wide voice and data package you are dealing with a business that strives to protect the place of small business in the local community.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/leading-edge-video-436032", "employer_name": "Leading Edge Video", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/leading-age-services-australia-qld-795801", "employer_name": "Leading Age Services Australia QLD", "employer_info": "Leading Age Services Australia (LASA) is the national peak body representing and supporting providers of age services across residential care, home care, retirement living and seniors housing.  Our vision is to enable a high performing, respected, sustainable age service industry delivering affordable, accessible, quality care and services for you .  We represent our Members by advocating their views on issues of importance and we support our Members by providing information, services, training and events that enhance performance and sustainability.\n\nWe have recently welcomed new Principal Advisors to our National team - Troy Spiers (Principal Advisor Home Care), Sharon McIlwain (Principal Advisor Residential Care) and Jo Thomason (Principal Advisor Retirement Living and Seniors Housing). Lynda Robertson has recently been appointed Manager Accredited training for our national RTO.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/leading-edge-group-434565", "employer_name": "Leading Edge Group", "employer_info": "Leading Edge Group\n\nEst. 1986. We are a multi-national organisation operating in two major sectors; buying group management and sales channel management across Australia, New Zealand and the UK. \n\nWe work with independent retailers across 8 different industries and support over 950 retail store owners.\n\nWe have a strong presence in the telecommunications and ICT market, partnering with the market leading Telco providers in Australia, New Zealand, England and Wales to sell and service customers in this highly specialised field. \n\n\nWe support our retailers and help our suppliers improve their profitability, target their end customers, and leverage earnings across each other and their industry. \n\nLeading Edge Group is about providing real value for our retail and business networks, our people - our clients - our suppliers. We employ over 425 people in four different countries and have a very clear vision and simple mission for the future.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/leading-edge-computers-834872", "employer_name": "Leading Edge Computers", "employer_info": "OUR STORY\nLeading Edge Computers\nLeading Edge Computers has been trading for more than 20 years now and with more than 130 stores nationally we are one of the largest specialised independent IT Re-sellers in Australia. Each store is independently owned assuring you of the highest levels of customer service and technical excellence because “the person who owns the store runs the store” and is dedicated to satisfying your needs.\nLeading Edge Computers has direct trading arrangements with many of the leading suppliers to the computer industry so we can provide you with the latest corporate, business and retail products. Our arrangements with our preferred suppliers give LEC Members exclusive access to restricted product ranges like the Microsoft Surface, Apple and Asus Retail Range of products and many more name brand name products. We are currently a HP Premier Business Partner, Lenovo Diamond Partner, Cisco Partner, Microsoft Partner and VMWare Partner.\n\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/leader-computers-930298", "employer_name": "Leader Computers", "employer_info": "Leader Computers Pty Ltd is a manufacturer & distributor of high quality Information Communications Technology (ICT) products. We manufacture Leader branded PC's, Notebooks, Tablets, & Intel™ white box series. We also distribute a huge range of IT products and peripherals.\n\nLeader is Australia’s largest Australian owned PC Manufacturer, with warehousing and sales offices strategically located in Adelaide, Sydney, Melbourne, Brisbane and Perth, and as such, Leader is well placed to support the IT Channel thought Australia.\n\n\nLeader holds certification as a quality assured organisation to the ISO 9001:2008 Quality Management System standard and is also a signatory to the Australian Packaging Covenant.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/leader-security-803799", "employer_name": "Leader Security", "employer_info": "Leader by name, Leader by nature\n\nLeader Security specialise in tailored security solutions for high risk industries and residential properties.\n\nWe offer a wide range of affordable and effective security solutions with exceptional service from local industry experts.\nCanberra's Leader in Security\n\n\nTechnology\nManpower\nSpecialist Services\n\n\n\n\nModern, intelligent security systems\n\nMove with the times, breakthrough technology in the palm of your hands. From visually verified intrusion systems to remote CCTV surveillance systems. Take App-solute control of your security 24/7 where ever you are.\n\nAre you looking for honest, affordable, effective security from a professional local supplier, without restrictive contracts?\n\nLet Canberra’s leader in security show you the difference.\n\nSource: this is an extract from the company’s own website."},
{"employer_url": "https://www.seek.com.au/companies/leadbolt-868032", "employer_name": "Leadbolt", "employer_info": "Leadbolt is one of Australia’s fastest growing companies and the world’s leading mobile advertising, user acquisition and monetization platform.\n\n\n\n\nAbout Leadbolt\nLeadbolt is one of Australia’s fastest growing companies and the world’s leading mobile advertising, user acquisition and monetization platform.\n\nWith clients in over 165 countries, Leadbolt serves over 10 billion ads per month to its users. Leadbolt currently has offices in Sydney and Los Angeles and is expanding rapidly across the world. \nWe are proud of the product we’ve built and the impact it has on other people’s businesses and lives. We want to be surrounded by people who are always finding opportunities to try something new and push their limits. \nWe are passionate in everything we do – we work hard, and give everything we’ve got to make our customers love us. \nSource: This is an extract from the company's own website"},
{"employer_url": "https://www.seek.com.au/companies/lead-force-marketing-solutions-868252", "employer_name": "Lead Force Marketing Solutions", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/lead-childcare-436647", "employer_name": "Lead Childcare", "employer_info": "Lead Childcare\n\nYour child will enjoy days filled with learning, enjoyment, activity and development at LEAD Childcare. We care for your children like family, provide them with nutritious meals throughout the day and educate them to prepare them socially and cognitively  for the school years ahead. With centres throughout Queensland, find your child's closest home away from home at LEAD Childcare..\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/lcr-group-436202?child=803793", "employer_name": "LCR Mining", "employer_info": "LCR Group Pty Ltd (LCR) is an industrial and mining services company providing lift and shift services to Australian and International customers. These services include bulk materials handling, transport, mining and associated industrial services.\n\nOur skills and experience enable us to:\n    - Objectively evaluate customers' needs\n    - Take advantage of our vast pool of equipment, modern technologies and techniques\n    - Recommend safe, workable strategies that best satisfy customers' needs\n    - Plan and project manage entire projects\n\nLCR Group, whilst a private company, adopts a public company approach to governance, reporting, safety and service delivery standards. Our corporate office is located in Hendra Brisbane. We contract for domestic and overseas projects and employ over 500 people.\n\nOur team leads by example and proactively drives safety and environmentally-conscious working attitudes and behaviours. We are constantly seeking innovative and creative ways of building on the strong culture of HSE in our organisation.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/le-cake-930521", "employer_name": "Le Cake", "employer_info": "THE FACTS\n\nNutrition, Allergen\nLe Cake’s products may contain cereals containing gluten & their products; egg & egg products, milk & milk products, peanuts & peanut products, sesame seeds & sesame seed products....\n\nLE CAKE'S\n\nPromotions  Offers\nwe will strive to bring you all the latest flavours and seasonal desserts so check here for up to the minutes promotions.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/ld-total-436594", "employer_name": "LD Total", "employer_info": "From major commercial projects to high quality home gardens, our philosophy remains the same - listen and connect with our client’s vision, develop long lasting partnerships, and create inspirational outdoor spaces that allow purpose and style to intertwine.\n\nWe’ve grown a lot since taking the first step as a small family-run landscaping business some 20 years ago. LD TOTAL is now a multi-award winning landscape company, offering a full range of services from design to construction, irrigation and ongoing maintenance.\n\nWhile we’re proud of how much the business has evolved, there are some things that will never change. Our traditional family values and unwavering dedication to client satisfaction remains at the core of who we are. This ensures you receive the reliable and efficient service of a large company, coupled with the genuine care and personal approach of a small business.\n\nThrough our exceptional workmanship, open communication and refined process, we’re confident we can deliver more than you ever imagined, on time and on budget.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/lawyers-on-demand-930240", "employer_name": "Lawyers On Demand", "employer_info": "We’re the original New Law pioneer.  Over the past decade, we’ve transformed the way in which lawyers, consultants and legal teams work. Today, we’re one of the largest and fastest growing flexible legal services businesses, continuing to lead the market we created.\nOriginally launched in 2007, LOD is the original alternative legal service, born out of changes in the way people worked. \n2007 \n\n\n8 talented lawyers answer Lawyers On Demand’s first advert seeking lawyers who want to work differently. Our first lawyer on assignment, Darren Heath, still works with us today and runs his own film production company alongside lawyering.  \nLife With Law is a series of FREE talks offering inspiration and ideas for living a good, happy and satisfying life (whilst practicing law). \nSource: This is an extract from the company's own website"},
{"employer_url": "https://www.seek.com.au/companies/lazard-438872", "employer_name": "Lazard", "employer_info": "We advise clients around the world on strategic and financial matters including mergers and acquisitions, restructurings, capital structure and capital raising. Lazard provides advisory clients with a quality of service we believe no other firm can match. Our client relationships are built on trust and discretion. We are deeply established in business centers around the world, with meaningful local relationships and insight. And as the world’s largest advisory-focused firm, we have exceptional depth of expertise across industry sectors and geographies.\n\nSource: this is an extract from the company’s own website"},
{"employer_url": "https://www.seek.com.au/companies/lcr-group-436202", "employer_name": "LCR Group", "employer_info": "LCR Group Pty Ltd (LCR) is an industrial and mining services company providing lift and shift services to Australian and International customers. These services include bulk materials handling, transport, mining and associated industrial services.\n\nOur skills and experience enable us to:\n    - Objectively evaluate customers' needs\n    - Take advantage of our vast pool of equipment, modern technologies and techniques\n    - Recommend safe, workable strategies that best satisfy customers' needs\n    - Plan and project manage entire projects\n\nLCR Group, whilst a private company, adopts a public company approach to governance, reporting, safety and service delivery standards. Our corporate office is located in Hendra Brisbane. We contract for domestic and overseas projects and employ over 500 people.\n\nOur team leads by example and proactively drives safety and environmentally-conscious working attitudes and behaviours. We are constantly seeking innovative and creative ways of building on the strong culture of HSE in our organisation.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/layne-drilling-930258", "employer_name": "Layne Drilling", "employer_info": "As we have grown over the last 130 years, so has the diversity of our company and our offering. With each new stage of growth came new people, new processes and new thoughts that influenced our company and help make us who we are today - a unified team.\nIn defining a path forward for Layne, one word kept emerging over and over – solutions. We invent solutions. We propose solutions. We deliver solutions. For a company known previously as a “service provider” this is an important distinction.\nOur expertise has brought us to a point where we are valued for our unique ability to collaborate across divisional, functional and geographic lines to provide our clients an integrated approach, ensuring streamlined communications, expedited timelines, a constant focus on safety and sustainability. Our solutions give clients a single point of accountability for even the most complex projects, and enable us to deliver high levels of both quality and economic efficiency. While our services are impeccable, it is our solutions that make us truly remarkable.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/lawson-smith-lawyers-803786", "employer_name": "Lawson Smith Lawyers", "employer_info": "HWL Ebsworth Lawyers has announced that the team from Lawson Smith Lawyers will join the firm's Adelaide office on 19 January 2015.\n\nThe partners joining HWL Ebsworth will be Richard Smith, Michael Tilley, Anthony Hillary, David Johns, Michael Ricketts and Anna Jackson.\n\nThe new partners will be joined by a team of ten legal and support staff.\n\nLawson Smith and its predecessors has offered clients a boutique insurance and litigation practice since 1979 and its clients include insurers, domestic and international underwriters, insureds, Government agencies and claims management companies.\n\nCore areas of specialty of the team include Professional Indemnity, Public and Products Liability, Clinical Negligence, Health Care and Health Law, Industrial Special Risk and Property and Defamation and Media.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/law-partners-personal-injury-lawyers-816758", "employer_name": "Law Partners Personal Injury Lawyers", "employer_info": "We give\nyou more\nBacked by over 30 years of claim experience, Law Partners is an award winning specialist personal injury law firm.\nWe have won over 99% of our clients' injury claims\nWe provide a unique 100% No Win No Fee Guarantee\nOur lawyers are specialists in injury law\nWe understand how important claims are to our clients and we are committed to maximising your claim entitlements\nOur clients are our priority. We pride ourselves on providing an excellent service to our clients\nWe know what our clients expect from their lawyer and we will always go the extra mile to ensure we exceed your expectations.\nWe've helped thousands of people lodge and finalise their compensation claims\nWe do not charge any fees to discuss your claim with you.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/law-institute-of-victoria-814660", "employer_name": "Law Institute of Victoria", "employer_info": "The LIV represents more than 19,000 lawyers and people working in the law in Victoria, interstate and overseas. Our members offer their commitment, diversity and expertise to help shape the laws of Victoria and to ensure a strong legal profession for the future. \n\nThe LIV promotes justice for all by advancing social and public welfare in the operation of the courts and legal system, as well as advancing education and public confidence both in the legal profession and in the processes by which the law is made and administered.  \n\nAs the peak body for the Victorian legal profession, the LIV initiates programs to support the needs of a changing profession, promotes an active law reform advocacy agenda, responds publicly to issues affecting the profession and broader community, delivers continuing legal education programs, and continues to provide expert services and resources to support our members.\n\nThe LIV is a non-profit organisation dedicated to its members and the development, maintenance and the sustenance of the law for the benefit of the community.  \n\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/lawnton-state-school-820081", "employer_name": "Lawnton State School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/laurent-bakery-435137", "employer_name": "Laurent Bakery", "employer_info": "Laurent Bakery is a premium food business encompassing the manufacture, retail and wholesale of French/European style breads, cakes, pastries, savouries, confectionery and other food products. Our speciality is stone-baked sour-dough production respecting principles of artisan baking.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/laverton-school-871492", "employer_name": "Laverton School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/laverty-pathology-433387", "employer_name": "Laverty Pathology", "employer_info": "Laverty Pathology is a comprehensive medical laboratory and pathology practice with laboratory and patient pathology collection centre locations throughout NSW and ACT.  Our mission is to deliver better insights into the health of more Australians. Our mission is inextricably linked to our foundations and heritage borne through medical and scientific leadership.\n\nSource: this is an extract from the company's own website"},
{"employer_url": "https://www.seek.com.au/companies/laverton-hospital-871491", "employer_name": "Laverton Hospital", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/laverton-community-health-service-871490", "employer_name": "Laverton Community Health Service", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/laureate-806795", "employer_name": "Laureate", "employer_info": "Laureate’s network of more than 80 campus-based and online universities in 28 countries offers undergraduate and graduate degree programs to over one million students worldwide. Ours is the largest global network of degree-granting higher education institutions, and our students are part of a diverse, international community that spans the Americas, Europe, Africa, Asia and the Middle East. Our institutions offer undergraduate, master’s and doctoral degree programs fields such as business and management, medical and health sciences, engineering, information technology, architecture, education, law, communications and hospitality management."},
{"employer_url": "https://www.seek.com.au/companies/laura-state-school-820299", "employer_name": "Laura State School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/laura-primary-health-care-centre-821583", "employer_name": "Laura Primary Health Care Centre", "employer_info": "Laura offers primary clinical care and primary healthcare services through strong partnerships between nursing staff, and Aboriginal and Torres Strait Islander health workers.\n\nLaura provides a suite of regular visiting medical, community and allied health services in partnership with other health and social service providers, including diabetes educators, podiatry, paediatricians, hearing health, mental health, maternal, child health, eye specialists and, ear nose and throat specialists.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/laura-ashley-434421", "employer_name": "Laura Ashley", "employer_info": "Laura Ashley is one of the most loved fashion and home furnishings companies worldwide offering beautiful and high quality products and services.\n\nLaura Ashley (Australia) Pty Ltd (Administrators Appointed) was established in Australia in 1971 and operates under a license agreement with Laura Ashley UK. We have stores in both Australia and New Zealand where you will find helpful and friendly staff on hand that will make your shopping experience a pleasure. They can assist you with anything from coordinating accessories for your living areas to helping you choose that perfect outfit from our fashion range.  You’ll find a host of services on offer that have been designed with you in mind and specially trained staff to advise you.\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/laundy-hotels-437512", "employer_name": "Laundy Hotels", "employer_info": "The Laundy family have been in the hotel industry for three generations. Arthur (Snr) and Veronica Laundy started the business in 1945 with the Sackville Hotel, Rozelle.\n \nMoving to the west they purchased land at Bass Hill in 1962 and built the Twin Willows Hotel. Although it looks very different today, the Twin Willows is still the headquarters of the Laundy Enterprise.\n \nAt that time Arthur (Jnr) had his own leasehold of the Royal Exhibition Hotel, Surry Hills.\nIn 1969 tragedy struck – Arthur (Snr) died when the light plane he was piloting went down in Burrendong Dam, Wellington. He, along with 3 staff members, was killed.\n \nArthur (Jnr) was thrust into control, left to run the family’s two hotels – The Twin Willows and the Hume Hotel, Yagoona. Arthur (Jnr) married Margaret Paul in 1970. Together they moulded what was to become their empire. They thrived in the hotel industry, going from strength to strength. In 2004 Arthur (Jnr) was invested as an AM.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/launceston-reception-prison-796067", "employer_name": "Launceston Reception Prison", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/launceston-general-hospital-796054", "employer_name": "Launceston General Hospital", "employer_info": "The Department of Health and Human Services\n\nWe support the executive and statutory roles of the Tasmanian Minister for Health and Minister for Human Services, as well as monitoring the performance of the Tasmanian public health system through the services delivered by the Tasmanian Health Service.\n\nOur vision\n\nTo deliver services, policies, programs and legislation that improve the health, safety and wellbeing of Tasmanians.\n\nOur commitment\n\nTo work together with clients and the community. To work as one agency, part of one Government and as stewards and partners in the delivery of health and human services.\n\nOur principles\n\nClient and Community Focus\nEffective Governance\nStrategic Collaboration\nIntelligent Decision-making\nLeadership and Culture\nOur performance\n\nDHHS will monitor and respond to performance through the Health and Human Services Dashboards and the delivery of major priorities and actions.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/launceston-pathology-800446", "employer_name": "Launceston Pathology", "employer_info": "Launceston Pathology is a member of the Sonic Healthcare group and has been providing quality pathology services to the Tasmanian community for approximately thirty years.\n\nLaunceston Pathology is one of three semi autonomous laboratory divisions operated in Tasmania by Diagnostic Services Pty. Ltd. The other laboratories are North West Pathology and Hobart Pathology.  The services of the three laboratories are integrated under one management structure and to ensure efficiency and effectiveness, the laboratories are mutually supportive for both staffing and specialised testing. Each division however, independently offers a comprehensive range of tests and services.  The three laboratories maintain a seven-day a week, 24-hour service with trained and experienced pathologists and medical scientists available for out of hours emergency testing.\nSource: this is an extract from the company’s own website."},
{"employer_url": "https://www.seek.com.au/companies/launceston-city-mission-867924", "employer_name": "Launceston City Mission", "employer_info": "Launceston City Mission seeks to provide assistance to all who have a physical, emotional, social or spiritual need, through a varied program of both social and evangelistic activities. City Mission works actively alongside churches and community groups to bring friendship, care and compassion to those who feel socially isolated.\n\nCity Mission exists to meet community and people's need and to demonstrate God's love in action; Caring and Sharing in Jesus' Name!\n\nOur vision is to be effective in:\n-Transforming Lives\n-Transforming Families\n-Transforming Communities\n-Transforming Futures\n\n\nWe're inspired and motivated by the life, teaching and example of Jesus. It informs our inclusive ethos and drives our passionate belief that each human being is equally important, has intrinsic God-given worth and is uniquely valuable.\n\n\n\n\n\nOur values are:\n\n\n\nFaith We have confidence that actions borne out of good character flourish \nJustice We take responsibility to uphold what is pure, right and true \nCompassion We invest whatever is necessary to heal the hurts of others \nFlexibility We are attentive and responsive to the needs in our community \nEnthusiasm We work with passion and commitment to achieve our goals \nSource: This is an extract from the company's own website"},
{"employer_url": "https://www.seek.com.au/companies/launceston-college-800445", "employer_name": "Launceston College", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/lauderdale-primary-school-871483", "employer_name": "Lauderdale Primary School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/laubman-and-pank-753318", "employer_name": "Laubman & Pank ", "employer_info": "Your eye health\n\nOur expertise\n\nAt Laubman & Pank, we know how important your eyes are. So we take the time to understand you, your eyes and your lifestyle, and offer solutions that best suit you.\n\nWe make optometry simple, and relevant to your life. Our optometrists are thorough, and will give you a total eye health check using the latest technology, so you know you’re in good hands\n\nOur in-store stylists can also help select the right frames for you. Our range of glasses and sunglasses includes the world’s leading brands such as Ray Ban, Oakley, Prada, Dolce & Gabbana, Versace just to name a few and children’s glasses – all at great prices.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/latrobe-primary-school-871481", "employer_name": "Latrobe Primary School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/latrobe-city-council-436294", "employer_name": "Latrobe City Council", "employer_info": "Latrobe Valley is located only 70 minutes from the outskirts of Melbourne with a population of over 75,000 residents. Latrobe City boasts all of the recreational and cultural facilities of a large diverse regional centre with the added benefit of being nestled amongst some of the best tourist attractions in the state.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/latitude-financial-services-868249", "employer_name": "Latitude Financial Services", "employer_info": "Who we are\n\nWelcome to Latitude Financial Services.\n\nWe’re a brand new name with a brand new look and big plans to be the best independent financial services provider in Australia and New Zealand.\n\nWhilst we may be a new name in the consumer finance market, under new ownership, we look after more than 2.5 million customers with sales finance, credit cards, personal loans and consumer credit insurance. We’ve also forged successful partnerships with some of the region’s most iconic and successful retailers.\n\nWe’d love to hear from you whether it’s to enquire about one of our products, how we can help your business grow or even if you want to speak to someone about your existing relationship with us.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/latrobe-high-school-871480", "employer_name": "Latrobe High School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/latino-australia-education-800437", "employer_name": "Latino Australia Education", "employer_info": "We have 18 years of experience in Australian education\nSince 1998 we have supported thousands of students who have successfully fulfilled their dream of studying in Australia. By 2015, more than 30,000 courses had been initiated by students through LAE.\n\nWe provide free and professional advice throughout the process\nAcademic Program Counseling\nWe guide you in the choice of study program.\n\nCost evaluation\nWe evaluate costs and accommodation options.\n\nInstitution registration\nWe make your registration to the institution and we certify documents.\n\nStudent visa processing\nWe accompany you in the visa process.\n\nCustom Counseling\nWe provide tips and advice on the lifestyle in Australia.\n\nCheap airline tickets\nExclusive airfare, thanks to our alliance with STA Travel.\n\n\n\n\n\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/latham-primary-school-871477", "employer_name": "Latham Primary School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/lathlain-primary-school-871479", "employer_name": "Lathlain Primary School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/latham-primary-871478", "employer_name": "Latham Primary", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/latham-preschool-871476", "employer_name": "Latham Preschool", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/laser-group-434193", "employer_name": "Laser Group", "employer_info": "From humble beginnings as an electrical contractor in Auckland in 1983, Laser Group has evolved to become the leading electrical and plumbing contracting network across Australia and New Zealand.\n\nThere are now over 200 member companies, employing in excess of 1,500 staff throughout both countries. These Member businesses are all enjoying all the benefits that come as part of the multi award winning Laser business system.\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/lasseters-hotel-casino-806527", "employer_name": "Lasseters Hotel Casino", "employer_info": "Lasseters enjoys picture-perfect surroundings beneath the stunning MacDonnell Ranges, alongside the banks of the Todd River and backing onto the Alice Springs Golf Course. Guests can enjoy the range of great facilities the hotel offers including the beautiful heated resort pool and spa, free Wi-Fi, in-house entertainment, fully equipped Health Club, and complimentary mountain bikes to explore Alice Springs. Experiencing the amazing sights of Central Australia is a breeze with advice from knowledgeable staff and concierge services.\n\nSource: This is an extract from the company’s own website."},
{"employer_url": "https://www.seek.com.au/companies/laser-clinics-australia-609466", "employer_name": "Laser Clinics Australia", "employer_info": "Since our first clinic opened in 2008 Laser Clinics Australia has established a dominant position in the cosmetic clinic market.\n\nWe have carved a new niche, creating an exceptionally strong brand and large customer base through the supply of affordable, accessible and reliable cosmetic treatments.\n\nWe now have clinics in over 60 convenient locations throughout Australia."},
{"employer_url": "https://www.seek.com.au/companies/larke-hoskins-813887", "employer_name": "Larke Hoskins", "employer_info": "ABOUT US\n\nTHE LARKE HOSKINS GROUP TODAY\n\nThe Larke Hoskins Group is a company with a proud heritage. Not proud because of its size or its wealth, but proud because it was founded by an outstanding Australian who established a great tradition…who counted integrity, the honouring of obligations, the fair deal, as the very foundation of the edifice that was built…the Larke Hoskins spirit inspires those who work within the Group to aim for the best, to go forever forward…but always the right way. The same good tradition is maintained up to this day… The principal activities of the Larke Hoskins Group are the distribution and sale of new and used motor vehicles in Sydney. The Group operates its vehicles trading business by the name “Larke Hoskins” The name Larke Hoskins came into existence in 1907 and is a well recognised name in the Australian automobile industry. The Group currently has distribution rights for Honda passenger vehicles. The Group also operates a pre owned car division to provide to its customers quality assured pre owned cars.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/larrakia-park-868126", "employer_name": "Larrakia Park", "employer_info": "Features\n\nThis venue features all of the following:\n\ntwo football fields\nmain field grandstand seats over 1,000\ntotal area seating for 6,000 \nfloodlighting\nfour change rooms\nreferee change room\nair-conditioned medical room\ncanteen and bar. \nContact\n\nFootball Federation Northern Territory\nPhone: (08) 8928 1006 \noffice@footballnt.com.au\n\nLocation\n\nThis venue is on Abala Road in the Marrara Sporting Precinct in Darwin.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/larrakeyah-primary-school-988203", "employer_name": "Larrakeyah Primary School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/lark-ellen-aged-care-800427", "employer_name": "Lark Ellen Aged Care", "employer_info": "Family owned and operated, Lark Ellen Aged Care has been caring for the Sutherland Shire for 50 years. With only 62 residents, we deliver an intimate environment & our personalised, attentive approach is fast becoming a rarity in the ‘corporate’ aged care industry.\n\nWith a strong reputation for excellence in quality care, our clinical specialists are responsive and noticeably warm and friendly. Our long-term staff have the expertise and professionalism to look after your loved ones, giving you peace of mind they are receiving the best possible care.\n\nOur seven day Lifestyle Program is individually tailored to each resident, and family is welcome to attend shows and join in the festivities that are celebrated all year round.\nSource: this is an extract from the company’s own website"},
{"employer_url": "https://www.seek.com.au/companies/laramba-school-988201", "employer_name": "Laramba School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/larapinta-primary-school-988202", "employer_name": "Larapinta Primary School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/lara-hotel-438448", "employer_name": "Lara Hotel", "employer_info": "Our modern Bistro can adequately sit up to 230 people.  Air-conditioned in the Summer and  cosy  warm in Winter,  the Bistro is a comfortable dining experience all year-round.  Our extensive menu caters to every taste .  \n\n\nEven the kids menu offers  options to  tempt even the fussiest of eaters and now with even healthier options.  Our children's room is the perfect area for your little one to play while you enjoy your meal.  Either in the climbing gym with slide or play the free video games, there is hours of fun!  There is always something happening at the Lara Hotel.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/lantrak-834315", "employer_name": "Lantrak", "employer_info": "From humble beginnings as a transport cooperative in 1959, Lantrak has earned an unrivalled reputation in integrating Material and Plant Hire solutions – forming one of the largest material management and plant hire businesses in Australia. \nLantrak is the industry leader in its core business of logistics and material reuse. Continually exceeding customer expectations by being first class multiple services provider in the industry, Lantrak is focused on developing a diverse workforce aligned with the company’s growth objectives.\n\nPeople at Lantrak are innovative, passionate and energetic – working as one team in a high-performing culture to deliver practical and valuable solutions to industry clients.\n\nLantrak has a solid history and excellent reputation in the industry and is guided by a dependable and respected leadership group.\nSource: This is an extract from the company's own website"},
{"employer_url": "https://www.seek.com.au/companies/lanyon-high-871467", "employer_name": "Lanyon High", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/langdon-ingredients-813844", "employer_name": "Langdon Ingredients", "employer_info": "Langdon Ingredients is proud of its status as a privately-owned company and a fifth generation family business. Established in Melbourne, Australia in 1852, Langdon Ingredients is a specialist food company offering a range of ingredients, services and niche food products to customers in Asia Pacific, Australia and New Zealand.\n\nLangdon Ingredients' services incorporate full product management, including\n•A broad product portfolio of innovative ingredients\n•Technical expertise from dedicated staff\n•Market and product knowledge advice\n•Testing and technical support\n•Contract manufacturing and packaging\n•Food importing, storage, and distribution\n\nOur team travels the globe sourcing only the finest quality ingredients and suppliers and is proud to offer you optimal quality ingredients and a reliable and continuous supply of new and exotic ingredients.\nSource: This is an extract from the company's own website"},
{"employer_url": "https://www.seek.com.au/companies/lasseter-group-school-988204", "employer_name": "Lasseter Group School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/lanier-australia-436431", "employer_name": "Lanier Australia", "employer_info": "We believe in being Smart at Work\n\nOur range of managed workflow, information technology and print service solutions are designed to simplify your 'everyday' so you can focus on the things that matter most. Your customers. Providing smart business solutions is central to what we do. In fact, our core philosophy is to offer true value and cost-effective services that keep your business systems in optimum running order. We can also transform the way you work with our tailored business technology services, and we'll back it all up with the highest levels of customer service. It's all part of our commitment to building long-standing partnerships with our customers and delivering measurable benefits.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/larsen-and-toubro-434357", "employer_name": "Larsen & Toubro", "employer_info": "Larsen & Toubro Limited is one of the largest and most respected companies in India's private sector. L&T has unmatched capabilities across Technology, Engineering, Construction and Manufacturing, and maintains a leadership in all its major lines of business\n\nL&T is engaged in core, high impact sectors of the economy and our integrated capabilities span the entire spectrum of ‘design to deliver’. \n\nSource: this is an extract from the company’s own website"},
{"employer_url": "https://www.seek.com.au/companies/landsdale-primary-school-871452", "employer_name": "Landsdale Primary School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/landsdale-farm-school-871451", "employer_name": "Landsdale Farm School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/lanskey-constructions-803758", "employer_name": "Lanskey Constructions", "employer_info": "In the mid 1980’s Paul Lanskey and Ross Williams founded Lanskey Constructions Pty Ltd as a building contractor with a difference. Their attitude and commitment to ‘non confrontational’ and client partnering relationships has resulted in the company expanding throughout Australia with offices in Brisbane, Sydney, Melbourne and Perth.\n\n\n Australia Wide\n\nLanskey Constructions employs resources in their various state offices that have undertaken projects for their many national clients in all States and Territories. This makes us a truly National builder capable of completing works anywhere from Carnarvon to Byron Bay, Hobart to Darwin and everywhere in between.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/lanfranchi-nickel-mines-929799", "employer_name": "Lanfranchi Nickel Mines", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/lane-cove-council-803754", "employer_name": "Lane Cove Council", "employer_info": "Lane Cove is located on the Lower North Shore, one bus stop away from the City and is a leafy, harbour-side suburb with a village atmosphere. Working for Lane Cove Council can help you achieve the right work / life balance, while providing a challenging and rewarding career path in Local Government.\n\nSource: This is an extract from the company’s own website."},
{"employer_url": "https://www.seek.com.au/companies/landscape-elements-816757", "employer_name": "Landscape Elements", "employer_info": "Welcome to Landscape Elements\n\nQuality, Collaboration and Reliability - These are the Elements of Our Success.\n\nLandscape Elements Pty Ltd is a specialist landscape construction and grounds maintenance company that is built around the foundations of solid client relationships and outstanding delivery of service.\n\nWe specialize in Landscape Construction, Playgrounds, Public Open Space, Landscape Maintenance and Land Rehabilitation. Having raised and nurtured this company from the ground up we remember what it was that made us successful in the first place. We commit to providing our customers with the highest standard of service in every single aspect of our work.\n\nOur professional attitude and innovation form the pillars of this organisation.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/landscape-solutions-435545", "employer_name": "Landscape Solutions", "employer_info": "After 23 years of successful operation, Landscape Solutions has grown to be Australia’s No.1 landscape company, and although our company has come a long way, our focus on Client service has never wavered.\n\nFrom our offices in Sydney, Melbourne, Brisbane and Canberra, we deploy 300 full-time staff on a daily basis. These days, we specialise in large-scale commercial landscape development, high-quality grounds, garden and sports field construction and maintenance services, as well as asset management and irrigation solutions – not bad, considering Managing Director Tim Buckle started out with just a ute and a shovel."},
{"employer_url": "https://www.seek.com.au/companies/landmark-education-437528", "employer_name": "Landmark Education", "employer_info": "Landmark’s programs are grounded in a model of transformative learning. Informative learning adds to people’s skills by bringing new knowledge; transformative learning gives people an awareness of the basic structures in which they know, think, and act. From that awareness comes a fundamental shift that leaves people more fully in accord with their own possibilities and those of others. This shift is the single most powerful attribute of Landmark’s breakthrough methodology. Participants find themselves able to think and act beyond existing views and limits—in their personal and professional lives, relationships, and wider communities of interest.\n\nLandmark's method leaves you applying what you learned naturally and without effort. Similar to what happens when you first ride a bicycle, in Landmark's methodology you learn by direct personal discovery—a moment occurs when a new ability is yours. You become confident in what you've learned, and the new ability is yours forever. \n\nThe Landmark Forum, Landmark’s flagship program, is designed to bring about such a fundamental shift in what’s possible in people's lives. This transformation is not a one-time event, but an ongoing access to living an extraordinary life. \nSource: this is an extract from the company’s own website."},
{"employer_url": "https://www.seek.com.au/companies/landsborough-state-school-819634", "employer_name": "Landsborough State School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/landmark-computers-437624", "employer_name": "Landmark Computers", "employer_info": "Landmark Computers was founded in 1994 by the present Directors Yogan, Jamuna and Naren Murugesu. With extensive experience and expertise in the computer industry they were convinced that there was a need for a IT store that would not only provide the latest computer products and technologies, but most importantly a level of unparalleled customer service. A commitment to a simple business philosophy, backed by a dedicated hard working team, has meant that in the last 10 years, Landmark Computers has become one of Victorias longest established and most respected IT solution provider. In 2003 we identified the company needed to achieve an even higher quality and project a more confident company to our clients. We undertook the process of ISO recognition in 2004 and with contributions from key staff Landmark Computers was rewarded with certified ISO credentials.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/landmark-group-436116", "employer_name": "Landmark Group", "employer_info": "Founded in 1973 in Bahrain, the Landmark Group has successfully grown into one of the largest and most successful retail organizations in the Middle East, Africa and Indian Subcontinent. An international, diversified retail and hospitality conglomerate that encourages entrepreneurship to consistently deliver exceptional value, the Group operates over 2000 outlets encompassing over 27 million square feet across the Middle East, Africa and the Indian Subcontinent. The Group employs over 55,000 people."},
{"employer_url": "https://www.seek.com.au/companies/landgate-435327", "employer_name": "Landgate", "employer_info": "Western Australian Land Information Authority is a statutory authority that operates under the business name of Landgate. We are managed by a board which is accountable to the Minister for Lands .  Here you can find out what we do, our structure, strategies, performance and values, as well as our commitment to community.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/lakes-entrance-bowls-club-929555", "employer_name": "Lakes Entrance Bowls Club", "employer_info": "Coffee Table Delights is a premium quality traditional biscuit maker which has been supplying many of the city’s premier establishments with their clients’ favourite treats for over 20 years.\nIf you’ve eaten at one of Perth’s top hotels, sampled the hospitality at the Crown Casino, or been to a client meeting at a prestigious law firm on the Terrace, chances are you’ll have already enjoyed some of the fine handcrafted products from this family owned business.\n\nOur biscuits are made the old-fashioned way, by hand, and using quality natural ingredients like pure butter. We do not use premixes, as everything is made from scratch and carefully measured and mixed to produce our range of Delights. Coffee Table Delights contain no artificial preservatives or chemical additives.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/lakeland-state-school-820606", "employer_name": "Lakeland State School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/lakelands-primary-school-871427", "employer_name": "Lakelands Primary School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/lakeland-senior-high-school-871426", "employer_name": "Lakeland Senior High School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/landpartners-834436", "employer_name": "Landpartners", "employer_info": "LandPartners is one of the largest surveying and planning consultancies in Australia.\n\nWe assist our clients to navigate the development process, providing timely, straightforward and accurate advice and services – even when development guidelines are complex, or technical issues challenging.\n\n \nWe specialise in:\n\n1.Surveying\n\n\n2.Urban planning and design\n\n\n3.Titling and development consulting, and\n\n\n4.Mapping and spatial information services.\n\n\n \n\nQuality and Safety\n\nWe work in partnership with our clients to deliver landmark and award-winning projects, including:\n\nWith management systems certified to Australian and international standards: ISO 9001, AS/NZS 4801 and OHSAS 18001, LandPartners takes quality and safety seriously. Our systems are regularly monitored and reviewed, undergoing routine internal and external audits. This ensures our services continue to be provided at the highest standard and in the safest manner.\n\nWe endeavour to provide a safe environment for our employees, clients, the public and others that may be affected by our operations. We promote an incident and injury free work culture to ensure that our activities meet and exceed our clients’ safety objectives and legislative requirements with the ultimate goal of getting everyone home safely.  Our superior service is delivered through our longstanding dedication to safety, quality, innovation and continuous improvement across all aspects of our business.\nSource: this is an extract from the company’s own website."},
{"employer_url": "https://www.seek.com.au/companies/lakes-creek-state-school-820321", "employer_name": "Lakes Creek State School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/lake-tuggeranong-college-871422", "employer_name": "Lake Tuggeranong College", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/lansdowne-crescent-primary-school-871462", "employer_name": "Lansdowne Crescent Primary School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/lake-placid-tourist-park-929545", "employer_name": "Lake Placid Tourist Park", "employer_info": "Lake Placid Tourist Park is set amongst 14 acres of tropical rainforest and is arguably one of the most pristine caravan parks in the Cairns region. Located far enough away from the Cairns CBD to be in a quiet and relaxing location, yet close enough to be within easy reach of all that the Cairns city has to offer.\n\nOur caravan park is adjacent to the cool, crystal clear waters of Lake Placid (at the base of the world heritage Barron River Gorge National Park).  Located near Cairns city, the park is central to the main tourist attractions such as Cairns Skyrail, the Kuranda Scenic Railway and Cairns’ northern beaches. It is the perfect place for a relaxing holiday and pets are welcome too.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/lake-maintenance-436242", "employer_name": "Lake Maintenance", "employer_info": "Ricci Schwarzler and Darren Nicholson began Lake Maintenance with a simple idea. What if there was a privately owned alternative to the big maintenance service providers?"},
{"employer_url": "https://www.seek.com.au/companies/langports-english-language-college-800424", "employer_name": "Langports English Language College", "employer_info": "Langports offers a choice of innovative & unique courses from beginner to advanced levels. If you want to study General English, try our UFO English program, with a personalised timetable designed according to your strengths and weaknesses. If you have a specific goal or would like to take a recognised English exam, you can also study Cambridge, TOEIC, IELTS, Business English and English for Academic Purposes. You will always have a small class size at Langports with a maximum of 16 students.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/lake-monger-primary-school-871419", "employer_name": "Lake Monger Primary School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/lake-imaging-814838", "employer_name": "Lake Imaging", "employer_info": "About Lake Imaging\nLake Imaging is the leading diagnostic radiology provider in central and western Victoria.\n\nOur vision has been to provide state of the art radiology services as close as possible to where they are needed. Founded in 2002 we are now among the largest radiology providers in Australia. Lake Imaging is now a part of the Integral Diagnostic Group, of which includes Lake Imaging,  South Coast Radiology in Queensland and Global Diagnostics in Western Australia. The combined clinical groups are now the fourth largest radiology provider in the country. This integrated radiology network gives referrers and patients access to an unparalleled range of expertise, experience, facilities and resources.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/lake-gwelup-primary-school-871413", "employer_name": "Lake Gwelup Primary School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/lake-king-primary-school-871417", "employer_name": "Lake King Primary School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/lake-joondalup-baptist-college-800410", "employer_name": "Lake Joondalup Baptist College", "employer_info": "Welcome to Lake Joondalup Baptist College. Our school is the first Baptist College to have been established in Western Australia. We are a coeducational K-12 school situated in the beautiful northern corridor of Perth with its easy access to pristine beaches and modern facilities. We are a Christian, values based school. Our staff are committed to pursuing professional excellence in the delivery of both our curriculum and student care programs. We are a large school - big enough to be well resourced, but small enough to care. \n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/lake-grace-health-service-871412", "employer_name": "Lake Grace Health Service", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/lake-ginninderra-871410", "employer_name": "Lake Ginninderra", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/lake-grace-district-high-school-871411", "employer_name": "Lake Grace District High School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/lake-clarendon-state-school-819657", "employer_name": "Lake Clarendon State School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/laing-orourke-432519", "employer_name": "Laing O'Rourke", "employer_info": "\n\n"},
{"employer_url": "https://www.seek.com.au/companies/lajamanu-school-988200", "employer_name": "Lajamanu School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/laing-real-estate-800408", "employer_name": "Laing Real Estate", "employer_info": "LAING REAL ESTATE is one of the leading Real Estate companies in Sydney. For the past 50 years we have been a market leader selling and leasing properties in Sydney’s Eastern suburbs, in particular Potts Point, Elizabeth Bay, Rushcutters Bay, Darlinghurst, East Sydney and Hyde Park as well as surrounding areas.\n\nDoug Laing, the original co-founder of the enormously successful Laing and Simmons franchise and his daughter Vicki Laing have carefully shaped the business into the successful boutique agency it is today. Anthony Birdsall, one of the leading sales agents in the area, joined Vicki as co-director to further strengthen the company’s profile and level of service.\n\nOur special retail hub for Reception/Property Management and Sales is located at 101-103 Macleay Street, Potts Point. Its prominent Macleay Street frontage and digital window displays, offers our clients maximum exposure for their property.\n\nSource: this is an extract from the company’s own website"},
{"employer_url": "https://www.seek.com.au/companies/laidley-health-service-821613", "employer_name": "Laidley Health Service", "employer_info": "Laidley Health Service is a 15-bed acute care facility providing 24-hour emergency treatment with nursing staff and doctors with right to private practice, inpatient management for all ages, including palliative care, interim care, transitional care and slow stream rehabilitation.\nThe Laidley Health Service provides outpatient services, including a dental clinic, basic radiography with rural operators, phlebotomy, methadone dosing and a needle exchange service.\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/laidley-state-high-school-820252", "employer_name": "Laidley State High School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/lai-switchboards-australia-929488", "employer_name": "Lai Switchboards Australia", "employer_info": "Lai Switchboards Australia is one of Australia’s largest switchboard manufacturers. With over 115 years of combined experience we are a leader in the design and manufacture of custom switchboards.\n\nAs one of Australia’s most highly experienced and innovative switchboard and switchroom manufacturers we are able to offer a wide range of innovative custom-built solutions for any customer.\n\nYou’ll see our innovative products installed on 1000’s of sites throughout Australia and NZ.\n\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/laidley-district-state-school-820218", "employer_name": "Laidley District State School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/lagardere-travel-retail-435681", "employer_name": "Lagardère Travel Retail", "employer_info": "Lagardère Services is a leading international group based on its expertise in Travel Retail and Distribution.\n\nLagardère Services is the world leader in News & Convenience, the European leader in Duty Free and Luxury retailing, and operates a growing portfolio of Specialty and Foodservice concepts.\n\nLagardère Services is present on all types of platforms (airports, railway stations, ferries, inflight-retail).\n\nSource: this is an extract from the company’s own website"},
{"employer_url": "https://www.seek.com.au/companies/laguna-real-estate-438265", "employer_name": "Laguna Real Estate", "employer_info": "Laguna Real Estate is one of the largest and the most successful agencies in the Sunshine Coast real estate market, with a sizeable presence in the Noosa Heads, Noosaville, Tewantin and Gympie marketplaces. Laguna Real Estate has over 40 trained specialists in sales, permanent rentals and holiday letting throughout four high profile offices.\n\nOur permanent and holiday rental departments proudly manage over 600 properties. With one of the largest databases in the area, Laguna offers successful outcomes to our clients for all of their property needs.\n\nPrincipal Olivier Miller has 37 years’ experience in selling Noosa property. Olivier’s 15 sales professionals are a mix of licensed real estate agents and sales consultants and have a combined 262 years of real estate experience.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/lahey-constructions-803715", "employer_name": "Lahey Constructions", "employer_info": "With over 65 years’ construction experience, Lahey is built to last. \n1950 Year Established. 504 Completed Projects. 75 Staff. 51 National Awards. \n\n\nFrom humble, rural beginnings, Lahey Constructions has grown to become one of Australia’s most prominent and long-standing construction firms. For over 66 years, our passion for quality and service has enabled us to thrive in an increasingly competitive and ever-evolving industry.\n\nLahey Constructions is one of Australia’s most long-standing and successful construction firms.\n\nWe have built a wide and diverse portfolio, ranging from hospitals and correctional facilities, to luxury apartments and resort complexes. We are well known and highly regarded for our flexible approach, and our unfailing commitment to excellence and integrity.\n\n\n\n\n\n\nWe are also proud to provide a healthy, safe working environment for our people and communities, and lasting relationships with our clients, suppliers and consultants.\n\nWhile our focus is firmly on the future – on utilising the most innovative methods and processes – our commitment to hard work, transparency and personal service has remained unchanged for over six decades.\n\nToday, we remain family-owned and operated, and we have offices around Australia – in Sydney, Canberra, Darwin, Brisbane and the Mid-North Coast of NSW, where we first began back in 1950.\nSource: This is an extract from the company's own website"},
{"employer_url": "https://www.seek.com.au/companies/lafayette-fine-foods-803711", "employer_name": "Lafayette Fine Foods", "employer_info": "Fresh ingredients, seasonal produce, and a passion for creating beautiful meals has been the hallmark of     Lafayette Fine Foods since 1993.\n \nFor over 20 years, owner Chef, Susan McKay, and her team have created premium ready meals, developed and devised with the discerning food lover in mind. Lafayette provides ready-made meals, meal delivery service and finger food & function catering to Melbourne.  Our commitment to quality comes from our love for food and belief that everyone should eat well.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/lady-cilento-childrens-hospital-school-819735", "employer_name": "Lady Cilento Children's Hospital School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/ladbrokes-digital-816756", "employer_name": "Ladbrokes Digital", "employer_info": "Ladbrokes.com.au is the local operation of Ladbrokes plc., a responsible leader in the global betting and gaming market, with over 125 years’ experience.\nAs Australia’s most innovative bookmaker, we offer a wide range of sports betting opportunities to our customers. In our commitment to the Australian public we promise value, product innovation, depth of markets and a superior user experience on the web and through mobile\n\nLadbrokes.com.au is managed from Australia, with offices in Sydney, Melbourne & Brisbane, by a team of local sports betting experts & enthusiasts. The website and software have been specifically developed for Australia, one of the most sophisticated wagering markets in the world.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/labrador-state-school-819972", "employer_name": "Labrador State School", "employer_info": "Labrador State School\nLabrador was opened officially in 1921 and now boasts an enrolment of over 950 students.\n \nThe school is situated on the northern end of the Gold Coast. We enjoy the coastal lifestyle with many kilometres of beaches and surf. The school is located only two blocks from the busy waterways of the Broadwater.\n \nLabrador State School provides students with an extensive education in all key learning areas and we pride ourselves on the level of support we are able to offer to all students, irrespective of their needs or interests. Support ranges from academic support, through to enrichment, while also supporting parents and staff. \n \nTake the time to look through these offerings on our website and we are looking forward to meeting with you.\n \n​​​​​Source: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/labour-hire-433739", "employer_name": "Labour Hire", "employer_info": "MC Labour was born out of Managing Director Marc Lunedei’s vision to set new standards for response, quality and service within the labour hire industry. Today MC Labour has developed an enviable reputation as one of Australia’s leading labour hire providers. Nationally, MC Labour specialise in providing employment services for both temporary and contract recruitment. Our site experienced operations team is committed to delivering effective and measurable labour solutions across all industry sectors. \r\n\r\nSource: this is an extract from the company’s own website"},
{"employer_url": "https://www.seek.com.au/companies/lady-cilento-childrens-hospital-821489", "employer_name": "Lady Cilento Childrens Hospital", "employer_info": "The Lady Cilento Children’s Hospital (LCCH) is the major specialist children’s hospital for families living in Queensland and northern New South Wales. The hospital provides care to the state’s sickest and most critically injured children who need highly specialised care.\n\nLady Cilento Children’s Hospital is also the local children’s hospital for families who live in our catchment area in inner Brisbane.\n\nTo find your closest hospital offering general paediatric care in the South East Queensland area, visit our Hospital catchments page.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/la-trobe-financial-814263", "employer_name": "La Trobe Financial", "employer_info": "La Trobe Financial is one of Australia's leading credit specialists assisting those under-served by traditional institutions for property finance or investment returns on investable cash. If your goal is financial independence through home ownership or better investing for your cash savings then speak with the team who have been looking out for others since 1952. \n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/la-trobe-university-432458", "employer_name": "La Trobe University", "employer_info": "La Trobe will be a University known for its excellence and innovation in relation to the big issues of our time, and for its enthusiasm to make a difference. La Trobe will be one of the top three Universities in Victoria, one of the top dozen nationally and one of the top 300 internationally. Without question all students and staff at La Trobe have the right to peaceful protest. Debate – and dissent - is healthy, and the La Trobe community rightly thrives on rigorous and spirited discussion about the University's direction.                              \nSource: this is an extract from the company's own website"},
{"employer_url": "https://www.seek.com.au/companies/la-salle-college-800396", "employer_name": "La Salle College", "employer_info": "Welcome to La Salle College\nA Co-educational Secondary Catholic College for students in Years 7-12\n\n\nLa Salle College is a coeducational secondary Catholic college founded by the De La Salle Brothers in 1954. Situated in the Swan Valley region of Western Australia, the College caters for the educational, spiritual and pastoral care needs of over 1400 students in Years 7-12. \n \nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/la-rosa-the-strand-834766", "employer_name": "La Rosa The Strand", "employer_info": "WELCOME\n\n \nLa Rosa The Strand by Pendolino is an elegant wine bar and restaurant located in Sydney’s historic Strand Arcade.\n\nLittle sister to the iconic Restaurant Pendolino, La Rosa profiles premium, boutique Italian wines, that are hand-picked annually from Italy.\n\nThe Restaurant features a range of premium local and imported ingredients and artisanal age-old Italian cooking methods to present a unique and authentic  Italian dining experience with all our breads and pastas hand–made daily in house.  \n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/la-rumbla-ristorante-929950", "employer_name": "La Rumbla Ristorante", "employer_info": "Our purpose is to create a truly splendid experience for each customer’s entire visit – from the moment of entry to the point of departure, and to provide customers with an unforgettable venue to connect with family and friends in a warm and inviting atmosphere.\nSince 2006 La Rumbla has firmly established itself as a unique suburban dining experience attracting locals and visitors from afar. We serve delicious and creative Italian inspired cuisine which is comprised of the best quality seasonal produce and fresh local ingredients.\n \nAt La Rumbla, there is something for everyone. Our inviting and modern restaurant is the perfect venue for a relaxing after-work meal, a special occasion which calls for a three course meal served with great wine, or simply a place to go for coffee and dessert.\n \nWe pride ourselves on customer service. Over the years La Rumbla has received many awards, voted by its own customers as a result of this. Our passion for quality food and service is unlimited. Come and experience this for yourself.\n \nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/la-prairie-group-814894", "employer_name": "La Prairie Group", "employer_info": "Our Products\nHigh-quality, innovative and luxurious products, developed in Switzerland with a clear focus on skincare.\n\nHead Quarters\nOur headquarters are located in Volketswil, near Zurich, in Switzerland.\nWe have more than 1000 employees worldwide and approximately 150 staff at our headquarters. We have a multinational workforce who continuously strive to deliver the most groundbreaking scientific innovations, as well as the ultimate in global luxury skincare.\n\nFrom Swiss Heritage to a Global Brand\nToday we have 14 affiliated companies worldwide, and a selective distribution network in more than 90 countries.\nLa Prairie stands for a unique combination of advanced science, sumptuous formulas and the meticulous attention to the details of luxury. \nLa Prairie Group AG is 100% owned by Beiersdorf AG, Hamburg (Germany) since 1990, and it is the luxury tier of Beiersdorf AG. \nThe origins of the company date back to 1954, with the foundation of Juvena (International) AG in Zurich.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/la-casa-del-formaggio-929375", "employer_name": "La Casa Del Formaggio", "employer_info": "La Casa Del Formaggio is a South Australian family owned and operated  business that crafts and sells a range of premium Italian style fresh cheeses. Our Cheese factory in Glynde, South Australia, boasts a purpose-built, first-class facility that services the retail, food service and industrial markets. We adhere to a strictly documented Quality Assurance system, subject to third party audits on a regular basis. La Casa Del Formaggio’s success can be attributed to the work ethic instilled in us by our founders, our commitment to superior quality products and our prioritization of customer service.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/la-grange-remote-community-school-871389", "employer_name": "La Grange Remote Community School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/lek-consulting-437805", "employer_name": "L.E.K. Consulting", "employer_info": "L.E.K. is a global strategy consulting firm with offices across Europe, the Americas and Asia-Pacific. We counsel our clients on their key strategic issues, leveraging our deep industry expertise and using analytical rigor to help them make informed decisions more quickly and solve their toughest and most critical business problems. Whether it's a global pharmaceutical company evaluating its strategy in the face of an impending revenue “cliff” from loss of patent exclusivity on key products; an airline seeking new revenue sources in a challenging deregulated industry; or a global footwear company repositioning its brands, our clients rely on L.E.K. to help them meet their toughest challenges, and take advantage of their biggest opportunities. \n\nSource: this is an extract from the company’s own website"},
{"employer_url": "https://www.seek.com.au/companies/la-porchetta-432615", "employer_name": "La Porchetta", "employer_info": "\n\n"},
{"employer_url": "https://www.seek.com.au/companies/landt-infotech-433788", "employer_name": "L&T INFOTECH", "employer_info": "L&T Infotech is a global IT services and solutions provider. We provide the winning edge to our clients by leveraging our Business-to-IT Connect and Deeply Committed People. Our parent company is Larsen & Toubro Ltd. (L&T), a technology, engineering, manufacturing and construction conglomerate, with global operations. This rich corporate heritage has given us many inherent advantages that we translate into tangible benefits for our clients.\n\nSource: this is an extract from the company’s own website"}
]