[
{"employer_url": "https://www.seek.com.au/companies/q-catering-753187", "employer_name": "Q Catering", "employer_info": "Q Catering is a premium full service flight caterer, operating five catering and food production centres across Australia. And while large-scale catering is our specialty, so is microscopic attention to detail, freshness, innovation – and a distinctively Australian can-do approach. Q Catering and Snap Fresh together comprise Qantas Catering Group, which is a wholly owned subsidiary of Qantas Airways. \nWe cater for a variety of customers, from premium full service airlines, airlines targeting leisure travellers, and those looking for crew meal options. While we're experts in supporting the in-flight experience, we also have great relationships with airport lounges, hospitals and nursing homes. \n\n Some of our customers include Qantas International and Domestic, QantasLink, Singapore Airlines, Thai Airways, Cathay Pacific, Philippine Airlines and Vietnam Airlines. \nSource: This is an extract from the company's own website"},
{"employer_url": "https://www.seek.com.au/companies/queensland-audit-office-819953", "employer_name": "Queensland Audit Office", "employer_info": "he Queensland Audit Office is the independent auditor of the Queensland public sector.\n\nWe conduct financial audits and performance audits to provide public confidence in the reliability of public sector entity financial statements and operating performance. Through our audit work, we make recommendations that promote accountability and transparency in government, and improvements in service efficiency and effectiveness. We take a constructive approach to how we engage with our clients.\nOur unique position provides us with visibility across the entire public sector of matters impacting financial performance and our audit mandate provides us with access to the information we need to develop an evidence-based understanding of operating performance.\nOur vision is for better public services for Queenslanders. We strive to use our unique position and mandate to achieve this vision.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/queensford-college-803424", "employer_name": "Queensford College", "employer_info": "As a Registered Training Organisation (RTO), Queensford College offers accredited courses which lead to nationally-recognised qualifications. All of our academic programs are accredited with the Australian Skills Quality Authority (ASQA). These courses provide the appropriate competency outcomes and satisfactory basis for assessment and they meet national quality assurance requirements. Queensford College is registered with the Commonwealth Register of Institutions and Courses for Overseas Students (CRICOS).\n\nSource: This is an extract from the company’s own website."},
{"employer_url": "https://www.seek.com.au/companies/queensland-academy-for-creative-industries-820584", "employer_name": "Queensland Academy for Creative Industries", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/queensland-academy-for-science-mathematics-and-technology-820193", "employer_name": "Queensland Academy for Science Mathematics and Technology", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/queensland-ambulance-service-433057", "employer_name": "Queensland Ambulance Service", "employer_info": "The objective of the Queensland Ambulance Service (QAS) is to provide timely and quality ambulance services which meet the needs of the Queensland community.\n\nQAS is an integral part of the primary health care sector in Queensland, providing patient transport services and emergency pre-hospital care to the Queensland community.\n\nQAS provides timely and quality ambulance services which meet the needs of the community by providing pre-hospital ambulance response services, emergency and routine pre-hospital patient care and transport services, co-ordination of aero medical services, inter-facility ambulance transport, planning and coordination of multi-casualty incidents and disasters, and casualty room services.\n\nSource: this is an extract from the company’s own website"},
{"employer_url": "https://www.seek.com.au/companies/queensland-academy-for-health-sciences-819574", "employer_name": "Queensland Academy for Health Sciences", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/queensland-art-gallery-437497", "employer_name": "Queensland Art Gallery", "employer_info": "The Queensland Art Gallery | Gallery of Modern Art (QAGOMA) is a single institution located across two adjacent river-side buildings in the Cultural Precinct at Brisbane's South Bank. Our vision is to be the leading institution for the contemporary art of Australia, Asia and the Pacific. \n\nQAGOMA holds a Collection of over 17,000 works of historical, modern and contemporary art, and stages a dynamic program of Australian and international exhibitions. We are home to the Children's Art Centre which collaborates on interactive artworks with leading artists from around the world, and the Australian Cinémathèque, the only dedicated cinema facility in an Australian art museum. \n\nQAGOMA operates its own retail outlets and cafes and restaurants, proceeds from which support the Gallery.\n\nSource: This is an extract from the company’s own website."},
{"employer_url": "https://www.seek.com.au/companies/queensland-alumina-limited-435457", "employer_name": "Queensland Alumina Limited", "employer_info": "Queensland Alumina Limited (QAL) is one of the largest alumina refineries in Australia. We commenced production in March 1967 making us Australia's first alumina refinery. We produce some 3.80 million tonnes of the world's best smelter grade alumina per year.\n\nOur refinery is located in the city of Gladstone, Queensland. Our operations include a wharf and storage facility on South Trees Island. \n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/queens-wharf-brisbane-795806", "employer_name": "Queen's Wharf Brisbane", "employer_info": "Get ready for Brisbane’s new entertainment and lifestyle precinct\n\nA new world-class integrated resort development is being constructed that will put Brisbane on the map as a tourism, leisure and entertainment destination.\n\nExpected to open in 2022, Queen’s Wharf Brisbane will transform the CBD and river’s edge with an iconic design that embraces Brisbane’s inviting subtropical climate and celebrates the precinct’s Indigenous and European heritage with interpretive trails and experiences spanning the Brisbane River and ridgeline.\n\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/queens-college-university-of-melbourne-803412", "employer_name": "Queen's College (University of Melbourne)", "employer_info": "We  aim to provide the best possible environment for students to pursue their studies at university\nQueen’s College is an academic residential community that consists of students (both undergraduate and postgraduate), tutors, fellows, professionals and staff, and a number of non-resident members. Most students residing at Queen’s attend the University of Melbourne. Others also attend RMIT City Campus (excludes Brunswick) and Monash University’s Faculty of Pharmacy and Pharmaceutical Sciences.\n\nOur aim is to provide the best possible environment for students to pursue their studies at university. We do this by providing accommodation and a comprehensive tutorial program that complements the University curriculum. Students also benefit from living with graduates, post-graduates and professionals who are able to share their expertise and experiences. An extensive and diverse sporting and cultural program allows students to pursue their non-academic interests, as well as trying out new ones.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/queens-park-primary-school-873002", "employer_name": "Queens Park Primary School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/queens-beach-state-school-819600", "employer_name": "Queens Beach State School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/queechy-high-school-873000", "employer_name": "Queechy High School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/queen-victoria-care-952465", "employer_name": "Queen Victoria Care", "employer_info": "WELCOME\nQueen Victoria Home offers a wide range of services and facilities and a number of housing options and solutions.\nWe understand that to leave the familiar environment of your own home can be an extremely difficult decision, so we encourage you and your family to book in for a guided tour of Queen Victoria Home. This will provide you with the opportunity to find out more about the facilities we offer, to view accommodation options and will also help to make the transition a little easier.\nQueen Victoria Home staff are committed to providing support to enable you to live your life with security as well as facilitating your social needs to the degree that you choose. You may live with as much independence and privacy as you choose or you may take part in as many activities as you wish. Every resident is free to contribute to the daily affairs of their Home.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/queen-elizabeth-ii-jubilee-hospital-821541", "employer_name": "Queen Elizabeth II Jubilee Hospital", "employer_info": "The Queen Elizabeth II Jubilee Hospital (QEII) is a medium metropolitan adult facility providing a range of inpatient and outpatient services and a 24-hour emergency department. We are supported by local Community Health Centres at Eight Mile Plains, Mount Gravatt, Corinda and Inala.\n\nServices we provide\nWe provide a range of specialties including general medicine, surgery, cardiology, geriatric medicine, gynaecology, orthopaedics, intensive and coronary care, neurology, gastroenterology, urology and respiratory medicine.\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/quintiq-816816", "employer_name": "Quintiq", "employer_info": "To solve the world’s planning puzzles using a single platform\nEvery business has its planning puzzles, some large, some complex, some seemingly impossible to solve. Quintiq’s vision is to solve every one using a single platform. That vision has driven the development of Quintiq software since the first line was coded back in 1997. Our vision is transforming the world’s supply chains.\n\n\nAny planning puzzle\nQuintiq engineers built the platform to fit any conceivable business model. That’s why we’re able to offer a 100% fit to every customer.\n\nAny size \nHundreds of users can interact with the system in real time, no matter what processes are running in the background. And it’s easy to make changes to the system to reflect changes in your business model as your business grows.\nAny plan\nToo often in large organizations, planners and managers are disconnected in their planning decisions. And many organizations are overwhelmed by the number of spreadsheets they’re using to make sense of it all.\n\nSource: This is an extract from the company’s own website."},
{"employer_url": "https://www.seek.com.au/companies/quirks-australia-796955", "employer_name": "Quirks Australia", "employer_info": "Established in 1931, Quirks Australia is a nationwide company offering a diverse range of refrigeration, hospitality and catering equipment, to remote displays, fridges and freezers. From single door refrigerators to custom designed cool rooms, Quirks offers the complete solution.\n\nSales, \nRentals, \nService, \nLogistics, \nCustom Design, \nInstallations.\nQuirks has branches located across Australia and can arrange a preventative maintenance program or an emergency breakdown service regardless of your location.\nSource: this is an extract from the company’s own website"},
{"employer_url": "https://www.seek.com.au/companies/quinns-rocks-primary-school-873005", "employer_name": "Quinns Rocks Primary School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/quikstrike-437163", "employer_name": "Quikstrike", "employer_info": "QuikStrike Brand Ambassadors is a promotional staffing and talent agency providing staffing solutions for a wide range of experiential campaigns, promotions and events nationally.\n\nQuikStrike was first established in 2005 and has grown significantly since. We have an experienced internal team of Campaign Managers and Coordinators and access to over 2000 fully trained and and inducted promotional staff nationally including brand ambassadors, supervisors, event managers, models and actors.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/quinalow-prep-10-state-school-819944", "employer_name": "Quinalow Prep-10 State School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/quiksilver-433298", "employer_name": "Quiksilver", "employer_info": "The Quiksilver logo, a cresting wave and snow-capped mountain, has become a marque of excellence. Since 1969, Quiksilver has maintained its commitment to quality and performance, and taken this message around the world. Born on the beach, Quiksilver’s core concept of fashion with function has now been embraced by all who enjoy active outdoor lifestyles.\n\nThe cresting wave and snow capped mountain logo symbolises excellence and authenticity. The logo was inspired by a famous Japanese woodcut depicting a typhoon wave and Mt Fuji."},
{"employer_url": "https://www.seek.com.au/companies/quilpie-state-college-820245", "employer_name": "Quilpie State College", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/quickflix-436128", "employer_name": "Quickflix", "employer_info": "Quickflix is the original movie & TV streaming service in Australia and New Zealand, with a large selection of subscription movies & TV shows to stream direct to smart TV's, game consoles, Blu-ray players, desktops, laptops, tablets, smartphones and other connected devices like Chromecast. Our Premium collection offers the latest movies to digitally rent and the latest TV shows to digitally own.\n\nQuickflix also offers DVD & Blu-ray subscriptions. Choose from our library of over 60,000 movies & TV shows to rent on DVD & Blu-ray and have the discs delivered straight to your letterbox throughout all of Australia. Unlimited disc exchanges with no lock-in contacts, no postage costs and no late fees.\n\nQuickflix is listed on the ASX (QFX).\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/quicksilver-group-814682", "employer_name": "Quicksilver Group", "employer_info": "A pioneering reef tourism operator, the Quicksilver Group is Australia’s leading Great Barrier Reef cruise company and one of North Queensland’s largest private employers.\n13 major vessels\n4 reef activity platforms\n550 local employees.\nChoose from spectacular Outer Barrier Reef and island destinations, adventurous dive and snorkel excursions, premier liveaboard dive boat trips and a luxury island resort - the Quicksilver Group offers the widest range of reef experiences to visitors to Tropical North Queensland.\nProudly, we are Australia’s most awarded reef cruise company. With Cairns and Port Douglas-based operations the Quicksilver Group comprises:\nQuicksilver’s iconic Outer Reef Cruises to Agincourt Reef\nWavedancer Low Isles Sailing Cruises\nGreat Adventures Reef and Green Island cruises\nSilver Series adventure dive and snorkel day trips\nOcean Spirit Michaelmas Cay Cruises\nPoseidon Dive & Snorkel Cruise\nPro Dive Cairns liveaboard trips and dive courses\nEco-sensitive Green Island Resort.\nThe philosophy of in-house services encompasses our committed approach to quality and includes our Reef Biosearch environmental division, diving, catering and fleet maintenance divisions.\n\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/quickstep-technologies-814542", "employer_name": "Quickstep Technologies", "employer_info": "Quickstep is an Australian listed company ASX:QHL at the forefront of advanced composites manufacturing and technology development.\n\nQuickstep is the largest independent aerospace-grade advanced composite manufacturer in Australia. We manufacture using both traditional autoclave and leading edge out-of-autoclave production technologies for aerospace and automotive. Alongside our manufacturing headquarters at Bankstown Aerodrome - New South Wales, Quickstep also has a manufacturing and R&D facility at Deakin University, Waurn Ponds, Geelong in Victoria and a Quickstep Process development facility in Europe.\n\nWe are currently partnering with some of the world’s largest aerospace/defence organisations, including the US Department of Defense, Lockheed Martin, Northrop Grumman, Airbus, Thales, BAE and Ford.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/quick-corporate-australia-814551", "employer_name": "Quick Corporate Australia", "employer_info": "\n\n\n"},
{"employer_url": "https://www.seek.com.au/companies/quest-software-803443", "employer_name": "Quest Software", "employer_info": "We are on a quest to make your information technology work harder for you. That’s why we build community-driven software solutions that help you spend less time on IT administration and more time on business innovation. We help you modernize your data center, get you to the cloud quicker and provide the expertise, security and accessibility you need to grow your data-driven business. Combined with Quest’s invitation to the global community to be a part of its innovation, as well as our firm commitment to ensuring customer satisfaction, we will continue to deliver solutions that have a real impact on our customers today and leave a legacy we’re proud of\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/quinns-beach-primary-school-873004", "employer_name": "Quinns Beach Primary School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/quintiles-434409", "employer_name": "Quintiles", "employer_info": "Over the past three decades, Quintiles has pioneered new wats to tackle big healthcare challenges, starting with the way new drugs are developed. Born from the spark of statistical insight in a small university trailer, our company has grown significantly and strategically. Still our goal remainss the same: to make a meaningful difference in health and patient outcomes                           \n\nSource: this is an extract from the company’s own website"},
{"employer_url": "https://www.seek.com.au/companies/quest-college-803440", "employer_name": "Quest College", "employer_info": "Our mission is to empower people, change lives, and give back to our community by creating vocational and employment pathways through education, innovation and learning. Our focus is people, not numbers. We take pride in delivering training to a broad range of students with varying backgrounds and learning styles. Our credible trainers, mentors and assessors are industry qualified and thrive on working with students to achieve their educational, employment and life goals.\n\nSource: This is an extract from the company’s own website."},
{"employer_url": "https://www.seek.com.au/companies/quest-carpet-manufacturers-952480", "employer_name": "Quest Carpet Manufacturers", "employer_info": "Established in 1978, Quest Carpet Manufacturers specialise in the manufacture of high quality carpets. All of our products are produced in our purpose built Melbourne facility, and we distribute throughout Australia and New Zealand via our dealer network. \n\nHighly regarded from our peers in the industry, our focus is and always has been on our service to the industry and our customers, and producing outstanding quality carpets to suit all budgets and installations. \n\nQuest will continue to embrace new technologies and to create appealing products utilizing the latest manufacturing equipment and varying raw materials. \n\nOur mission:\n\nTo be the leader in the industry in providing quality carpets whilst maintaining exceptional customer/consumer relations. \n\nMade in Australia\nmade in Australia \nQuest Carpet is proudly made in Dandenong Victoria, so you can be confident they are made to our high Australian standards. What's more you're not only supporting local jobs and our economy, but you can rest assured we are only a phone call away. \nSource: This is an extract from the company's own website"},
{"employer_url": "https://www.seek.com.au/companies/quest-apartment-hotels-433626", "employer_name": "Quest Apartment Hotels", "employer_info": "Quest Apartment Hotels is the largest and fastest growing apartment hotel brand in Australasia with a network of over 160 locations across Australia, New Zealand and Fiji.  With an unrivaled locational presence, Quest leads the market in providing accommodation solutions for the extended stay corporate traveler among Australia's top 500 corporates."},
{"employer_url": "https://www.seek.com.au/companies/queenslanders-credit-union-798789", "employer_name": "Queenslanders Credit Union", "employer_info": "Queenslanders Credit Union has provided banking services to our local communities for over 50 years, but we can very proudly say we’re not a bank.\n\nWe’re 100% Australian and owned by our customers. As we don’t need to make massive profits to keep shareholders happy, our sole focus is providing the best possible products and services, while giving back to the community.\n\nIt’s all part of our promise to provide banking that’s personal\n\nSource: this is an extract from the company’s own website."},
{"employer_url": "https://www.seek.com.au/companies/queenwood-school-for-girls-834800", "employer_name": "Queenwood School for Girls", "employer_info": "Through involvement in a broad range of activities and experiences, girls experience the joys of teamwork and success. They also experience uncertainty, risk and a healthy quantum of stress which, with the right support, will develop the confidence and resilience which will equip them as young woman to move into the adult world. This approach is reflected in our motto: Per Aspera ad Astra (‘through struggles to the stars’).\n\nAt the same time, we encourage girls to look outward and develop connections with others, whether through their involvement in community service, the School’s long-term commitment to education projects in Cambodia or thoughtful reflection on their place in our community, nation and world.\nQueenwood was founded in 1925 as a unique place of education for girls, dedicated to giving every student the opportunity to reach her full potential. This guiding principle remains as relevant to Queenwood today as it was then.\n\nFrom its location on Sydney’s lower north shore, Queenwood offers a special educational experience, combining a rich heritage with a rounded curriculum and a commitment to teaching excellence and innovation.\n\nQueenwood is best defined by its distinctive ethos. This is characterised by collaborative learning and personal development, a focus on care and compassion for others, and encouragement for girls to be the best they can be.\n\nA challenging curriculum, including the International Baccalaureate as an option in senior years, is complemented by a full sporting, pastoral and co-curricular program in shaping girls into confident, self-aware young women.\nQueenwood is an internationally minded K to 12 school for girls offering a contemporary liberal education. We aim to develop students who have the intellectual rigour, independence, character and skills to contribute sustainably to the world.\n\nQueenwood Values:\n\nTRUTH\n\nCOURAGE\n\nSERVICE\nSource: this is an extract from the company’s own website."},
{"employer_url": "https://www.seek.com.au/companies/queensland-urban-utilities-432972", "employer_name": "Queensland Urban Utilities", "employer_info": "We are the fourth largest water distributor-retailer in Australia, supplying drinking water, recycled water and sewerage services to a population of more than 1.4 million in South East Queensland. Each year Urban Utilities; supply around 136,000ML of tap water to 524,000 residential dwellings and 37,000 commercial properties supply around 9,700ML of recycled water to 114 businesses remove and treat around 107,000ML of sewage from 500,000 residential dwellings and 34,000 commercial properties, including 5,400 trade waste customers respond to more than 24,000 written customer enquiries answer more than 290,000 customer phone calls- these services are delivered via their $5 billion infrastructure network.        \nSource: this is an extract from the company's own website"},
{"employer_url": "https://www.seek.com.au/companies/queensland-treasury-corporation-435687", "employer_name": "Queensland Treasury Corporation", "employer_info": "As the Queensland Government’s central financing authority, Queensland Treasury Corporation (QTC) plays a pivotal role in securing the State’s financial success.\n\nWith a focus on whole-of-State outcomes, QTC provides a range of financial services to the State and its public sector entities, including local governments. These services include:\n\ndebt funding and management\ncash management facilities\nfinancial risk management advisory services, and\nspecialist public finance education.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/queensland-x-ray-436305", "employer_name": "Queensland X-Ray", "employer_info": "We have more than 40 practices across Brisbane, Ipswich, the Gold Coast, Toowoomba, the Darling Downs, Mackay, Townsville and Cairns.\n\nWe have the most experienced team of radiologists and nuclear imaging specialists in Queensland. Our radiologists lead a caring team of professionals from the technical, nursing, and admin support fields who are all focused on providing the best service, care and clinical outcomes for you.\n\nWe know that health care is not a “one size fits all” solution – your healthcare, illness and injury can range from being routine to the life-threatening.\n\nWe’ve built our teams and our practices to meet all these needs from routine radiology, to complex and interventional services, through to highly specialised services.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/queensland-treasury-436967", "employer_name": "Queensland Treasury", "employer_info": "Queensland Treasury is dedicated to delivering prosperity for Queenslanders now and into the future. We pursue this through our strategic priorities to:\n\nsupport economic growth, job creation and fiscal strength\nimprove services for Queenslanders\nempower our people\nensure safe, productive and fair workplaces.\nOur remit encompasses a range of critical functions including:\n\nmanaging Queensland's finances\nadministering grants and collecting taxes\nproviding economic and commercial advice to government\nprocuring infrastructure\nkeeping workplaces safe and fair through the Office of Industrial Relations.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/queensland-sugar-952393", "employer_name": "Queensland Sugar", "employer_info": "QSL is responsible for marketing the majority of Australia’s raw sugar exports each year and has supply contracts in place to continue to do so until mid-2017.\n\nWe manage the sugar export program as a pooling system, which is underpinned by the cooperation of seven Australian milling companies and the 3000+ Australian cane growers who supply them.\n\nFor international customers, QSL's innovative pooling system provides security of supply and a direct line of sight back to the origin of their raw sugar purchases. QSL’s reliable and consistent supply of quality raw sugar comes with superior service and product knowledge at a competitive price.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/queensland-theatre-company-437476", "employer_name": "Queensland Theatre Company", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/queensland-state-emergency-service-806709", "employer_name": "Queensland State Emergency Service", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/queensland-state-emergency-service-435168", "employer_name": "Queensland State Emergency Service", "employer_info": "The State Emergency Service is a national organisation of volunteers - 'ordinary people doing extraordinary things'.\n\nThe Queensland SES consists of thousands of 'unpaid' volunteers from a variety of backgrounds and professions who respond to emergencies and disasters across the State, 24/7.\n\nThey are trained and equipped to help their communities across a range of functions, and their primary purpose is to assist the most vulnerable members of the community.\n\nThe SES is designed to empower people to help themselves and others in their community in times of emergency and disaster. The basic concept is one of self-help and mutual assistance within each community.\nSource: This is an extract from the company’s own website."},
{"employer_url": "https://www.seek.com.au/companies/queensland-state-archives-820424", "employer_name": "Queensland State Archives", "employer_info": "Queensland State Archives (QSA) connects Queenslanders with their past - the histories of their families, the local community and the state - by ensuring that the significant records of government are available and accessible.\n\nEstablished in 1959, the archival collection comprises millions of public records dating back to the early Moreton Bay penal settlement of 1823.  \nPublic records form the cornerstone of government accountability. They provide unique evidence and context of the actions and decisions taken by governments over time. Through the Public Records Act 2002, we support democracy and government integrity; maintaining the corporate memory of government by overseeing the making and keeping of Queensland's public records. \n\nAs the state’s lead agency for government recordkeeping, we offer practical recordkeeping advice and tools to over 500 Queensland public authorities. \n\nQSA is a business unit of the Department of Science, Information Technology and Innovation. \nSource: this is an extract from the company’s own website."},
{"employer_url": "https://www.seek.com.au/companies/quilpie-hospital-821564", "employer_name": "Quilpie Hospital", "employer_info": "Quilpie provides 24-hours a day, seven days a week acute and emergency care, community care srvices, retrievals with the Royal Flying Doctor Service and dedicated flexible care places, which can be delivered in the community or at Quilpie Multi Purpose Health Service.\n\nBasic podiatry services are provided to community members through a home-visit program run by a trained registered nurse at Quilpie.\n\nA suite of allied health services regularly visits Quilpie, including dental, occupational therapy, dietetics, social work, speech therapy, early intervention parenting program, child development, mental health, alcohol and drugs.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/queensland-sport-and-athletics-centre-795830", "employer_name": "Queensland Sport & Athletics Centre", "employer_info": "QSAC is one of nine major sporting and entertainment facilities owned and operated by Stadiums Queensland.\n\nEmployment opportunities are advertised on the Stadiums Queensland website.  Click here to view current opportunities at all Stadiums Queensland venues.\n\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/queensland-police-museum-795822", "employer_name": "Queensland Police Museum", "employer_info": "Every day the Queensland Police Service, your police service, works tirelessly to ensure the safety and security of the community.\n\nPolice officers around the state show courage and dedication in exercising their duties.\n\nWe don’t seek credit for this work. It is our job.\n\nWe only ask that the community joins with us to stop crime, make the community safer and build relationships.\n\nIt is pleasing that in many areas this is happening on a daily basis.\n\nAs with any large organisation, there are plenty of people who support us and others who do not always agree with everything we do.\n\nI ask that the community make up their own minds.\n\nIn addition to the traditional methods of sharing details about our organisation and its work a large amount of our information is now available at your fingertips.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/queensland-nurses-union-952353", "employer_name": "Queensland Nurses Union", "employer_info": "The QNU represents the industrial, professional, social, political and democratic interests of its members\n We have a long and proud history of advocating for nurses and midwives and for those in their care. \nThe Queensland Nurses' Union (QNU) is the industrial and professional organisation for nurses and midwives working in public and private health and aged care in Queensland. \n\n\n\nThe QNU seeks to promote and defend the industrial, professional, social, political and democratic interests of more than 53,000 members.\n\n\n\nMembers include:\n•Registered nurses\n•Midwives\n•Enrolled nurses\n•Assistants in nursing (however titled)\n•Students\n•Anyone who undertakes nursing work\n\nThere is no other organisation in Queensland which provides comprehensive representation for nurses and midwives as both employees and professionals.\n\n\n\nThe QNU is a state-registered union and a branch of the Australian Nursing and Midwifery Federation (ANMF), which has branches in each state and territory, which means the Union is also active in promoting the interests of nurses and midwives on a national and international level. Membership of the QNU also provides for full membership of the ANMF.\n\n\n\nMembers have the opportunity to be actively involved in the QNU and decide our priorities through the Union’s democratic structure. Ultimately, it’s these priorities and policies which help influence and shape the practice of nursing and midwifery in Queensland. Nurses and midwives, through the QNU, have a long and proud history of working together to achieve improvements to working conditions, to the profession and, through the broader union movement, to the lives of all Australians.\n\n\n\nNurses and midwives continue to work together and pool their combined resources and knowledge to protect and further the common interests of all members.\nSource: This is an extract from the company's own website"},
{"employer_url": "https://www.seek.com.au/companies/queensland-performing-arts-centre-qpac-438664", "employer_name": "Queensland Performing Arts Centre (QPAC)", "employer_info": "QPAC is governed by a Board of Trustees appointed by the Queensland Government. In collaboration with the Trustees, QPAC is managed by an Executive Group that is responsible for the operations and the achievement of the Centre's strategic priorities.\nQPAC is a Statutory Authority of the Queensland Government with its responsibilities set out in the Queensland Performing Arts Trust Act 1977.\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/queensland-parks-and-wildlife-service-819370", "employer_name": "Queensland Parks & Wildlife Service", "employer_info": "The Department of National Parks, Sport and Racing is committed to a vision that Queenslanders are enriched and connected through healthy parks and active lifestyles.\n\nThe department’s key priorities are to:\n\nProtect and manage our parks, forests and the Great Barrier Reef for current and future generations.\nSupport and encourage active participation in physical activity.\nSupport the Queensland racing industry.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/queensland-nickel-434232", "employer_name": "Queensland Nickel", "employer_info": "Queensland Nickel operates the Palmer Nickel and Cobalt Refinery which is located 25 kilometres north-west of Townsville, in Queensland, Australia.\nQueensland Nickel is a leader in the production and marketing of high quality nickel and cobalt and our environmental and quality assurance systems are ISO certified.\nThe Palmer Nickel and Cobalt Refinery processes nickel and cobalt-bearing laterite ores purchased from third party mines in New Caledonia, Indonesia and the Philippines. The Nickel ore is dried, ground, roasted and leached in an ammonia solution to extract the nickel and cobalt in the processing plant. Nickel and cobalt are then separated and further refined in the metal refining area to produce products for sale in the global market.\n\nSource: this is an extract from the company’s own website"},
{"employer_url": "https://www.seek.com.au/companies/queensland-museum-437239", "employer_name": "Queensland Museum", "employer_info": "Queensland Museum is a museum of natural history, cultural heritage, science and human achievement that tells the changing story of Queensland. \n\nThe Museum houses permanent and changing exhibitions and also provides in-depth education experiences, innovative public programs, early childhood activities and entertaining holiday activities. We aim to connect visitors to Queensland, its people and Queensland’s place in the world - past, present and future, through exhibitions, displays and public programs.  \n\nBehind the scenes, the Museum is home to millions of objects, specimens and artefacts that tell the changing story of Queensland.  \n\nA popular destination for South East Queenslanders as well as visitors from around Australia and overseas, the Museum has welcomed over 10 million visitors since it was established at its current site at South Bank over 20 years ago.\n\nPart of Brisbane's Cultural Precinct, Queensland Museum is within walking distance of the Queensland Art Gallery, Gallery of Modern Art, Queensland Performing Arts Centre and the State Library of Queensland. The Cultural Precinct sits alongside South Bank, a vibrant mix of parkland, recreational and commercial space on the Brisbane River across from the Central Business District.  \n\nLocated at the Museum, the Sciencentre offers an exciting, experience-rich environment that is contemporary, user-friendly and inspiring.\n\nSource: this is an extract from the company’s own website."},
{"employer_url": "https://www.seek.com.au/companies/queensland-police-service-432494", "employer_name": "Queensland Police Service", "employer_info": "Every day the Queensland Police Service, your police service, works tirelessly to ensure the safety and security of the community.\n\nPolice officers around the state show courage and dedication in exercising their duties.\n\nWe don’t seek credit for this work. It is our job.\n\nWe only ask that the community joins with us to stop crime, make the community safer and build relationships.\n\nIt is pleasing that in many areas this is happening on a daily basis.\n\nAs with any large organisation, there are plenty of people who support us and others who do not always agree with everything we do.\n\nI ask that the community make up their own minds.\n\nIn addition to the traditional methods of sharing details about our organisation and its work a large amount of our information is now available at your fingertips.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/queensland-mortgage-advisory-service-952345", "employer_name": "Queensland Mortgage Advisory Service", "employer_info": "QMAS delivers successful strategies for people looking to source the best finance solutions from a panel of over 25 lenders. \nWe form part of a group of companies that manage a client base significantly in excess of one billion dollars throughout Queensland , Victoria & New South Wales. This has been achieved through successful mortgage management and a proven track record of consistency. Queensland Mortgage Advisory Service delivers high quality service and products to our clients. \n\nAt Queensland Mortgage Advisory Service Pty Ltd, our focus is to continually meet the ever changing needs of our clients with quality service, advice, product selection and negotiation.\n\nSince the inception of our original mortgage broking arm in 1997 our organisation has evolved to include not only professional advice in respect of residential loans but also expert guidance in the provision of finance for the acquisition of investment properties.\nSource: This is an extract from the company's own website"},
{"employer_url": "https://www.seek.com.au/companies/queensland-motorways-433968", "employer_name": "Queensland Motorways", "employer_info": "Network benefits\n\nThe go via network offers motorists travel time savings, reliability and real-time traffic updates, enabling motorists greater travel time certainty.\n\nFind out more about the benefits of the go via network.\n\nSafety\n\nOur 24/7 traffic monitoring, rapid incident response and rigorous ongoing maintenance programs ensure our roads is not only reliable but safe. The go via network has significantly lower rates of incident and injury than broader public road network.\n\nFind out more about the safety features of our network.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/queensland-law-society-814652", "employer_name": "Queensland Law Society", "employer_info": "As an incorporated society under the Legal Profession Act 2007, we hold specific statutory responsibilities which are governed by an elected Council. Council also works to ensure members' views are heard and represented to key stakeholders. The day-to-day operation of the Society is the responsibility of the Chief Executive Officer who is assisted by the Executive Team.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/queensland-injectors-health-network-952327", "employer_name": "Queensland Injectors Health Network", "employer_info": "QuIHN is a statewide, not for profit, and non-government health service which provides a variety of health services to illicit drug users throughout Queensland.\n\nQuIHN, through its members, board of management, staff and volunteers promote the health and well-being of people who currently use illicit drugs, those who have used illicit drugs in the past, and members of the community touched or affected by illicit drug use.\n\nQuIHN provides medical services, needle syringe programs, counselling, support services, distribution of information, education and training, workforce development initiatives, life skills programs and services that relate to illicit drug use, blood borne viruses, sexual health and other psychological and physical health issues.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/queensland-heritage-council-819496", "employer_name": "Queensland Heritage Council ", "employer_info": "Established under the Queensland Heritage Act 1992 the Queensland Heritage Council is required to act independently, impartially and in the public interest to identify and protect places that have special heritage value to the community and future generations.\n\nThe Queensland Heritage Council’s most public role is deciding what is entered in and removed from the Queensland Heritage Register.\n\nThe Heritage Council also:\n\nprovide strategic advice to the government about cultural heritage matters\nprovide information to the community to encourage an understanding of Queensland’s cultural heritage\nencourage appropriate management of places of cultural heritage significance\nadvocate on behalf of owners of heritage places\nassess applications for development of state-owned heritage places.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/queensland-international-institute-952329", "employer_name": "Queensland International Institute", "employer_info": "Queensland International Institute (Qii) is a Registered Training Organisation (RTO). We are situated in the CBD of Brisbane City, Queensland, Australia, and are registered with the Commonwealth Register of Institutions and Courses for Overseas Students (CRICOS).\n\nQii delivers nationally recognised training to overseas students holding Australian student visas. We issue Australian Qualification Framework (AQF) Certifications and Statements of Attainment to our students.\n\nQii provides quality education and training for everyone. All of our training programs have been developed in collaboration with industry leaders to ensure they maintain their relevance in a constantly changing workplace. This effort is enhanced by our employee selection process: this is a 4-stage procedure which identifies goal-orientated, highly qualified and genuinely caring professional Trainers and Support Staff.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/queensland-government-chief-information-office-795810", "employer_name": "Queensland Government Chief Information Office", "employer_info": "The Queensland Government Chief Information Office (QGCIO) is responsible for ensuring the government’s ICT investments:\n\nsupport policy outcomes\nare focussed on service delivery to the community\nrepresent good value for money\nare reliable.\nWe provide advice to Queensland Government agencies and executive government on issues such as:\n\nsetting ICT strategy, policies and standards\nadopting better practice for ICT investment management\nidentifying and managing risks, including ‘over the horizon’ risks\ndeveloping proposals for major whole-of-government investments\nidentifying and managing strategic workforce capability issues\nimproving contract outcomes\nfacilitating strategic relationships with industry partners.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/queensland-indigenous-family-violence-legal-service-qifvls-816814", "employer_name": "Queensland Indigenous Family Violence Legal Service (QIFVLS)", "employer_info": "We deliver culturally appropriate free legal service, welfare and support, advocacy and community education relating to:\n\nLegal / Court Representation\nDomestic and Family Violence\nFamily Law\nChild Protection\nSexual Assault\nDomestic Violence\nVictim Support\nLegal Reform Advocacy\nQIFVLS is located in Cairns, Townsville, Rockhampton, Mount Isa and Brisbane, and our teams of Solicitors and Client Support Officers regularly visit remote communities. \n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/queensland-fire-and-emergency-services-795815", "employer_name": "Queensland Fire & Emergency Services", "employer_info": "Welcome to the Queensland Fire and Emergency Services (QFES) website. QFES is the primary provider of fire and emergency services in Queensland.\n\nMaintained by a unique mix of approximately 36,000 Rural Fire Service Queensland volunteers, 6000 State Emergency Service volunteers, approximately 2,200 permanent firefighters, more than 2000 auxiliary firefighters and supported by non-operational administrative support staff, QFES responds to:\n\nStructural, landscape and vehicle fire;\nRoad crash rescue;\nSwift water and water rescue;\nStorm and natural disaster;\nBuilding fire safety;\nHazardous condition incidents;\nLand, marine, air and urban search and rescue;\nCrime scene, missing person and forensic searches;\nAnimal disease outbreaks.​\nThe QFES aims to protect person, property and the environment through the delivery of emergency services, awareness programs, response capability and capacity (preparedness), and incident response and recovery for a safer Queensland.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/queensland-fertility-group-816813", "employer_name": "Queensland Fertility Group", "employer_info": "Queensland Fertility Group is part of Australia’s leading group of fertility specialists, Virtus Health. Our doctors, nurses, scientists and support staff work together to provide the highest standard of personalised care, and deliver one of the highest IVF success rates in Australia.\n\nWith 13 clinics throughout Queensland, from the Gold Coast to Cairns, we provide convenient and accessible treatment. As our patient, you’ll have access to the best minds in fertility treatment as well as the latest scientific advances in assisted reproductive technology. We can take care of you at every step of the journey, from diagnosis and testing to treatment, and in some cases pregnancy care and delivery. Learn more about Virtus Health...\n\nThe Queensland Fertility Group advantage\nLeading expertise and personalised treatment\n\nQueensland Fertility Group’s fertility specialists include many of Queensland’s IVF pioneers. Having originally trained in obstetrics and gynaecology, our doctors now focus on fertility treatment and many are trained to the highest possible level.\n\nWe provide a full range of fertility services, from the minimally invasive treatments (such as IUI) to the more advanced, including IVF, ICSI and Pre-Implantation Genetic Diagnosis (PGD).\n\nYour specialist develops a personalised treatment plan based on your unique needs, and performs all your procedures, including monitoring ultrasound scans, egg collection and embryo transfers. Some continue to offer obstetric services, so they can also care for you throughout your pregnancy.\nSource: this is an extract from the company’s own website"},
{"employer_url": "https://www.seek.com.au/companies/queensland-fire-and-rescue-service-435303", "employer_name": "Queensland Fire and Rescue Service", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/queensland-fauna-consultancy-952304", "employer_name": "Queensland Fauna Consultancy", "employer_info": "Fauna Spotter Catcher and Ecological Services\n\nLitoria peroni\nQueensland Fauna Consultancy is a specialist fauna management company providing comprehensive fauna spotter catcher and ecological interpretive services to Queensland. We aim to service businesses throughout Queensland and interstate by providing necessary environmental information and management strategies for new, existing and future developments.\n \nOur specialist team is able to deliver a range of fauna based services through skilled and experienced staff in the areas of Fauna Survey; Fauna Spotter Catcher, specialist Koala Spotter and Fauna Management, including species of high conservation significance. Our strategies cater for small to large scale development and infrastructure projects such as new mine installations, dam footprints and linear projects such as pipeline, energy and road infrastructure.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/queensland-shared-services-433909", "employer_name": "Queensland Shared Services", "employer_info": "Queensland Shared Services (QSS) is a shared service provider in the Queensland Government. We deliver transactional activities, consultancy and advice, service integration and coordination, knowledge brokerage, and quality assurance to support our customers. We provide finance, procurement, human resource management, telecommunications and mail support services to the Queensland public sector. We are also responsible for the management and support of the majority of the sector’s finance and human resource systems and processes.\n\nWe want to BE THE ONE–partner and provider of choice for you. We are committed to understanding our customers and helping them get on with business. We enjoy productive relationships with our customers by putting them first, being a centre of expertise, delivering on our promises, making it easy, and being responsive and adaptive. We want to better understand your business so we can find innovative ways to help you maximise efficiencies and improve services.\n\nYou will benefit from our in-depth knowledge of government and unparalleled experience in effecting machinery-of-government changes by working with us as your partner and provider of corporate services and trusted advice.\n\nQueensland Shared Services is part of the Department of Science, Information Technology and Innovation (DSITI).\n\nQSS efficiencies\n\nWe’ve recently been delivering greater efficiencies and savings to customers by transforming our business. We strive to improve customers’ experiences with us and you can now take advantage of these innovations:\n•a timely way to make QSuper payments\n•electronic payslips for Lattice users\n•better pays with Surepay\n•eForms\n•our online QSS Self Service Centre\n•banking that works for you.\n\nAt the end of 2014, we had delivered:\n•520,568 overtime claims\n•1.72 million pays\n•$32 billion goods receipted\nOur customers\n\n\n\n\n \n\n\n\n\nQSS provides finance, human resource management and mail support services to 24 Queensland Government entities.\n•Aboriginal and Torres Strait Islander Partnerships (DATSIP)\n•Agriculture and Fisheries (DAF)\n•Anti-Discrimination Commission Queensland (ADCQ)\n•Communities Child Safety and Disability Services (DCCSDS)\n•Electoral Commission (ECQ)   \n•Energy and Water Supply (DEWS)\n•Environment and Heritage Protection (EHP)\n•Housing and Public Works (HPW)\n•Infrastructure Local Government and Planning (DILGP)\n•Inspector-General Emergency Management (IGEM)\n•Justice and Attorney-General (JAG)\n•Legal Aid Queensland (LAQ)\n•National Parks Sport and Racing (DNPSR)\n•Natural Resources and Mines (DNRM)\n•Premier and Cabinet (DPC)\n•Public Safety Business Agency (PSBA)\n•Queensland Ambulance Service (QAS)\n•Queensland Fire and Emergency Services (QFES)\n•Queensland Police Service (QPS)\n•Queensland Treasury (QT)\n•Science Information Technology and Innovation (DSITI)\n•State Development (SD)\n•Tourism Major Events Small Business and the Commonwealth Games (DTESB)\n•Transport and Main Roads (TMR)\nSource: this is an extract from the company’s own website."},
{"employer_url": "https://www.seek.com.au/companies/queensland-family-and-child-commission-821625", "employer_name": "Queensland Family and Child Commission", "employer_info": "The Queensland Family and Child Commission (QFCC) was established on 1 July 2014 as a result of the Queensland Government's response to the Queensland Child Protection Commission of Inquiry (Carmody Inquiry) – Taking Responsibility: A Roadmap for Queensland Child Protection 2013.\n\nOur vision:\n\nWe work collaboratively to influence change so Queensland is a safe place where children, young people and their families thrive in supportive communities.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/queensland-rail-432419", "employer_name": "Queensland Rail", "employer_info": "​​ Our Queensland Rail Travel network plays an important role in connecting regional Queensland and offers the largest and most comprehensive network of long distance and tourist trains in Australia. Queensland Rail's services extend along the Queensland coastline from Brisbane to Cairns and West to Charleville, Longreach and Mount Isa.\n \nStep on board and travel in comfort to a range of destinations. The Spirit of Queensland will introduce you to a new generation of train travel from bustling Brisbane to tropical Cairns. Venturing from Brisbane to Longreach, the Spirit of the Outback will allow you to reminisce about the golden era of rail travel.\n \nEach journey will have you discovering the amazing diversity and colours of Queensland from the rainforest to the reef, the city to the outback. Whether you’re a first time train traveller or an experienced train enthusiast, a Queensland Rail journey is the perfect way to create unforgettable memories.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/queensland-eye-institute-861067", "employer_name": "Queensland Eye Institute", "employer_info": "The Queensland Eye Institute has become renowned as one of the world's finest centres for eye health, medical research, education and care. It is Queensland's only academic research institute devoted to eye related health and diseases. \n\nOur purpose: \n\nto make significant scientific, educational and clinical contributions to eye health, especially in Australia and its near neighbours.\n\n\nOur vision is: \n\nto be internationally recognised for our efforts in research, education and clinical care to reduce eye disease and promote eye health in the community. \nSource: this is an extract from the company’s own website."},
{"employer_url": "https://www.seek.com.au/companies/queensland-education-leadership-institute-952296", "employer_name": "Queensland Education Leadership Institute", "employer_info": "As an educator, you’re more than just a teacher. You’re a leader, a motivator and a source of inspiration. At QELi, we understand that’s not a responsibility to be taken lightly. Recognising how your success and that of your students and staff intertwine, we’re dedicated to helping you reach your true potential. Because it’s only then that your students and people will reach theirs.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/queensland-diagnostic-imaging-436555", "employer_name": "Queensland Diagnostic Imaging", "employer_info": "Over the last 18 months we have invested heavily in our practices by upgrading our technology to provide more efficient low dose imaging equipment, reliable reporting pathways and the introduction of longer more convenient practice and appointment hours by extending services and providing weekend options where possible.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/queensland-eye-hospital-803434", "employer_name": "Queensland Eye Hospital", "employer_info": "Queensland Eye Hospital was established in 1997 as the Queensland Eye Centre, a dedicated ophthalmic day surgery hospital. Since that time QEH has grown, moved location and developed into Australia’s largest stand-alone ophthalmic day surgery hospital. Queensland Eye Hospital is the hospital of choice for leading professionals in ophthalmology, ophthalmic nursing, and health administration.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/queensland-cricket-816568", "employer_name": "Queensland Cricket", "employer_info": "Welcome to the official website of Queensland Cricket, home of the my Foot Dr Queensland Bulls, the Konica Minolta Queensland Fire and Brisbane Heat.\nmyFootDr Queensland Bulls \n\nThe my Foot Dr Queensland Bulls are the state’s premier cricket team and the public face of Queensland Cricket. The 11 players that take to the field are selected from the huge family of cricketing participants and proudly represent tens of thousands of cricketing enthusiasts state-wide.\n\nKonica Minolta Queensland Fire\n\nThe Konica Minolta Queensland Fire are the state’s number one women’s team. The Queensland Fire participate in the Women’s National Cricket League and Women’s T20 League.\n\nBrisbane Heat \n\nThe Brisbane Heat are Queensland’s sole representative in the KFC Big Bash League and are aiming to become the competition’s first ever two-time winner in BBL|04. The Heat will be looking to inspire the people of Queensland by playing an innovative and entertaining style of cricket.\n\nGetting Involved \n\nCricket is a fantastic sport that can be enjoyed by people of all ages and abilities. Queensland Cricket is actively committed to developing the game in Queensland at all levels.\n\n\nQueensland Cricket is committed to growing the game of cricket in our great state. Our mantra is – Australia’s favourite sport, Australia’s favourite state.\n\nQC is an operation of more than 100 full-time employees located throughout the State. It is administered by a leadership team headed by Chief Executive Officer Geoff Cockerill under the direction of a nine-person Board of Directors, headed by Jim Holding.\nSource: This is an extract from the company's own website"},
{"employer_url": "https://www.seek.com.au/companies/queensland-mental-health-commission-795835", "employer_name": "Queensland Mental Health Commission", "employer_info": "The Queensland Mental Health Commission (QMHC) was established on 1 July 2013 as a statutory body under the Queensland Mental Health Commission Act 2013.\n\nUnder the Act our purpose is to drive ongoing reform towards a more integrated, evidence-based, recovery-oriented mental health and substance misuse system.\n\nIn line with our legislation, our job is to:\n•Develop a whole of government strategic plan by working together with consumers, families, carers, government and non-government stakeholders. Our role is to then facilitate, support and report on our work and the work of others who put the Strategic Plan into action\n•Carry out, support and contribute to reviews, research and evaluation\n•Facilitate and promote awareness, prevention and early intervention strategies\n•Establish and support mechanisms to improve system governance, such as the Mental Health and Drug Advisory Council and promoting consumer, family and carer engagement and leadership.\nSource: this is an extract from the company’s own website."},
{"employer_url": "https://www.seek.com.au/companies/queensland-corrective-services-434373", "employer_name": "Queensland Corrective Services", "employer_info": "Queensland Corrective Services aims to provide stakeholders, private providers and other Government agencies with easy to find information about the Department and its management.\n\nueensland Corrective Services' vision is to become the leader in our business and a partner in criminal and social justice.\n\nBeing a leader in corrections means we are:\n\nbuilding on established and sound correctional practices\nactively driving the policy agenda to set the future direction of corrective services\nestablishing innovative and effective intervention strategies and programs\nBeing a partner in criminal and social justice means that we will:\n\nshare our knowledge\ninfluence positive change\nbe responsive to community priorities\nestablish participative and collaborative networks\nQCS is striving continuously for more effective and innovative programs and services, fair and humane treatment of offenders and a strong commitment to equity and cultural diversity.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/queensland-country-credit-union-798779", "employer_name": "Queensland Country Credit Union", "employer_info": "Queensland Country Credit Union is here to help hardworking regional Queenslanders have a good life.\n\nWhether that means being able to take the kids fishing on the weekends, purchase a place to call home, buy your first car, understand how to manage a budget, take a life changing trip overseas, renovate your house, upgrade the family car to explore the great backyard of Australia, protect the things you love from adversity, or any combination of the above, we are here to help make it happen.\n\nTo help you achieve the things that add up to a good life, we like to keep it simple. So how do we do that?\n\nWe’re an independent, customer owned organisation. Which means you come first.\nWe provide a full range of competitive financial services. Which means we're a one stop shop.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/queensland-fire-and-rescue-academy-795816", "employer_name": "Queensland Fire & Rescue Academy", "employer_info": "QFES is undergoing change to ensure it is well positioned and well prepared for the future and to meet the challenges it poses in relation to the needs and expectations of Queenslanders. Our Strategy articulates what the department is delivering to improve our ability to plan for, prevent and mitigate, and respond to the unexpected.  \n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/queensland-college-of-teachers-795845", "employer_name": "Queensland College of Teachers", "employer_info": "The QCT registers teachers for Queensland schools and accredits the state’s preservice teacher education programs.\n\nWe value quality teaching and child safety. We work with the teaching profession and other key stakeholders to help ensure education in Queensland schools is provided by teachers who meet Australian professional standards and are ethical in their dealings with students.\n\nThe QCT acknowledges the traditional custodians of the land where its office is located, the Turrbul People, and pays its respects to their Elders past, present and future.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/queensland-cervical-screening-program-820485", "employer_name": "Queensland Cervical Screening Program", "employer_info": "The Queensland Cervical Screening Program is part of the National Cervical Screening Program, which aims to reduce illness and death from cervical cancer through a more organised approach to cervical screening.\n\nCervical screening services (Pap smears) and associated follow-up are provided in a number of settings:\n\nMobile Women’s Health Service in rural and remote areas\nsexual health services\ngynaecology outpatients clinics\nAboriginal and Torres Strait Islander health services\ngeneral practice\nTrue relationships and reproductive health (formerly Family Planning Queensland) clinics.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/queensland-childcare-services-436742", "employer_name": "Queensland Childcare Services", "employer_info": "QUEENSLAND CHILDCARE SERVICES\n\nEstablished in 1991, Queensland Childcare Services is one of Australia's leading providers of high quality, individualised care and education of young children.\n\nMany of our Long Day Care centres are now running the Kindergarten programme with a fully Qualified Early Childhood Teacher. Please visit our Centre Location page to see which of our centres currently offer this programme.\n\nWe have successfully combined innovative developmental and educational programs, stimulating playscape environments and caring, responsible and experienced staff to help facilitate your child's ability to develop to their optimum.\n\nQueensland Childcare Services is committed to the implementation of the National Early Years Learning Framework and operates an Emergent curriculum.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/queensland-building-and-construction-commission-820317", "employer_name": "Queensland Building & Construction Commission", "employer_info": "The QBCC supports the growing Queensland community by providing information, advice and regulation to ensure the maintenance of proper building standards, remedies for defective building work. By doing this we promote confidence in the building and construction industry. Led by the Commissioner and governed by a board, the QBCC consists of a skilled and expert team of staff that work hard to meet the needs of industry participants and the community.\n\nThe QBCC Management Structure Chart (PDF) identifies the key figures within the organisation and their areas of responsibility.\n\nThe Commission regulates the building industry throughout Queensland. To provide the best customer service possible, service centres are located throughout the state including Brisbane, Gold Coast, Sunshine Coast, Toowoomba, Maryborough, Rockhampton, Mackay, Townsville and Cairns. Industry stakeholders and the community are also able to engage with the QBCC online or over the phone.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/queensland-bowel-cancer-screening-program-819617", "employer_name": "Queensland Bowel Cancer Screening Program", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/quebec-couriers-798766", "employer_name": "Quebec Couriers", "employer_info": "Success with integrity is our company philosophy, this has not changed since our inception in 1975.\n\nHonesty and value for money are only the begining, transparency in all aspects of the operation is our promise.\nTransport is not only a delivery, its people too. Our systems are designed to support your staff and help make the process as easy as possible.\n\nBy offering various levels of service, Quebec Couriers ensures its “partners” have the opportunity to control and monitor all of its deliveries.   “its that simple”\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/queanbeyan-palerang-regional-council-798764", "employer_name": "Queanbeyan-Palerang Regional Council", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/qudos-bank-arena-813230", "employer_name": "Qudos Bank Arena", "employer_info": "Qudos Bank Arena is ranked in the Top 10 arenas in the world and is the largest indoor entertainment and sporting arena in Australia.\n\nDesigned and constructed by Abigroup Ltd in conjunction with Obayashi Corporation, the venue is acknowledged by experts as equal to the finest indoor arenas in the world today.\n\nOne of the major venues for the Sydney 2000 Olympic and Paralympic Games, Qudos Bank Arena hosted artistic gymnastics, trampoline, the basketball finals and wheelchair basketball.\n\nThe AU$200 million complex was designed and constructed to set new benchmarks in urban design, access for people with disabilities, spectator comfort, operation efficiency and Olympic serviceability.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/queensland-board-of-the-medical-board-of-australia-795840", "employer_name": "Queensland Board of the Medical Board of Australia", "employer_info": "AHPRA's operations are governed by the Health Practitioner Regulation National Law, as in force in each state and territory (the National Law), which came into effect on 1 July 2010. This law means that for the first time in Australia, 14 health professions are regulated by nationally consistent legislation under the National Registration and Accreditation Scheme.\n\nAHPRA supports the 14 National Boards that are responsible for regulating the health professions. The primary role of the National Boards is to protect the public and they set standards and policies that all registered health practitioners must meet. Each Board has entered into a health profession agreement with AHPRA which sets out the fees payable by health practitioners, the annual budget of the Board and the services provided by AHPRA.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/queensland-board-of-the-nursing-and-midwifery-board-of-australia-795839", "employer_name": "Queensland Board of the Nursing & Midwifery Board of Australia", "employer_info": "Members of the inaugural Nursing and Midwifery Board of Australia were appointed for three years by the Australian Health Workforce Ministerial Council on 31 August 2009. \n\nFunctions of the Board\nContact the Board\nCommuniqués\nMeet the Board\nNursing and Midwifery Board of Australia sponsorship guidelines \nFunctions of the Board\n\nThe functions of the Nursing and Midwifery Board of Australia include:\n\nregistering nursing and midwifery practitioners and students\ndeveloping standards, codes and guidelines for the nursing and midwifery profession\nhandling notifications, complaints, investigations and disciplinary hearings\nassessing overseas trained practitioners who wish to practise in Australia  \napproving accreditation standards and accredited courses of study.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/queensland-rehabilitation-services-816815", "employer_name": "Queensland Rehabilitation Services", "employer_info": "WE ARE A FAMILY OWNED AND OPERATED COMPANY\n\nAt Queensland Rehabilitation Services (QRS), our journey of excellent care began more than 40 years ago. We have always aimed to support our residents in maintaining their independence, privacy, dignity and self-worth and pride ourselves in providing a “family-home-like environment” for all of our residents.\n\nAs a family owned business, our standard of care is set by our understanding of what we want for our own family: a high quality of life. To us, this means independence and choice to visit nearby shops, restaurants and recreational activities and to be part of the community. It’s about living happily and comfortably in a homely environment. It’s about receiving the right level of care at the right stages. This is the type of living we create for our residents.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/qube-ports-and-bulk-813216", "employer_name": "Qube Ports & Bulk", "employer_info": "Qube Ports & Bulk is the pre-eminent provider of wharf-side port logistics and port management services in the Australian region. Qube Ports & Bulk has had a presence in Australia since 1852, through its 150 year heritage, as a shipping company, vessel agent and stevedore and offers logistics services, management and expertise extending from port and facility development, vessel management, warehouse and distribution, stevedoring services and cargo handling for general cargo and dry bulk commodities for both import and export supply chains.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/qudos-bank-814302", "employer_name": "Qudos Bank", "employer_info": "Thanks for looking us up!\n\nYou could say that we’re the oldest new bank on the block - previously known as Qantas Credit Union; we’ve been in banking for over 55 years with an A2 investment grade rating and a full range of banking products including credit cards, home loans, personal loans and saving accounts.\n\nSo why us...?\n\nWe’re all about doing things differently. We know that there are things the banks do well...and not so well. So with a new name we’ve included a statement to reassure you that you’ll always come first and that our focus is on challenging the status quo – ‘so unbank like’. ‘So unbank like’ means you’ll experience less of the negative ‘bank like’ ways, like nasty hiked up fees, impersonal service and an ‘all about profit’ focus - that’s just not us. As our name suggests, we give Qudos - banking with real benefits and rewards. Rewarding you for banking with us - it’s the way banking should be.\n\nHow do we rate?\n\nIf you’re new to us we welcome you to compare us to the big banks! We beat the banks on a range of our loan and deposit accounts – to prove it, each week we publish a competitor weekly report and provided by the independent www.mozo.com.au\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/quay-west-796161", "employer_name": "Quay West", "employer_info": "WELCOME TO QUAY WEST SUITES MELBOURNE\nNestled in the creative Melbourne Arts Precinct\nIf you’re looking for an apartment-style hotel in the heart of Melbourne with outstanding views of the city and Yarra River, you cannot go past Quay West Suites Melbourne.\n\nIt’s the perfect location on Melbourne’s Southbank, featuring one, two and three bedroom suites with fully equipped kitchens and all the services and facilities of a 5  star hotel.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/qube-logistics-433148", "employer_name": "Qube Logistics", "employer_info": "Qube is Australia's largest integrated provider of import and export logistics services with national operations that provide a broad range of services. The Ports & Bulk division has diversified operations from Port Hedland in the west, where we stockpile and load iron ore for export markets, through to Port Kembla in the east where we handle motor vehicles, heavy machinery and project cargoes. The Logistics division has strategically located facilities in all capital city ports and provides road and rail container transport, customs and quarantine services, container parks, intermodal terminals, warehousing and international freight forwarding. \n\nSource: this is an extract from the company’s own website"},
{"employer_url": "https://www.seek.com.au/companies/quay-consulting-814547", "employer_name": "Quay Consulting", "employer_info": "Quay Consulting is a professional services business operating in the project management landscape, transforming strategy into fit-for-purpose project delivery.\n\nQuay Consulting is a professional services business operating in the project management landscape, transforming strategy into fit-for-purpose project delivery.\n \nEstablished in 2006, Quay has achieved sustained growth by providing our clients with real-world, relevant knowledge to help create project delivery environments aligned to their capability and specific project demands.\n \nQuay Consulting is proud to have been included on the BRW's Fast 100 growth companies for three consecutive years in 2011, 2012 and 2013, which is testament to the continued success of our model and our ability to successfully support and service our clients over a sustained period of time.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/queensland-health-432313", "employer_name": "Queensland Health", "employer_info": "Our vision\n\nHealthier Queenslanders.\n\nOur purpose\n\nTo provide leadership and direction, and to work collaboratively to ensure the health system to deliver quality services that are safe and responsive for Queenslanders.\n\nOur responsibilities\n\nThe Department of Health's role include:\n\nproviding strategic leadership and direction for health through the development of policies, legislation and regulations\ndeveloping statewide plans for health services, workforce and major capital investment\nmanaging major capital works for public sector health service facilities\npurchasing health service delivery\nsupporting and monitoring the quality of health service delivery\ndelivering specialised health services, providing ambulance, health information and communication technology and statewide health support services.\nHospital and Health Services are independent statutory agencies responsible for their own strategic plans.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/quarantine-tasmania-796076", "employer_name": "Quarantine Tasmania", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/quantumcorp-813318", "employer_name": "QuantumCorp", "employer_info": "Quantumcorp provides investigative and advisory services to help our clients:\nverify information\nestablish facts\nidentify and manage risk\ndevise solutions\nmake informed decisions.\nOur vast experience coupled with sound procedures enables Quantumcorp to provide clients with timely, flexible and creative solutions to any business challenge.\n\nWith offices in Sydney, Brisbane and Canberra, and an extensive network of qualified, experienced and motivated staff, Quantumcorp is well positioned to provide professional investigative solutions in six specialised areas:\n\ninsurance\nlegal\ncorporate\nemployment\nsport\npersonal.\n\nSource: This is an extract from the company’s own website."},
{"employer_url": "https://www.seek.com.au/companies/quay-restaurant-803400", "employer_name": "Quay Restaurant", "employer_info": "ABOUT QUAY\n\nAt Quay our aim is to match the breathtaking harbour setting with quintessential modern Australian cuisine. Warm, knowledgeable, professional staff will extend genuine hospitality as they guide you through your dining experience.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/quarantine-wa-795953", "employer_name": "Quarantine WA", "employer_info": "The Department of Agriculture and Food, Western Australia's (DAFWA) Quarantine WA service works hard to prevent the introduction of exotic pests, diseases and weeds found in other states and territories of Australia.\nFor information relating to overseas movements please visit the Federal Department of Agriculture website - agriculture.com.au.\nWhen considering moving risk items within Australia please check DAFWA's quarantine pages for any requirements that may be applicable and help prevent the further spread of unwanted pests and diseases.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/quantum-support-services-952160", "employer_name": "Quantum Support Services", "employer_info": "Vision Quantum Support Services vision is to improve lives.\n\nMission To improve lives by empowering people, particularly the vulnerable to reach their full potential.\n\nValues Quantum recognises that values driven activities and relationships are essential to the successful achievement of our Vision and Mission and a vibrant organisation. These values guide our behaviours, planning, service delivery and relationships.\n\nWe value: Respect Quantum values the worth and contribution of others and embraces treating people fairly and without discrimination. Integrity Quantum values being ethical and professional in our conduct. Empowerment Quantum values sharing our knowledge to promote the choices and decision-making capacity of others.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/quality-resort-sorrento-beach-798759", "employer_name": "Quality Resort Sorrento Beach", "employer_info": "The Best Perth Beach Resort & Hillarys Accommodation in Sorrento\n \n\nQuality Resort Sorrento Beach is the best Perth Beach Resort and the only destination for those looking to book Hillarys Boat Harbour accommodation in Sorrento. We are ideally situated near Hillarys Boat Harbour and are the closest accommodation to the beach in Western Australia. Stay near Sorrento Quay in 4 star hotel rooms and luxury spa suites for a romantic getaway with ocean views or 3 star 2 bedroom Perth holiday apartments for family beach holidays just 20 minutes from the city and 5 minutes north of Scarborough Beach. 3 bedroom apartment accommodation is also available for sporting group accommodation with Rottnest Island ferry terminal, shops, fishing charters and restaurants all a short walk away.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/quality-care-nursing-agency-806573", "employer_name": "Quality Care Nursing Agency", "employer_info": "QualityCare is one of the leading nursing agencies in Australia specialising in Acute Care, Aged Care & Community Care, Disability Care and Mental Health Care Services.\n\nQualityCare has been selected as one of the preferred suppliers by several leading Hospitals, Disability Care Centres, Mental Health Facilities and Aged Care Organisations.\n\nWe provide health care staff specialising in: Acute Care, Aged Care & Community Care, Disability Care, Mental Health Care\n\nQualityCare is one of the leading nursing agencies in Australia. We are focused on providing the best level of service to our clients and the nursing staff. QualityCare is managed by an experienced team with extensive knowledge and professional expertise required to deliver \nthe best service in the industry. Our agency was established to set a new standard in services offered by nursing agencies and provide nursing staff with a more caring and\npersonal approach \n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/quality-hotel-lighthouse-803880", "employer_name": "Quality Hotel Lighthouse", "employer_info": "Relax ~ Experience ~ Escape\n\nThe perfect location for a relaxing and affordable getaway in Bunbury, the gateway to the South West.\n\nThe Quality Hotel Lighthouse provides panoramic ocean views right across the Indian Ocean, and is located just steps to pristine beaches and 2 minutes to the city centre.\n\nWhether your visit is for business, a holiday or a simple weekend getaway, the Quality Hotel Lighthouse has all the facilities and services to ensure you have a comfortable and enjoyable stay.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/quality-health-care-803396", "employer_name": "Quality Health Care", "employer_info": "Quality Health Care was established as a family run health care provider in 1999. We maintain our values of compassion, respect, integrity, caring and excellence in everything we do.\n\nToday we employ over 250 permanent and casual staff who are dedicated to providing high quality care to individuals residing in the Greater Sydney Metropolitan Area.\n\nOur company’s aim is to enable people with disabilities, or who may be frail or living with dementia, to stay at home with appropriate care and support.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/quality-air-equipment-814066", "employer_name": "Quality Air Equipment", "employer_info": "Development and Leadership\n\nTo provide the right information, education, training, guidance and support for employees to enable them to deliver sustainable and quality results.\n\nPartners\n\nTo be committed to nurture relationships with our network partners while growing new ones. Together, we create shared values for our communities.\n\nCommunities\n\nTo consistently offer a large range of air distribution systems and products, that would help improve the indoor comfort and air quality of our communities.\n\nProcess\n\nTo use best practices; be lean and process orientated to achieve company efficiency and operational effectiveness.\n\nGrowth\n\nTo maximise our long term financial returns, thereby securing the future of our employees, stakeholders and partners.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/qualify-training-814690", "employer_name": "Qualify Training", "employer_info": "At Qualify we are local learning and employment specialists and we are passionate about delivering practical industry focused training programs. We provide individualised pre-employment training and employment services to people across regional Victoria. We partner with individuals, employers, partner RTO and TAFE providers and referring agencies to achieve exceptional learning and employment outcomes together.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/quairading-health-service-872987", "employer_name": "Quairading Health Service", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/quadric-951938", "employer_name": "Quadric", "employer_info": "For over three decades, Quadric has developed a dynamic, diverse and contingent construction methodology that has successfully seen delivery of some of the leading edge designed interior projects within the fitout, refurbishment and joinery space.\n\nWith the head office based in Brisbane, Quadric is one of the leading commercial construction companies to deliver projects for a range of high profile clients from commercial office fitout, complex structural rebuilds, heritage refurbishments to building extensions and shop fitouts.\n\nQuadric’s successful projects have been delivered across QLD, NT, NSW and has capacity to deliver across the broader network of Australia.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/quairading-district-high-school-872986", "employer_name": "Quairading District High School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/quadrant-energy-951929", "employer_name": "Quadrant Energy", "employer_info": "WELCOME TO QUADRANT ENERGY\n\nQuadrant Energy is one of the largest and most active Australian oil and gas companies.\n\nToday we supply more than 40% of Western Australia’s domestic gas from our three production hubs in the State’s northwest, and our offshore facilities produce a significant proportion of the nation’s oil.\n\nWith a strong exploration program and a focus on efficiency and innovation, we continue to grow our business, seek out new energy opportunities, and develop new markets for Australian oil and gas.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/quantum-radiology-834348", "employer_name": "Quantum Radiology", "employer_info": "Quantum Radiology is an independent, nationally-recognized subspecialty radiology practice committed to patient-centered care. Integral partnerships with the WellStar Health System and our referring physicians support our continuous pursuit of healthcare excellence.\n\nA strategic alliance in 1995 between Cobb Radiology Associates (founded in 1969) and Radiology Associates of Marietta (founded in 1951) marked the formation of Quantum Radiology. Now, as the largest private practice radiology group in Georgia, and recognized as a center of excellence, QR interprets over 916,896 medical imaging procedures annually at five hospital locations and over 23 outpatient diagnostic centers, including a stroke center and a trauma center.\n\nWe have 50 subspecialized physicians offering sophisticated medical imaging expertise directly to patients as well as to referring physicians. Subspecialized radiology services include:\n•Body Imaging\n•Women’s Imaging\n•Cardiac Imaging\n•Interventional Radiology\n•Musculoskeletal Imaging\n•Neuroradiology\n•Nuclear Medicine/PET/SPECT\n•Pediatric Imaging\n•Q3D\n\nQuantum Radiology delivers world-class medical imaging services and earns recognition as the leading radiology practice in Georgia in the eyes of patients, referring clinicians, health system partners, Quantum employees, and Quantum physicians by offering top levels of quality, professionalism, and service.\nSource: this is an extract from the company’s own website."},
{"employer_url": "https://www.seek.com.au/companies/quantum-energy-technologies-816811", "employer_name": "Quantum Energy Technologies", "employer_info": "Quantum are the pioneers and innovators of Heat Pump Water Heating technology, with over 30 years experience within Australia.\n\nProudly Australian owned, our Heat pumps were developed at the University of Melbourne in the mid 1970’s and have been tried and tested to perform reliably and efficiently – in even the most trying conditions throughout Australia, and the Globe.\n\nOur commitment to product research and development, and the continuous introduction of market leading advancements; ensure that Quantum remain the number one choice of “those in the know” when it comes to Heat Pump water heating.\n\nTo meet the increasing needs of our customers in the Australian market, Quantum have applied this same philosophy in expanding our product range and have now released a complete range of Instantaneous Gas and Electric Storage Hot Water Systems (HWS); with a strong focus on efficiency, Performance, reliability, and style.\n\nWhen you need hot water, Quantum has the right solution for you.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/quad-services-435833", "employer_name": "Quad Services", "employer_info": "Australian owned and operated, Quad was founded in 1972 and has stable long term ownership and a well-established senior management and operations team. Through organic growth Quad has become a significant provider of quality cleaning and associated services in all states across Australia. Our Head Office is located in Sydney and we have offices located across Australia and New Zealand.\n\nThe Quad Operations Management team have considerable experience in providing services to clients in our industry and have in-depth experience in managing a wide variety of client requirements.\n\nWe attribute our success to our service methodology, key elements of which are illustrated below.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/quality-pharmacy-group-803397", "employer_name": "Quality Pharmacy Group", "employer_info": "The Quality Pharmacy Group is an organisation committed to improving the health and wellbeing of the community.\n\nThrough the continual expansion of Quality Pharmacy in numerous locations, the group is able to provide professional advice and support from its pharmacists.\n\nCoupled with extensive strategic Allied Health partnerships, Quality Pharmacy is well placed to optimise the promotion and provision of health services.\n\nFundamental to the Quality Pharmacy philosophy is the belief that by providing a professional and personal service we can have a positive impact on the quality of life of our customers and their families.\n\nSource: this is an extract from the company’s own website"},
{"employer_url": "https://www.seek.com.au/companies/qsuper-433741", "employer_name": "QSuper", "employer_info": "As Queensland's largest super fund, we've expanded our services, and grown our customer base to more than 530,000, with over $60 billion in retirement funds under management.\n\nWe continue to innovate, to introduce new products and services, and to help ensure that our members can look forward to the future they want in retirement. And we're open to all current and former Queensland Government employees and their spouses – no matter what colour their collar is (if they're even wearing a collar at all).\n\nSource: this is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/quad-security-798755", "employer_name": "Quad Security", "employer_info": "At Quad, we are dedicated to providing our clients with personally tailored security solutions for both commercial and residential applications.\n\nOur services are managed in house with our own Electronics Department as well as our seven patrol cars that cover Melbourne’s SE suburbs and the entire Mornington Peninsula.  This together with Australia wide monitoring being undertaken at our own 24hr monitoring station, we are able to offer each client a full range of options in any combination that is required.\n\n\nSource: this is an extract from the company’s own website."},
{"employer_url": "https://www.seek.com.au/companies/qt-mutual-bank-436966", "employer_name": "QT Mutual Bank", "employer_info": "In 1965 a group of teachers created the Queensland Teachers' Credit Union in order to lend money to other teachers. Since then we’ve helped more than 350,000 Queenslanders with their banking needs. We’ve made the dream of home ownership become a reality more than 28,000 times (we’re proud of that one). We’ve helped make school drops a little easier and road trips possible for more than 50,000 people. We’ve made 3,000 retirees a little more secure. We’ve sparked the desire to save in more than 30,000 children and taught the value of never giving up to almost 250,000 teens (that one makes us smile). In 2011, we became QT Mutual Bank, Queensland’s first customer owned bank. And today we invite you to become part of our story.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/qni-resources-995284", "employer_name": "QNI Resources", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/qsr-international-813394", "employer_name": "QSR International", "employer_info": "When it comes to investigating an issue, answering a question or simply making sense of something, we often look to information to help us get there, and it’s rare that numeric or linear data will give you the full picture on its own. Qualitative or unstructured data can hold the key to richer insights and true research discovery that can revolutionize your recommendations and set you ahead of the field.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/qldwater-795793", "employer_name": "qldwater", "employer_info": "The Queensland Water Directorate (qldwater) is the central advisory and advocacy body within Queensland’s urban water industry and represents members from Local Government and other water service providers across Queensland.\n\nqldwater aims to strengthen the urban water industry to maintain and improve the safety, health, wellbeing and sustainability of Queensland’s communities. We provide our members with:\n\na strong, dependable and united industry voice\nan accurate, reliable and timely information source\ncritical technical and professional resources, skills and training programs to help improve industry capabilities and assist career development\nopportunities for contribution in policy formulation\nsupport for water management and efficiency improvements\ninformation sharing and streamlined water reporting\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/qinvest-753394", "employer_name": "QInvest", "employer_info": "We all have different plans for the future. The freedom to take life easier in retirement, a better start for your family or living debt free.  \n\nWhatever your situation, as a QSuper member, you can access practical advice from QInvest on how to make your money work harder for you. \n\nHow we can help you\n\nOur team of qualified financial advisers can help you to:\n\nOver the phone, video advice or face-to-face\nDedicated financial adviser who’s committed to helping you achieve your goals\nTwo appointments each year – an annual comprehensive review of your financial plan and a mid-year appointment to ensure you are on track\nAccess to a support team to help you implement your advice\nRegular newsletters\nInvitations to special events\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/qiagen-861503", "employer_name": "Qiagen", "employer_info": "Whether your passion for answers takes you to a laboratory bench or a hospital bedside, the pursuit often begins with a blood or tissue sample. The deepest mysteries of disease and other biological processes – the answers you seek – are encoded in the building blocks of life, DNA. \n\nYet the work of learning what these molecules can tell you is quite a journey, and we at QIAGEN understand the challenges associated with this quest.  \n\nOur commitment is to enable you, like more than 500,000 customers around the world, to quickly and reliably reach your goal of useful, actionable insights. To this end, QIAGEN offers you innovative solutions that cover every single step along this journey – not just technologies, but bridges from samples to insights. As you advance to new frontiers, QIAGEN also advances – and this website’s updated look and feel reflects our end-to-end commitment to your journey.\n\n\nQIAGEN offers a broad range of more than 500 core products to meet the special requirements of its more than 500,000 customers worldwide.  \nSource: this is an extract from the company’s own website."},
{"employer_url": "https://www.seek.com.au/companies/qinetiq-435979", "employer_name": "QinetiQ", "employer_info": "QinetiQ Australia is a people based business that provides advice and services across the aerospace, land and maritime domains of the Defence market and to Government, training and industry sectors.  \n QinetiQ Australia is a people-based business that provides trusted and impartial advice and services across the aerospace, land and maritime domains of the Commonwealth Government of Australia Department of Defence and to Government, training and industry sectors.  \nOur engineers and consultants make the critical difference to our customers by providing solutions to complex problems, which combine technical expertise, deep domain knowledge and rigorous independent thinking. We have more than 250 people located in Adelaide, Brisbane, Canberra and South and Port Melbourne or co-located with our customers across Australia.\n\nOur company officially began trading on 16 February 2008, following the strategic acquisition by the QinetiQ Group in the United Kingdom of three Australian Defence consultancy, engineering services and aerospace businesses. We operate through three divisions – Aerospace, Land & Maritime and Government, Technology & Industry.\n\nWhat differentiates us is our 21 Subpart-J accreditation under Australia’s Defence Aviation Safety Regulations in explosive ordnance, range safety control systems and aircraft structural integrity. Using our accreditation we can act as a design authority, independent of the original design owner, which creates objectivity and efficiency in Defence decision-making.\n\nBecause QinetiQ Australia does not make or manufacture products, we are independent of the Defence supply chain and the large product-focused Original Equipment Manufacturers. Our impartiality combined with our technical know-how means we are uniquely placed to understand our customer’s issues and work with them to ensure their ongoing success.\n\nQinetiQ Australia’s team is augmented and enhanced by global expertise from our UK, US and other international businesses including OptaSense, Boldon James and Commerce Decisions.\nSource: this is an extract from the company’s own website."},
{"employer_url": "https://www.seek.com.au/companies/qgc-432677", "employer_name": "QGC", "employer_info": "\r\n\r\n"},
{"employer_url": "https://www.seek.com.au/companies/qml-pathology-433614", "employer_name": "QML Pathology", "employer_info": "QML Pathology has 24 laboratories and over 635 collection centres strategically located throughout Queensland and northern New South Wales. Our operations are maintained by over 35 specialist pathologists and over 2000 staff. QML Pathology has spent more than 90 years providing a first rate and reliable service to medical practitioners and patients alike. Our rapid growth and vast testing capacity has made us a leader in our field, a position we do not take lightly. In an ever-evolving industry, QML Pathology maintains the values instilled by Dr Gutteridge and Dr Duhig so many years ago - values we intend upholding well into the future.\n\nSource: this is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/qic-434574", "employer_name": "QIC", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/qhandm-birt-752984", "employer_name": "QH&M Birt", "employer_info": "Q H & M Birt has grown to become a dynamic provider in the Civil Construction and Mining Industries, with a diverse range of projects completed throughout Queensland, Western Australia, the Northern Territory, New South Wales and the ACT. We are a committed, professional organisation with a proven track record of successful project delivery. We pride ourselves on the relationships we generate and this is mirrored by our ongoing re-engagement with multiple customers, including Rio Tinto and BHP.\n\nSource: this is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/qenos-813508", "employer_name": "Qenos", "employer_info": "Qenos has been a pioneer in Australian manufacturing and processing for nearly 60 years. Now we’re diversifying, building on our heritage and applying our unique transformative skills, our proven track record in workplace safety and operational excellence plus our enviable global collaborations to a host of new opportunities.\n\nThe world is evolving, and so are we. We’re busy providing specialised advisory services to improve the safety and efficiency of Chinese hazardous process industries and at the same time working on new ways to open up investment opportunities into Australia. And that’s just the beginning.\n\nBy harnessing these strengths, we’re working to deliver smarter products, services and support to benefit manufacturers, processors and distributors and to enhance the lives of millions of people.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/qbank-834392", "employer_name": "QBANK", "employer_info": "We think our members are everyday heroes in our community. That's why we're here for them with exclusive member only products and services.\n\n\n It's our job to provide dedicated banking to the people who protect and serve Queenslanders. We understand you and what you do because we've been serving you and your family since 1964. \n\nBy subscribing to the Code, QBANK makes the following commitment to its members:\n  \nWe will be fair and ethical in our dealings with you\nWe will focus on our customers\nWe will give you clear information about our products and services\nWe will be responsible lenders\nWe will deliver high customer service and standards\nWe will deal fairly with any complaints\nWe will recognise our customers' rights as owners\nWe will comply with our legal and industry obligations\nWe will recognise our impact on the wider community\nWe will support and promote this The Customer Owned Banking Code of Practice.\nSource: this is an extract from the company’s own website."},
{"employer_url": "https://www.seek.com.au/companies/qeii-medical-centre-trust-796001", "employer_name": "QEII Medical Centre Trust", "employer_info": "The 28 hectare QEII Medical Centre (QEIIMC) is the largest medical centre in the southern hemisphere and globally recognised in health care, research and education.\n\nSituated 4km from the Perth central business district in Nedlands Western Australia, the QEIIMC has grown over 45 years to include over 40 organisations. The QEIIMC has not-for-profit, public and private organisations and is dedicated to facilitating the highest quality of health care, educating future generations of health workers and conducting related scientific research.\n\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/qeii-jubilee-hospital-803391", "employer_name": "QEII Jubilee Hospital", "employer_info": "The Queen Elizabeth II Jubilee Hospital (QEII) is a medium metropolitan adult facility providing a range of inpatient and outpatient services and a 24-hour emergency department. We are supported by local Community Health Centres at Eight Mile Plains, Mount Gravatt, Corinda and Inala.\n\nServices we provide\nWe provide a range of specialties including general medicine, surgery, cardiology, geriatric medicine, gynaecology, orthopaedics, intensive and coronary care, neurology, gastroenterology, urology and respiratory medicine.\n\nIn 2013, QEII completed a $22 million construction project featuring an expanded emergency department and a new endoscopy unit. The new, state-of-the-art emergency department is three times the size of its predecessor and incorporates a modern, spacious design and a new patient transit lounge.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/qatar-airways-433174", "employer_name": "Qatar Airways", "employer_info": "In a relatively short time, Qatar Airways has grown to more than 150 destinations worldwide, offering unmatched levels of service excellence that have helped excel the award-winning carrier to become best in the world.\nVoted Airline of the Year 2011 and in 2012 in the prestigious Skytrax industry audit, Qatar Airways has won the confidence of the travelling public.\nTravel by air has reached the point where it is now taken for granted in all corners of the globe. With a larger number of passengers and more choice available in the skies today, airlines looking to maintain or grow their position in the marketplace must provide high-quality service with ever-increasing efficiency.\nIn this highly competitive environment, Qatar Airways has achieved much with our phenomenal route expansion averaging 30% growth year to year and flying one of the most modern fleet of 158 aircraft in the skies today. Our global network currently spans key business and leisure destinations across Europe, Middle East, Africa, Asia Pacific, North America and South America, with scheduled flights operating to and from our hub in Doha, capital of the State of Qatar."},
{"employer_url": "https://www.seek.com.au/companies/qbe-insurance-432509", "employer_name": "QBE Insurance", "employer_info": "QBE has been providing peace of mind to Australians and overseas clients for more than 125 years.\nQBE Australia is a division of the QBE Insurance Group,  one of the world's top 20 general insurance and reinsurance companies, with operations in all the key insurance markets. QBE is listed on the Australian Securities Exchange and is headquartered in Sydney. We employ more than 17,000 people in 38 countries.\nWe continue to develop our ability to deliver a broad competitive product range, high levels of service, in particular claims service, and a degree of flexibility our competitors find difficult to match.   \nSource: this is an extract from the company's own website"},
{"employer_url": "https://www.seek.com.au/companies/qbd-the-bookshop-433979", "employer_name": "QBD The Bookshop", "employer_info": "Richlands, QLD 4077\nQBD (Queensland Book Depot) was started in the late 1890s by the Uniting Church as a retail business selling religious material. Over the many years leading up to the 1980s QBD developed into a major retailer in Queensland. By this time QBD had 50 stores across Queensland selling a large range of religious and general books, stationery plus specialising in student text books.\nQBD's commitment to customers has ensured an extremely strong following, offering the best loyalty program in the industry, massive savings off current titles and a well laid out shop that is always neat and tidy. Display presentation mixed with theme sales promotions is also very important.\n\nWith QBD now buying book rights, reprinting, then right through to distribution and sales across all fifty-five outlets will always ensure plenty of books available at great prices.\nSource: this is an extract from the company’s own website"},
{"employer_url": "https://www.seek.com.au/companies/qantas-airways-432340", "employer_name": "Qantas Airways", "employer_info": "unded in the Queensland outback in 1920, Qantas has grown to be Australia's largest domestic and international airline. Registered originally as the Queensland and Northern Territory Aerial Services Limited (QANTAS), Qantas is widely regarded as the world's leading long distance airline and one of the strongest brands in Australia. We have built a reputation for excellence in safety, operational reliability, engineering and maintenance, and customer service. \n\n?Source: this is an extract from the company’s own website"},
{"employer_url": "https://www.seek.com.au/companies/qudos-bank-814302?child=753094", "employer_name": "Qantas Credit Union", "employer_info": "Thanks for looking us up!\n\nYou could say that we’re the oldest new bank on the block - previously known as Qantas Credit Union; we’ve been in banking for over 55 years with an A2 investment grade rating and a full range of banking products including credit cards, home loans, personal loans and saving accounts.\n\nSo why us...?\n\nWe’re all about doing things differently. We know that there are things the banks do well...and not so well. So with a new name we’ve included a statement to reassure you that you’ll always come first and that our focus is on challenging the status quo – ‘so unbank like’. ‘So unbank like’ means you’ll experience less of the negative ‘bank like’ ways, like nasty hiked up fees, impersonal service and an ‘all about profit’ focus - that’s just not us. As our name suggests, we give Qudos - banking with real benefits and rewards. Rewarding you for banking with us - it’s the way banking should be.\n\nHow do we rate?\n\nIf you’re new to us we welcome you to compare us to the big banks! We beat the banks on a range of our loan and deposit accounts – to prove it, each week we publish a competitor weekly report and provided by the independent www.mozo.com.au\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/qnv-constructions-798753", "employer_name": "QNV Constructions", "employer_info": "Our company commenced building superior quality residential properties in Victoria in 2011. Since then, the demand for QNV product has seen the successful expansion into Queensland, New South Wales, South Australia and Tasmania. Led by an award winning builder and member of the Housing Industry Association (HIA) and Masters Building Association, QNV Constructions is one of Australia's largest, established builders of private residential homes. With a leadership team combining more than 50 years' experience across Australia, QNV has a formidable reputation for delivering superior quality results within budget, on time - every time.\n\nThrough our investment property building background we have developed an efficient building process and a broad network of suppliers and sub-contractors that deliver a range of superior quality finishes and product inclusions at a competitive price. \n\nAt QNV - Quality - National - Value - are the core of our business. We create a superior Quality product through the use of our reliable National network, providing exceptional Value for our diverse range of clients.\nSuperior Quality Investment Homes\n\n\nWe excel at designing and building quality investment homes. As an experienced master builder our skills have been developed within the property investment sector where value and return on investment is paramount. We have the unique ability to design and build your home using our knowledge, established relationships with suppliers, vendors and developers to create an exceptional quality home that you will be proud to own and delivers a great capital growth. \n\nExceptional Quality Developer Built Projects\n\n\nOur flexible, efficient approach to building, backed with our long-standing reputation for quality and service has driven the demand for our team to build projects for private developers. We work with a diverse range of third party land developers and builders throughout Australia on a range of project types and sizes. Our flexibility, size and approach allows us to be the sole builder or work in partnership as required. Where reliability, quality and dependability is essential for your next project we can help. \n\nUnique Quality Custom Built Projects\n\n\nIncreasingly we have had requests to undertake a range of innovative custom building. We bring our skills, honed in investment property building, to a new level when building owner occupier homes. Our approach is to work alongside the owner, understanding their specific requirements and utilising our partnerships and skilled craftsmen to deliver an unparalleled result. \n\nOur Service\n\nOver the years, QNV has been recognised as a builder that delivers an exceptional client service. Our reputation has been built on consistency. We deliver great outcomes for clients, whether they be individual investors or private developers. Testament to this is that our General Manager will gladly take direct phone calls from clients, such is his confidence in the QNV product. Building with QNV is a journey that we’ll make smooth and seamless. We pride ourselves in ensuring each client is informed of your home's progress as it takes shape. With a growing client base of repeat clients we continue to deliver and build within timeframes, providing peace of mind for our clients with early handover, tenancy and therefore expediting your return on investment\nOur Sustainable Building Commitment\n\n\n\nWhere practicable QNV Constructions is committed to implementing sustainable building designs and techniques including, but not limited to:\n• Eco-friendly materials, energy efficient designs and site positioning to ensure optimum energy ratings and minimal environmental impact;\n• All building waste disposed through authorised management organisations;\n• Sourcing building supplies locally to reduce emissions from transporting;\n• Engaging the services of local skilled tradespeople and suppliers to support the local economy within regions we build;\n• The use of building designs and landscaping that complement the local environment.\nSource: this is an extract from the company’s own website."},
{"employer_url": "https://www.seek.com.au/companies/qanda-market-research-437656", "employer_name": "Q&A Market Research", "employer_info": "At Q&A Market Research, we pride ourselves on the provision of first-class market research services through a passionate, experienced and dynamic team of client service professionals. Your projects are in good hands.\nSource: this is an extract from the company’s own website."},
{"employer_url": "https://www.seek.com.au/companies/q-electrical-436804", "employer_name": "Q Electrical", "employer_info": "Electrical, Communications, Fire & Security Systems - Large to Medium Projects\n\nGeneral Contracting, Project Management, Engineering, Design and Service Company. Servicing all current aspects within the building industry for Electrical, Communications, Fire & Security through design, new works, refurbishment and maintenance.\n\nIndustry sectors covered include:\n\nCommercial - Industrial - Health Care - Aged Care - Educational & Research Facilities.\n\nFacilities and Operations\n\nHead Office\nDesign; engineering; estimating; business development; quality systems; OH&S; industrial relations; finance; human resources; strategic planning; workshop maintenance; training.\nProjects – Large to Medium, Site based General Contracting\n\nSite specific – Project management; production control; design; engineering; quality control; safety; training; human resources.\n\nMinor Works\nJob specific – Mobility, production  control; design; quality control; engineering assistance; quality; safety; after hours and emergency Service; alterations; new work; fit-outs\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/qenergy-995405", "employer_name": "Qenergy", "employer_info": "Best Electricity Retailer For Small Business\nWe are a private Australian best energy retailer offering a wide range of specialised services. These services respond to the requirements of households and businesses in terms of energy.\n\nWe began our operations in the year 2007 when we realised a lack of options in terms of electricity as well as savings. Our idea was to offer a solution for savings for residential and the small and medium scale businesses.\n\nWe being the one of the best energy provider have a team of qualified and experienced professionals. These professionals are very well versed with the needs and expectations of residential customers and different businesses across the country.\n\nDon’t Miss it - Best Electricity Offer\n\nSource: This is an extract from the company's own website."}
]