[
{"employer_url": "https://www.seek.com.au/companies/kandl-gates-438859", "employer_name": "K&L Gates", "employer_info": "K&L Gates LLP comprises approximately 2,000 lawyers who practice in fully integrated offices located on five continents: Anchorage, Austin, Beijing, Berlin, Boston, Brisbane, Brussels, Charleston, Charlotte, Chicago, Dallas, Doha, Dubai, Fort Worth, Frankfurt, Harrisburg, Hong Kong, Houston, London, Los Angeles, Melbourne, Miami, Milan, Munich, Newark, New York, Orange County, Palo Alto, Paris, Perth, Pittsburgh, Portland, Raleigh, Research Triangle Park, San Francisco, São Paulo, Seattle, Seoul, Shanghai, Singapore, Sydney, Taipei, Tokyo, Warsaw, Washington and Wilmington. \n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/karara-mining-435895", "employer_name": "Karara Mining", "employer_info": "Karara Mining Ltd is the first major magnetite operation project in the Mid West and will underpin a substantial, long-life iron ore business with robust economic benefits.  The operation includes construction and operation of a large open pit mine, a processing plant to produce magnetite concentrate, and all associated infrastructure.\nKarara will deliver both high grade magnetite concentrate and Direct Shipping Ore hematite.  \nKarara is committed to working with local communities to support sustainable development in the region. Their environmental objective is to maintain the abundance, diversity, geographic distribution and productivity of flora and fauna at species and ecosystem levels.  \nSource: this is an extract from the company's own website\n"},
{"employer_url": "https://www.seek.com.au/companies/kao-group-813870", "employer_name": "Kao Group", "employer_info": "Striving for the wholehearted satisfaction and enrichment of the lives of people globally through Yoki-Monozukuri implemented from the consumer/customer's perspective\n\nThe Kao Group develops consumer product business that targets general consumers. Kao Group business segments that cater to the consumer include: the Beauty Care Business in which we offer prestige cosmetics, and premium skin care and hair care products; the Human Health Care Business with products that include functional health beverages and feminine and baby care products; and the Fabric and Home Care Business, which includes laundry detergents and household cleaners. Also, in the Chemical Business we develop chemical products that meet the various needs of industry. \n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/kardinia-international-college-800211", "employer_name": "Kardinia International College", "employer_info": "Welcome to Kardinia International College. A College that endeavours to to be a symbol of hope for the world by being a place of quality learning and personal development and where people from every corner of the earth feels welcome and at home. This is both the privilege and the challenge of Kardinia International College.\nWhether you are a prospective student, parent or teacher or a casual visitor to our website, I think you will find something that will capture your imagination and provide you with a brief insight to what is a truly unique and amazing College.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/karara-state-school-819452", "employer_name": "Karara State School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/kapinara-primary-school-871134", "employer_name": "Kapinara Primary School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/kaplan-international-colleges-806396", "employer_name": "Kaplan International Colleges", "employer_info": "With over 75 years of experience, Kaplan is trusted by students learning English at one of our 42 Kaplan International schools located in eight countries around the world.\nEducation is our passion, and we take great pride in ensuring our students have all the opportunities and tools to succeed. Our philosophy is not a simple focus on classrooms and textbooks; it’s about creating a fully rounded experience.\nLearn English, enjoy new cultures, make new friends, and see the world.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/karalee-state-school-820372", "employer_name": "Karalee State School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/karama-primary-school-988189", "employer_name": "Karama Primary School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/kangaroo-island-council-803463", "employer_name": "Kangaroo island council", "employer_info": "Kangaroo Island is located 13.5 kilometres from the mainland at its closest point. It encompasses an area of 4,400 square kilometres and has a resident population of approximately 4,500. The Council is responsible for the management of 1,100 kilometres of unsealed roads and 250 kilometres of sealed roads. The Island enjoys approx. 200,000 visitors each year, which is steadily increasing.\n\nOur Council of Elected Members comprises the Mayor and eight councillors.  Kangaroo Island Council was formed in 1996 following the amalgamation of the District Councils of Kingscote and Dudley.\n\nOur vision for Kangaroo Island is a confident, growing and cohesive community.\n\nOur mission is to provide leadership, direction and responsible stewardship of resources, and delivery of efficient, cost effective key services to our Community.\n\nOur values and behaviours:\n\n•Creativity and innovation\n\n\n•Equality\n\n\n•Accountability and transparency\n\n\n•Sustainability\n\n\n•Service orientated\n\n\n•Participatory\nSource: This is an extract from the company's own website"},
{"employer_url": "https://www.seek.com.au/companies/kambos-814418", "employer_name": "Kambo's", "employer_info": "Kambo’s is one of WA’s leading retailers of electrical, white goods, cooking appliances, TVs, audio equipment, homewares, giftwares, heating / cooling and much, much more.\n\nProudly WA owned and operated, we have 5 huge stores – now in Malaga, Canning Vale, Kwinana, Joondalup and Harvey.\n\nOur mission is simple – provide you with the biggest range of the biggest brands at the best prices. We do this whilst still providing you with an exceptional shopping experience; maintaining a personal touch and ensuring we pass on the absolute best product knowledge and advice.\n\nIt’s this commitment to our customers that’s helped us maintain our premier position as WA’s number one electrical retailer and why now more than ever, we hear more people all over Perth proudly saying “I got it at Kambo’s!”.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/kangan-institute-433551", "employer_name": "Kangan Institute", "employer_info": "An education at Kangan Institute provides you with more than just a qualification. It provides you with a lifestyle - a crucial piece of the puzzle to your dream career.\nOur focus is on real skills, real education and real jobs. Our reputation amongst employers is exemplary – they understand the skills and qualifications a Kangan graduate possesses results in better outcomes for their organisation.\nWith more than 80 years' vocational education and training experience, Kangan Institute is one of Victoria's largest and most trusted training providers.\nWith a range of courses plus six comprehensive campuses around Victoria – all with specific expertise and facilities – we provide the perfect pathway to making sure you live the lifestyle you want.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/kangaroo-island-outdoor-action-927269", "employer_name": "Kangaroo Island Outdoor Action", "employer_info": "Established in 1993, KI Outdoor Action began by offering horse trail rides, sail boarding and snorkelling. Over time the business evolved to meet the needs of a changing market and in 2007 Brenton Davis bought the business and transferred the operations to the current premises on Jetty Road at Vivonne Bay. We offer a variety of high quality, action based, outdoor experiences. Activities available now include kayaking the Harriet River, guided quad tours, and sandboarding the massive dunes of Little Sahara.\n\nCombining the opportunity to learn about the environment and observe kangaroos and other wildlife in their native surroundings with the ability to explore otherwise inaccessible parts of Kangaroo Island, our aim is to make everyone’s trip to Kangaroo Island the holiday of a lifetime.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/kane-constructions-995239", "employer_name": "Kane Constructions", "employer_info": "We are a multi award winning, privately owned commercial construction company active in all sectors of the industry. With a turnover in excess of $600 million and over 330 full time employees, we operate throughout the east coast of Australia and overseas from offices in Melbourne, Canberra, Sydney and Brisbane.\n\n'our success is recognised in the way we achieve, as much as what we achieve'\n\nKane Constructions commenced operations in Melbourne in 1973.\n\nInitially working from an office located above an antiques shop in High Street, Armadale, early projects included a number of Catholic Primary Schools (Jobs 23, 37, 55 & 57), a range of facilities for local councils, work for the CSIRO, a private residence in Toorak (Job 2) and a waste water treatment plant in Kensington (Job 75).\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/kandanga-state-school-819589", "employer_name": "Kandanga State School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/kytec-861547", "employer_name": "Kytec", "employer_info": "At Kytec, we know our products and services intimately, positioning us to produce the best customer result.\n\nWe’re an ICT organisation renowned for getting it done, and getting it done right. At Kytec, we believe that every client is different, and every challenge is unique. That’s why we’re big\nbelievers in Practical Wisdom.\n\nPractical Wisdom is the theory that while rules are important, and processes are necessary, they must only be a platform for growth and further discovery: we can’t solely rely on how things have been done in the past to achieve the best outcomes.\n\nSo when a new challenge arises, we get to know the situation well enough to gather insight, and then create new, effective solutions.\n\nWe call this the Kytec way. \nSource: this is an extract from the company’s own website."},
{"employer_url": "https://www.seek.com.au/companies/kamper-chartered-accountants-803459", "employer_name": "Kamper Chartered Accountants", "employer_info": "Established over 50 years ago as a small suburban business, Kamper has grown and evolved to become a full service accounting practice and business consultancy. Our clients include individuals, small-to-medium enterprises and large proprietary companies across a whole suite of industries.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/kyocera-document-solutions-813507", "employer_name": "Kyocera Document Solutions", "employer_info": "​At KYOCERA, in order to deliver products and services that delight our customers, we take the “Customer-First” Principle as our top priority.  To ensure customer satisfaction, we aim to be a partner that delivers new value to our customers’ operations, with employees who relentlessly pursue their dreams, work enthusiastically and achieve self-determined goals.  \n\nKYOCERA Document Solutions Inc. is the company that undertakes the document solution business in KYOCERA group, which has consistently opened up new worlds by leveraging leading-edge technologies in a broad range of fields from fine ceramics, electronic devices and communications services to environment and energy markets.  \n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/kwik-kopy-436201", "employer_name": "Kwik Kopy", "employer_info": "You’re an expert at your business and Kwik Kopy are experts at theirs\nKwik Kopy’s aim is to deliver practical advice, graphic design and advanced online access to provide customers with superior communication products to enhance their business. The company boasts some of the finest minds in the franchising market, as well as franchisees who have successfully made the Kwik Kopy corporate vision work for themselves.\n\nAn independent Australian company, Kwik Kopy Australia was established in 1982 as a Master Licence holder from Kwik Kopy Corporation U.S.A. There are now over 100 Centres operating throughout Australia. As a leading member of the Franchise Council of Australia and Franchise Association of New Zealand, Kwik Kopy were the first Australian franchise to be accredited under the Franchise Code, holding licence number 001. The company was also the first franchised printing business in Australia to achieve the impressive Quality Assurance Standard ISO9002.\n\nSource: This is an extract from the company's own website"},
{"employer_url": "https://www.seek.com.au/companies/kurwongbah-state-school-819845", "employer_name": "Kurwongbah State School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/kurtz-transport-436730", "employer_name": "Kurtz Transport", "employer_info": "\n\nSource: This is an extract from the company's own website"},
{"employer_url": "https://www.seek.com.au/companies/kyilla-primary-school-871383", "employer_name": "Kyilla Primary School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/kuranda-district-state-college-820115", "employer_name": "Kuranda District State College", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/kuraby-state-school-819440", "employer_name": "Kuraby State School", "employer_info": "Welcome to Kuraby State School\n \nKuraby State School is a place where teachers, students and community work together to develop the potential of every student. An environment exists that expands on and reinforces the values of persistence, resilience, organisation, getting along and confidence. Together, we endeavour to 'Succeed in all'.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/kuraby-special-school-819547", "employer_name": "Kuraby Special School", "employer_info": "Kuraby Special School aims to:\n\nFoster active parent participation,\nfoster wider community involvement,\nfoster staff professional and personal development,\npreserve and foster the attitudes about the level of care afforded to students,\nfoster knowledge and wider understanding of human behaviours and circumstances within the wider community, especially within families,\nfoster constructive communication, with consultation and collaboration,\npromote tolerance and respect for others, having regard to individual differences, and\nrecognise the rights of others.\n\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/kununurra-youth-justice-service-875108", "employer_name": "Kununurra Youth Justice Service", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/kununurra-hospital-871368", "employer_name": "Kununurra Hospital", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/kununurra-adult-community-corrections-875107", "employer_name": "Kununurra Adult Community Corrections", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/kunara-organic-cafe-800374", "employer_name": "Kunara Organic Cafe", "employer_info": "Kunara is your meeting place to discover what’s hot and happening in the world of health. We are so much more than a healthy living destination – visiting us is an experience and we are a hub of learning, a collective of passionate people, the heart of a community who want to live with vitality and integrity.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/kununoppin-health-service-871365", "employer_name": "Kununoppin Health Service", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/kumon-433021", "employer_name": "Kumon", "employer_info": "Half a century ago, the Kumon Method was born out of a father's love for his son\nThe Kumon Method that began from a father’s love for his child is now available in 48 countries and regions with 4.26 million subject enrolments (as of June 2013). The Kumon Method has remained consistent for over 50 years and has been accepted in many countries despite differences in lifestyle, educational systems, and culture. It is our dream to contribute to world peace through education\nThe Kumon Method is an individualised learning method. The starting point for each Kumon student is determined individually. Students start with the level where they can attain a perfect score by studying on their own.\nThe worksheets have been designed in a way that allows students to figure out how to solve problems on their own. If students continue to study at their own pace, they will catch up with their school grade level and eventually advance far beyond it.\nSource: this is an extract from the company’s own website"},
{"employer_url": "https://www.seek.com.au/companies/kumbia-state-school-819581", "employer_name": "Kumbia State School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/kulin-district-high-school-871363", "employer_name": "Kulin District High School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/kulpi-state-school-819415", "employer_name": "Kulpi State School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/kwinana-community-health-and-development-centre-795992", "employer_name": "Kwinana Community Health & Development Centre", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/kukerin-health-centre-871361", "employer_name": "Kukerin Health Centre", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/kubota-tractor-australia-929173", "employer_name": "Kubota Tractor Australia", "employer_info": "The Kubota story began in 1890 when an ambitious 19 year old man by the name of Gonshiro Kubota established a metal casting business in Osaka, Japan. Even from a young age, his vision was clear. He was determined to create quality products that improved the lives of his customers, their communities and were environmentally-friendly. These values have guided Kubota to where we are today and represent what we stand for.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/kununurra-district-high-school-871367", "employer_name": "Kununurra District High School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/ksjv-752982", "employer_name": "KSJV", "employer_info": "\"scee is an emerging Tier One provider of specialised electrical and instrumentation services to Australia's resources sector. Delivering life-of-project electrical infrastructure, construction and support services to its blue-chip customers for more than 30 years, scee has a strong reputation for safety and excellence.\n\nSource: this is an extract from the company's own website.\""},
{"employer_url": "https://www.seek.com.au/companies/kruger-state-school-820250", "employer_name": "Kruger State School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/kuluin-state-school-820499", "employer_name": "Kuluin State School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/krueger-transport-814114", "employer_name": "Krueger Transport", "employer_info": "At Krueger, we are committed to increasing the profitability and productivity of the transport industry, by providing reliable and innovative maximum capacity trailers.\nWe are proud of our 30 plus years as a semi trailer manufacturer servicing the Australian transport industry. As well as manufacturing state of the art semi trailers we provide quality new and used semi trailer solutions which include sales and rentals. We are renowned in the transport industry for our hands-on approach and exceptional customer service. Among our customers are the likes of Tolls, Linfox and TNT.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/krost-business-furniture-800371", "employer_name": "Krost Business Furniture", "employer_info": "These ideals have remained the keystones of our company’s success and at the heart of everything we do. Through our office furniture selection, we will help you shape the right corporate image, have the most productive workplace and create the largest possible return on your investment.\n\nWe are committed to delivering above and beyond our customers’ expectations. As such, we have made a determined commitment to maintain and improve our management systems and environmental management controls and are proudly an ISO 9001 and ISO 14001 certified company.\n\nWe offer a turnkey commercial furniture service. Our full product range can be viewed within these pages and in our showroom. Also, all our workstations and desktops are manufactured locally in Sydney, which allows us to offer a diverse, exclusive and quality-driven collection, unmatched in the industry.\n\nFrom our world-class showroom to our best practice manufacturing facilities, now we are more equipped than ever to offer you the complete office furniture solution.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/kronos-816755", "employer_name": "Kronos", "employer_info": "Innovative workforce solutions. \nDriven by you.\nGuided by decades of experience and innovation, Kronos offers the industry’s most powerful suite of tools and services to manage and engage your entire workforce from pre-hire to retire. And because workforce needs are constantly changing, Kronos solutions are designed to evolve with you to help meet the challenges you face every day — regardless of your industry or where you do business.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/krispy-kreme-433802", "employer_name": "Krispy Kreme", "employer_info": "\r\n\r\n"},
{"employer_url": "https://www.seek.com.au/companies/kraftheinz-435048", "employer_name": "KraftHeinz", "employer_info": "A globally-trusted producer of delicious foods, The Kraft Heinz Company provides high-quality, great taste and nutrition for all eating occasions whether at home, in restaurants or on the go.\nSource: this is an extract from the company's own website"},
{"employer_url": "https://www.seek.com.au/companies/kukerin-primary-school-871362", "employer_name": "Kukerin Primary School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/kpmg-432322", "employer_name": "KPMG", "employer_info": "\n\n"},
{"employer_url": "https://www.seek.com.au/companies/kp-electric-800368", "employer_name": "KP Electric", "employer_info": "KP Electric is an award winning National Electrical Services Provider that specialises in Australia-Wide Electrical Service, Maintenance and Compliance of existing electrical assets through to Projects, Energy Management and Total Solutions. \n\nWe have offices in Sydney, Melbourne, Brisbane, Perth, Adelaide, Hobart, Canberra, Darwin, Sunshine Coast, Gold Coast, Townsville and Newcastle. \n\nWe are focused primarily as an Electrical Industrial & Maintenance Service provider, and do not carry out commercial construction projects. This enables us to provide the most productive and professional services at efficient rates, and deliver on client expectations. \n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/kowanyama-primary-health-care-centre-821582", "employer_name": "Kowanyama Primary Health Care Centre", "employer_info": "Kowanyama offers primary clinical care and primary healthcare services through strong partnerships between nursing staff, and Aboriginal and Torres Strait Islander health workers.\n\nKowanyama provides a suite of regular visiting medical, community and allied health services in partnership with other health and social service providers, including diabetes educators, podiatry, paediatricians, hearing health, mental health, maternal, child health, eye specialists, and ear nose and throat specialists.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/kowanyama-state-school-819443", "employer_name": "Kowanyama State School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/koumala-state-school-819568", "employer_name": "Koumala State School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/korowa-anglican-girls-school-861009", "employer_name": "Korowa Anglican Girls' School", "employer_info": "Korowa Anglican Girls' School is one of Victoria's top independent schools and has been at the forefront of girls' education since 1890. Our Early Learning Centre welcomes 3 & 4 year old girls and boys, then from Prep - Year 12 we offer a specialised all-girls' environment. \n\nA strong focus on the individual student\nAt Korowa, every staff member knows every student and they encourage them to pursue their own unique interests, talents and ambitions - wherever they may lie.\n\nAn outstanding record of success \nKorowa is renowned for our long history of academic excellence. Our NAPLAN and VCE scores consistently placing us in the top tier of schools across the state. Our students' achievements span Sport, Music, Art, Science, Literature and many more. \n\nLimited class sizes\nWe offer small class sizes so that every student can receive the support they need and build positive relationships with their teachers. \n\nFlexible learning styles and curriculum\nWe cater for a range of learning styles and offer a broad curriculum to ensure that the individual needs of every student are met. Teaching is student-centred, drawing on the natural curiosity and interests of students to engage them in the learning process.\nSource: This is an extract from the company's own website"},
{"employer_url": "https://www.seek.com.au/companies/kormilda-college-800367", "employer_name": "Kormilda College", "employer_info": "I take great inspiration from Nelson Mandela’s quote “Education is the most powerful weapon which you can use to change the world”.\n\nI support and promote an underlying philosophy that school is a microcosm of society and, as such, should provide young people with the opportunity to think about their personal values and beliefs and strive ‘towards tomorrow’.\n\nOur high standards are carried across our campus and includes the specialist work which has contributed towards advancing Indigenous Education.\n\nSource: This is an extract from the company's own website"},
{"employer_url": "https://www.seek.com.au/companies/kordia-solutions-433687", "employer_name": "Kordia Solutions", "employer_info": "Kordia Solutions is a leading end to end Australian telecommunications, communications and broadcast service provider.  Kordia has the resources, partnerships and infrastructure to design and deploy challenging, complicated and critical networks.  Our strength is in our people. Today, Kordia employs numerous engineers (specialising in structural and network design, telecommunications systems and Internet Protocol (IP) technology), field technicians and network operations specialists. We have an established network of over 200 partners and subcontractors across Australia. We deploy and maintain critical networks and infrastructure throughout Australia.                                                                                                                          \n\nSource: this is an extract from the company’s own website"},
{"employer_url": "https://www.seek.com.au/companies/kresta-blinds-436786", "employer_name": "Kresta Blinds", "employer_info": "Australia’s Biggest Window Covering Retailer Saves You More!\n\nWhy pay more than you need to? Kresta’s manufacturer direct prices ensure you pay the most competitive price possible on a huge range of quality blinds, curtains, shutters and awnings. Compare the quality of other brands then compare the price – you won’t believe the savings.\n\nShowrooms throughout Australia and New Zealand\n\nKresta has a huge network of showrooms across Australia and New Zealand, each one filled with hundreds of display blinds, curtains, shutters and awnings. Be inspired as you browse through all the latest innovations in window coverings, see Kresta’s full range of custom made products and all the latest designer fabrics and accessories. Kresta’s experienced design consultants are also always on hand with professional advice to ensure you enjoy your Kresta experience.\n\nPride of ownership\n\nThe Kresta group has been retailing window coverings for over 40 years, and we are the largest retailer in both Australia and New Zealand.\n\n\nSource: This is an extract from the company's own website"},
{"employer_url": "https://www.seek.com.au/companies/kordamentha-609557", "employer_name": "KordaMentha", "employer_info": "KordaMentha is an advisory and investment firm that provides Restructuring, Turnaround, Real Estate and Forensic support for companies and their stakeholders. we have grown to become one of Australia’s foremost multidisciplinary advisory and investment firms with prominent forensic, real estate, corporate turnaround and restructuring practices.\n\nSource: this is an extract from the company’s own website"},
{"employer_url": "https://www.seek.com.au/companies/koorong-books-436471", "employer_name": "Koorong Books", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/kununurra-community-health-service-871366", "employer_name": "Kununurra Community Health Service", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/kuehne-and-nagel-433738", "employer_name": "Kuehne & Nagel", "employer_info": "Since 1890, when the business was founded in Bremen, Germany, by August Kuehne and Friedrich Nagel, Kuehne + Nagel has grown into one of the world's leading logistics providers. Today, the Kuehne + Nagel Group has more than 1000 offices in over 100 countries, with over 66,000 employees. Our key business activities and market position are built on the company's truly world class capabilities:\nSeafreight:\nNumber 1 global seafreight forwarder\nSustained year-on-year double digit growth in managed freight\nSolid partnerships with an extensive range of preferred ocean carriers\nAirfreight:\nNumber 2 global air cargo forwarder\nLeader in innovative cargo management concepts\nGlobal Cargo 2000 Phase 2 certification\nContract Logistics & Integrated Logistics:\nNumber 2 global contract logistics provider\nWorldwide network of warehouse and distribution facilities\nNumber 1 global lead logistics provider\nOverland:\nEuropean Top 3 provider\nPan-European overland transportation capabilities, including dedicated and individual delivery services\nClose partnerships with best-in-class carriers\nWe provide logistics services to virtually all key industry sectors including:\nAerospace\nAutomotive\nFMCG\nHigh Tech\nIndustrials\nOil & Gas Logistics\nPharma & Healthcare\nRetail\nKuehne + Nagel is financially strong, stable and independent. Our global logistics network, cutting-edge IT systems, in-house expertise and excellent customer service is proof of our dedication to be the market leader. These attributes have placed us at the forefront of our industry, and positioned us to continue increasing the scope of our customer solutions and services."},
{"employer_url": "https://www.seek.com.au/companies/koorda-primary-school-871347", "employer_name": "Koorda Primary School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/koorana-primary-school-871344", "employer_name": "Koorana Primary School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/kubin-primary-health-care-centre-995990", "employer_name": "Kubin Primary Health Care Centre", "employer_info": "Kubin is one of two communities located on Moa Island (Banks Island). \n\nThe other community is St Paul's, located 22 km away by sealed road.\n\nBoth communities have separate health care centres and operate independently of each other, but are able to support each other if required.\n\nMoa Island is the second largest island in the Torres Strait and lies in the Near Western Cluster, about 40 km north of Thursday Island. \n\nThe population of Kubin is approximately 163 people, with 96% of the population identifying as Aboriginal and/or Torres Strait Islander.\n\nicon\t\nKubin Primary Health Care Centre is managed by a small primary health care team consisting of a remote area nurse, Indigenous health workers and part time operational staff.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/koorana-education-support-centre-871343", "employer_name": "Koorana Education Support Centre", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/koondoola-primary-school-871338", "employer_name": "Koondoola Primary School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/koorda-community-health-service-871346", "employer_name": "Koorda Community Health Service", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/kookai-434286", "employer_name": "Kookai", "employer_info": "KOOKAÏ is an Australian owned women's fashion label, defined by an essence of femininity, confidence, allure and independent style.  The KOOKAÏ collection is designed exclusively out of our Melbourne studio through a creative, symbiotic process – whereby we are ever inspired by the KOOKAÏ woman and, in turn, create pieces through which to continually inspire her.\n "},
{"employer_url": "https://www.seek.com.au/companies/koorana-child-and-family-services-834633", "employer_name": "Koorana Child & Family Services", "employer_info": "Koorana is a community owned non-profit organisation, established over 40 years ago, who provides early education as well as child disability services across the Inner West and South West areas of Sydney. \nKoorana provides diverse services to give you the skills and support your family needs for your children to happily and confidently learn, make friends and reach their potential. \nOur vision is children and their families have supportive connections, discover possibilities and participate to their full potential in all aspects of family and community life. \nOur mission is to provide learning opportunities to all children and their families in a caring environment. \n\nOur Core Values \n\n\n\n\n\n\n-Self Determiniation\n\n \n\n\n\n-Access and Equity \n\n \n\n\n\n-Mutual Respect \n\n \n\n\n\n-Collaboration \n\n \n\n\n\n-Ethics and Integrity \n\n \n\nSource: This is an extract from the company's own website"},
{"employer_url": "https://www.seek.com.au/companies/kookaburra-kids-864486", "employer_name": "Kookaburra Kids", "employer_info": "Australian Kookaburra Kids Foundation, (previously known as Camp Kookaburra) was founded in 2002 by Dianne Madden who through personal experience identified the lack of support for children living in a family affected by mental illness. The first camp was held with 16 kids. Today over 1100 kids are registered to the Kookaburra Kids program.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/konica-minolta-433321", "employer_name": "Konica Minolta", "employer_info": "Konica Minolta Business Solutions Australia is a market leading provider of integrated print hardware and software solutions with the power to transform the business environment. As a technology innovator, Konica Minolta invests continually in research and development in order to deliver inspiring products and give shape to ideas. Globally recognised for its award winning products, Konica Minolta works closely with businesses to deliver a range of multifunctional digital imaging solutions for document scanning, printing and electronic archiving and distribution.\n\nSource: this is an extract from the company’s own website"},
{"employer_url": "https://www.seek.com.au/companies/kondinin-primary-school-871329", "employer_name": "Kondinin Primary School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/konekt-434719", "employer_name": "Konekt", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/konecranes-434840", "employer_name": "Konecranes", "employer_info": "Our long history in lifting businesses\n\nFor over 80 years, we have been dedicated to improving efficiency and performance of businesses in all types of industries. And we have done this by continuously providing lifting equipment and services people can trust.\n\nWhen you choose Konecranes, you acquire a unique source of global experience and knowledge combined with local know-how to empower your lifting solutions and increase your productivity.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/kone-elevators-434245", "employer_name": "KONE Elevators", "employer_info": "We are one of the global leaders in the elevator(lift) and escalator industry. Founded in 1910, we have been committed to understanding the needs of our customers for over a century. We provide innovative and eco-efficient solutions for elevators, escalators and automatic building doors.\n\nOur objective is to offer the best People Flow® experience by developing and delivering solutions that enable people to move smoothly, safely, comfortably and without waiting in buildings in an increasingly urbanising environment.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/koko-black-435822", "employer_name": "Koko Black", "employer_info": "“Inspiring Benefits” – We’re passionate about investing in our people and showing that we value them.\n\nAs a retail or head office team member you will enjoy:\n\nA beautiful working environment where quality and the craft of our produce and service really matters.\nThe opportunity to be part of an amazing team of fun, caring and talented individuals.\nOngoing training and access to the tools required to be successful.\nKoko Black is growing so there is great potential for career progression – we prefer to recruit from within our talented team first.\nGenerous discounts on our product range.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/kolan-south-state-school-819676", "employer_name": "Kolan South State School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/kojonup-district-high-school-871326", "employer_name": "Kojonup District High School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/knox-tavern-803654", "employer_name": "Knox Tavern", "employer_info": "After a spectacular make over, the Knox Tavern re-open its doors again on Monday 25th January, 2016.\n\nWe invite you to come in and see your brand new venue. The new Knox Tavern has a Family Friendly Bistro with a Playground and new Kids 'Monkey' Club, a Sports Bar, Private Dining Room, Café/Lounge and much more...\nStay tuned and we will be posting more updates via our website and social media. We can’t wait to see you back at the venue. \n\nSource: This is an extract from the company’s own website."},
{"employer_url": "https://www.seek.com.au/companies/kogancom-813908", "employer_name": "Kogan.com", "employer_info": "Kogan.com is Australia’s largest online retailer. \nWe pride ourselves on selling the best products for the lowest prices.\n\nFounded in 2006, Kogan.com was created by the young entrepreneur Ruslan Kogan in his parents’ garage. Beginning with LCD televisions shipped directly from the manufacturer to customers, a revolutionary business model was born; one in which unnecessary costs are bypassed and the savings passed on to customers.\n\nThe company has grown over the last few years at an astonishing speed, allowing us to offer more amazing products and reach more customers across the world. We have now delivered over 3,000,000 products worldwide, and our dedication to the Kogan.com mission has never been stronger.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/kogan-state-school-820540", "employer_name": "Kogan State School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/knox-grammar-school-800343", "employer_name": "Knox Grammar School", "employer_info": "The School's vision is expressed in our strategic plan, which is based on the premise that excellence comes when each boy achieves his best in both the curricular and co-curricular environments. The School believes this goal can best be realised within a supportive and stimulating educational environment that includes state-of-the-art education facilities and resources.\n\nSource: This is an extract from the company’s own website"},
{"employer_url": "https://www.seek.com.au/companies/kuipers-engineering-803689", "employer_name": "Kuipers Engineering", "employer_info": "Kuipers Engineering is family owned and operated, providing innovation and quality of design, service and manufacture. Founded on person to person customer relations, Kuipers has grown to be a dynamic, results focused organisation, one which is well known and respected by professionals in industry, customers and competitors.\n\nWe use modern engineering tools, including 3D CAD design software and FEA stress analysis software, along with a comprehensive design process to ensure your project requirements are met effectively and efficiently.\n\n\n•From concept, design through to production line  \n•Fire tankers, all categories built to NSW Rural Fire Service and Emergency Services specification \n•Rescue and Emergency Services support vehicles customised to suit your needs \n•Fleet Services, commissioning and decommissioning\n•Bulk Tankers for fire fighting, councils and special purpose \n•Specialised vehicles including ballistics and sophisticated security and electronics \n•Vehicle Marking, decals, signwriting and engraved labels \n•Spare parts for old and new design Fire Tankers, including Lockers and Hose Reels \n•Supply or manufacture replacement tanker body parts for insurance claims\nKuipers Engineering Pty Ltd is an Australian owned family company. Established over 50 years ago, Kuipers is a flexible and dynamic enterprise, fiercely focused on quality and service. \n\nKuipers' centre of operations is a modern factory complex in historic Windsor close to all key transport arteries.  \n    \nFounded on person to person customer relations, Kuipers has grown to be a dynamic, results focused organisation, one which is well known and respected by professionals in industry, customers and competitors.\n\nUsing state of the art 3D CAD software, committed to quality in every phase of operations, the Kuipers family team will give your project the kind of personal attention you would expect, from concept through design to manufacture, trial and commissioning.\n \nContractor to NSW Rural Fire Service, building light, medium and heavy fire tankers to fight bush fires across the State.\n\nEngineer, prototype and manufacture armoured and semi-armoured vehicles for cash transit and support vehicles.\n\nManufacturer of rescue vehicle bodies for Fire and Rescue, NSW Police and State Emergency Services.\n\nSupplier of signs, hose reels, accessories and spare parts for tankers.\n\nOur customers include:\n•Rural Fire Services \n•SES\n•Councils \n•NSW Police \n•Department of Environment, Climate Change and Water\n•Power stations \n•Mining Companies \n•Royal Australian Navy\n•NSW Fire Brigade\n•Country Fire Authority\nSource: this is an extract from the company’s own website."},
{"employer_url": "https://www.seek.com.au/companies/kojonup-hospital-871327", "employer_name": "Kojonup Hospital", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/kondinin-health-service-871328", "employer_name": "Kondinin Health Service", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/knox-city-council-435582", "employer_name": "Knox City Council", "employer_info": "The City of Knox is located approximately 25kms from the Melbourne GPO. Knox is one of the most populous municipalities in Victoria with just over 154,000 residents living in eleven localities. Knox residents are proud of their city’s leafy green image. They are protective of the nearby Foothills and other special places of biological significance. It is a community concerned for the welfare of others with residents from 130 different countries who speak 54 languages.\n\nThe City of Knox includes the suburbs of Bayswater, Boronia, Ferntree Gully, Knoxfield, Lysterfield, Rowville, Sassafras, Scoresby, The Basin, Upper Ferntree Gully, Wantirna, and Wantirna South.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/knotts-crossing-resort-803651", "employer_name": "Knotts Crossing Resort", "employer_info": "Knotts Crossing Resort, is situated in the picturesque Katherine Region of Australia’s Northern Territory.\n\nApproximately 320 kms from Darwin and Kakadu National Park in the Top End of Australia, the resort is set amongst acres of stunning tropical gardens and is just a two minute walk from the Katherine River.\n\nRelax with a book and a cold drink by the pool and enjoy the Top End’s fabulous weather.\n\nMake the resort your base while you explore the wonders of Katherine Gorge (Nitmiluk National Park), Edith Falls, Cutta Cutta Caves, Elsey National Park and the many other fascinating destinations in and around Katherine.\nSource: this is an extract from the company’s own website"},
{"employer_url": "https://www.seek.com.au/companies/knight-piesold-consulting-438203", "employer_name": "Knight Piesold Consulting", "employer_info": "Knight Piésold is an employee-owned global consulting firm that provides specialized services to the mining, power, water resources, infrastructure, and oil and gas industries. We are engineers, environmental scientists, geoscientists, and technologists who focus on creating value at every stage of a project through quality driven, sustainable, and cost-effective solutions.\n\nEstablished in South Africa in 1921, we have expanded our reach into a global network of over 750 professionals based in offices in North and South America, Europe, Africa, Australia, and Asia. \n\nBy developing close working relationships and focusing on the specific and unique needs of each one of our clients, we work together to understand each project and business in today’s global environment.  With a commitment to quality, safety, and technical excellence, Knight Piésold specializes in creating tailored solutions at every stage of a project life cycle while delivering sustainable bottom-line results. We have led numerous award-winning projects to completion, and have fostered many long-term client relationships that still hold strong today.\nSource: This is an extract from the company's own website"},
{"employer_url": "https://www.seek.com.au/companies/knox-private-hospital-436693", "employer_name": "Knox Private Hospital", "employer_info": "Knox Private Hospital's focus is to provide their patients with world-class healthcare.\n\nAs one of the largest private healthcare providers in Victoria, Knox Private Hospital provides a comprehensive range of healthcare to over 1.2 million people in Melbourne's east and south-eastern suburbs.\n\nKnox Private Hospitals is a 359 patient-bed facility and provides a large range of medical and acute services including; 12 theatres, a 24 hour Emergency Department, an on-site medical team, a 10-bed Intensive Care Unit, a 10-bed Coronary Care Unit and a Day Procedure Unit.\n\nIn collaboration with a large range of accredited private specialists Knox Private are leader in comprehensive range of medical and surgical specialties including, but not limited to, cardiology, cardiac and general surgery, obstetrics and gynaecology, neurosurgery, orthopaedics, urology, plastics and vascular surgery\n\n\nSource: This is an extract from the company's own website"},
{"employer_url": "https://www.seek.com.au/companies/kloud-solutions-816754", "employer_name": "Kloud Solutions", "employer_info": "As commercial demands continue to grow, organisations are increasingly looking at ways to address these with ever-decreasing resources. To remain competitive, organisations must evolve and find ways to improve efficiencies and reduce costs while minimising risk. Cloud computing allows organisations the flexibility and freedom to meet these growing demands.\n\n\n\n\nKloud has been assisting large Corporate and Government Agencies across Australia since 2010 to adopt and take advantage of cloud technologies. We integrate hosted solutions with existing on-premises architectures and establish effective systems and infrastructure management for maximum IT advantage and business value.\nKloud is a proud Microsoft Azure, Amazon and Telstra partner, enabling us to ensure your business is cloud ready through cloud strategy and roadmaps. We can provide the best value to meet your needs with:\n•Providing a common understanding of what it means to target the cloud\n•Setting goals and ordering the approach to identify commodity workloads\n•Defining the migration and remediation activities to enable the adoption of cloud Identification of corresponding de-provisioning and de-allocation of on-premises resources and capital, both human and physical.​\nSource: This is an extract from the company's own website"},
{"employer_url": "https://www.seek.com.au/companies/kmart-tyre-and-auto-service-434420", "employer_name": "Kmart Tyre & Auto Service", "employer_info": "Kmart Tyre & Auto Service is one of Australia's largest retail automotive service, repair and tyre business more than 240 stores nationwide. With over 1,300 employees nationally, they’re one of the largest employers in the industry, and also the largest single employer of apprentice motor mechanics in Australia"},
{"employer_url": "https://www.seek.com.au/companies/klohn-crippen-berger-861358", "employer_name": "Klohn Crippen Berger", "employer_info": "Formed in 1951, KCB has a long history of participating in some of the largest and most challenging engineering projects in the world; projects that have helped develop resources, reclaim landscapes, build communities and stimulate economies. In fact, our projects continue to stand the test of time and, today, we work on many sites that we helped develop decades ago.\n\nWe have a strong reputation for quality work and technical experience in a range of services. Our commitment to excellence is the driving force behind everything we do and, as a result, we are the recipient of over 50 national and international awards for major projects.\nSource: this is an extract from the company’s own website."},
{"employer_url": "https://www.seek.com.au/companies/kmart-432302", "employer_name": "Kmart", "employer_info": "Kmart opened Australia’s first discount department store in Burwood, Victoria in 1969. It was the beginning of an Australian icon that has become one of Australia’s favourite and most recognisable retailers. Today, Kmart delivers irresistibly low prices through more than 190 stores across Australia and New Zealand. We work hard to ensure you get the lowest prices possible on the items you and your family need every day. So, if you haven’t been in to a Kmart store for a while, come in and experience the new Kmart for yourself. We’re sure you’ll like it.\n\nSource: this is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/komatsu-433314", "employer_name": "Komatsu", "employer_info": "\n\n"},
{"employer_url": "https://www.seek.com.au/companies/kleinfelder-861213", "employer_name": "Kleinfelder", "employer_info": "We are an integrated, cross-disciplinary team of bright, curious, and innovative problem solvers dedicated to doing the right thing, every day on every project. We work closely with clients, giving the best of ourselves, to deliver creative and practical solutions that address our world’s most complex infrastructure challenges. \nToday’s engineering problems are a complex mix of challenges and considerations. Kleinfelder brings well-rounded, holistic thinking and wide-ranging technical experience to help you move forward. Kleinfelder clients get the benefit of more than 50 years’ experience. Half a century of quality engineering doesn’t mean stuffy or stuck—in fact, it’s the agility to adapt to our clients’, and the world’s, changing needs that keeps us at the leading edge. \nSource: this is an extract from the company’s own website."},
{"employer_url": "https://www.seek.com.au/companies/kleenheat-434337", "employer_name": "Kleenheat", "employer_info": "We have a long history in the Australian gas industry with 60 years of experience retailing and distributing Liquefied Petroleum Gas (LPG), over a decade of experience distributing Liquefied Natural Gas (LNG) and advancing technology through our brand EVOL LNG, and most recently retailing natural gas in Western Australia.\n\nKleenheat is part of Wesfarmers Chemicals, Energy and Fertilisers, one of seven divisions of Wesfarmers Limited, with origins dating back to 1914.\n\nKleenheat supplies LPG to a broad range of residential, commercial, forklift, automotive and industrial customers through a network of depots, company operated branches, commissioned agents and dealers Australia wide.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/klara-cosmetics-800339", "employer_name": "Klara Cosmetics", "employer_info": "Australian owned and designed, Klara Cosmetics is the first concentrated range of cosmetics, made with 100% pigmentation. \n\nNamed after its visionary founder – Klara Sabotkoski –the innovative makeup line provides every woman with the result that professionals have been striving towards for years. “Professional Makeup for Life”: this is how Klara sums up its vision. The inaugural range that launched in Australia in 2013 sold out within the first week, with makeup gurus and beauty connoisseurs addicted to the on trend palettes and high performance products.\nSource: this is an extract from the company’s own website"},
{"employer_url": "https://www.seek.com.au/companies/kk-technical-services-861080", "employer_name": "KK Technical Services", "employer_info": "KK Technical Services was formed in 1989 and specialises in the distribution, installation and “end of life” processing of a range of digital imaging and technology products. Operating on both a state and national basis, our services cover tasks for many of the world’s leading information technology companies.  \nA family owned and operated business, KK Technical Services has thrived on its reputation for service excellence. From its humble beginnings as a sole operator courier service, KK has grown by tailoring solutions and bringing substantial process improvements to meet customer requirements. \n\n\n\nThrough unrivalled service and word of mouth alone, KK has evolved into the successful business that it is today.\nSource: this is an extract from the company’s own website."},
{"employer_url": "https://www.seek.com.au/companies/kjm-contractors-433468", "employer_name": "KJM Contractors", "employer_info": "KJM Contractors' vision is to be the leader in total logistic support and remote site solutions in Australia. We aim to be the company of choice and provide one-stop services to the mining, exploration and geothermal industries through innovative management of our assets and our people, whilst ensuring the safest, highest quality, reliable and efficient service to our customers. \n\nSource: this is an extract from the company's own website"},
{"employer_url": "https://www.seek.com.au/companies/kitchen-connection-436333", "employer_name": "Kitchen Connection", "employer_info": "Welcome to a totally fresh approach to kitchen design and functionality. We create kitchens that work for you and your family.\n\nWe believe the best kitchen designs are the ones created by people who understand your needs.\n\nOur design experts know how to incorporate your ideas into their designs to create the perfect kitchen that complements your lifestyle and your home.\n\nWe offer a wide range of new kitchens, based on the latest European design concepts – they are simple, beautifully stylish, yet exceptionally functional.  All Kitchen Connection kitchens are warranted for 10 years workmanship. Now that’s what we call peace of mind.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/kitchen-innovations-813880", "employer_name": "Kitchen Innovations", "employer_info": "One Stop Total Solution\n\nSince 1994 Kitchen Innovations (KI) has been providing a high level of service and commitment to their customers in the kitchen industry. We design, manufacture, supply and install the highest quality kitchens, bathrooms and joinery.\n\nToday, we have raised the standard by offering a greater range of products and services, now not only including joinery, stone bench tops and glass splashbacks but also a range of appliances so we can deliver you a complete solution.\n\nOne of our latest innovations in kitchen solutions is the implementation of a simplified, integrated model in obtaining your new kitchen; we call it the One Stop Total Solution.\n\nThe One Stop Total Solution provides peace of mind to all our clients through:\n\nExpert consultation on kitchen design\nAssurance of quality kitchen construction\nProvision of an issue-free installation by our dedicated team\nAfter sales service & warranty support and\nFinally, one invoice for your convenience\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/kitchen-food-company-814014", "employer_name": "Kitchen Food Company", "employer_info": "WE ARE PASSIONATE ABOUT FOOD - PREMIUM QUALITY FRESH FOOD SOLUTIONS\nIf you are one of the millions of Australian consumers that value convenient, wholesome, fresh prepared foods, then chances are you have already had the opportunity to enjoy something from our ever changing and expanding product range.\n\nWe are truly passionate about food. Our highly trained and dedicated team  lovingly hand make our diverse range of ready meals, sandwiches, wraps, salads and desserts each and every day, which are distributed fresh daily to our partners in the retail & foodservice sectors across the country.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/kirwan-state-school-820316", "employer_name": "Kirwan State School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/kirwan-state-high-school-820313", "employer_name": "Kirwan State High School", "employer_info": "Our intent is to provide educational excellence for tomorrow’s citizens.  Our philosophy is to enable greatness through an inclusive culture underpinned by a mindful school community built on professionalism, continuous improvement and accountability.\n\nAt Kirwan High, we value learning and citizenship above all else.  We believe that all students can learn and achieve at a high level.  We prepare students for the future.  We develop confident, caring citizens.​\nSource: this is an extract from the company’s own website."},
{"employer_url": "https://www.seek.com.au/companies/kirra-beach-hotel-438146", "employer_name": "Kirra Beach Hotel", "employer_info": "The Iconic Kirra Beach Hotel has been trading for over 50 years. Built in 1956 and situated directly across from the world famous Kirra Beach, you can sit back relax and admire the spectacular views in a welcoming setting.\nOpen from 10am till late our public bar has a large range of beers, ciders, wines and everyones favourites.\nThere is non stop sports on the TV's, TAB facilities with two terminals and all the races live on the big screens or try your luck on KENO.\nOur gaming room offers 40 of the best electronic gaming machines. CHILDREN ARE NOT PERMITTED IN THE GAMING ROOM.\nMeat raffles are held Thursdays, Fridays and Saturdays.\nWith easy access parking at the back of the hotel or utilise our courtesy bus available Wednesdays-Saturdays, ATM and DOSA.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/kirup-primary-school-871315", "employer_name": "Kirup Primary School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/kirkbrae-presbyterian-homes-803634", "employer_name": "Kirkbrae Presbyterian Homes", "employer_info": "Kirkbrae Presbyterian Homes is a seniors living community located in Kilsyth since 1960. It is a place of mission and ministry for the Presbyterian Church of Victoria providing high quality retirement living and aged care services for people in the outer eastern suburbs of Melbourne. Kirkbrae is a Scottish word meaning ‘Church on a Hill’. Appropriately, one of the first buildings, and at an elevated part of the site, was a Chapel prominently located near an entrance. As a community based residential service, Kirkbrae offers compassionate support, care and services based on the Christian principles of the bible as adopted by the Presbyterian Church.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/kirkbee-group-928751", "employer_name": "Kirkbee Group", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/kintore-street-school-988199", "employer_name": "Kintore Street School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/kippa-ring-state-school-819719", "employer_name": "Kippa-Ring State School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/kioma-state-school-819477", "employer_name": "Kioma State School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/kintetsu-world-express-928726", "employer_name": "Kintetsu World Express", "employer_info": "Kintetsu Corporation\n\nFounded in 1910 as the Osaka Electric Railway, serving the thirty kilometre route between Osaka and Nara, Kintetsu Corporation has grown into the largest private railway company in Japan, servicing 600 million passengers per year. Today, the Kintetsu Group consists of over 130 affiliated companies with products and services accross the globe. Total revenue exceeds USD $17.5 billion, with over 50,000 persons employed worldwide.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/kinross-primary-school-871307", "employer_name": "Kinross Primary School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/kinross-college-871306", "employer_name": "Kinross College", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/kinnect-813824", "employer_name": "KINNECT", "employer_info": "KINNECT was established in 1996 as a provider of Occupational Injury Prevention, Injury Management, Health and Medical services.  KINNECT has since grown to become the #1 Privately Owned Occupational Health Company in Australia.  This combined with our close network of affiliate providers gives us capacity to deliver our suite of Occupational health services both nationally and internationally.\n\nWe are a multi-disciplinary team of medical and allied health professionals who are passionate about making people at work Healthy, Safe and Productive.  Our length of time in this industry has enabled us to develop strong and close relationships with General Practitioners, Specialists and other allied health professionals in order to meet our client’s entire needs.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/kingswood-college-800323", "employer_name": "Kingswood College", "employer_info": "Kingswood College is an independent co-educational Kindergarten to Year 12 College of the Uniting Church. Our ethos is to encourage and support each student to achieve their personal best.\n\nStudents at the College benefit from a holistic education, one that develops the whole person - their Mind, Body, Heart and Spirit.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/kingsway-christian-college-800322", "employer_name": "Kingsway Christian College", "employer_info": "Since 1984, Kingsway Christian College has established a reputation for providing a dynamic educational foundation for life, in addition to maintaining our commitment to a Christ-centred approach to learning. We are excited to offer a learning programme to your son or daughter that is founded on the understanding that every child has the opportunity to achieve. We value all our families and encourage parents to become an integral part of our school community and so contribute to the development of your child’s talents.\n\nWe believe that our purpose for existing is to honour, value and support all the children in our care. We have committed to adding value to each child through the provision of programmes that are designed to support, nurture and enrich their lives. Kingsway Christian College strives to open new doors for each child by acknowledging and encouraging personal interests, talents and needs.\n\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/kingswim-928676", "employer_name": "Kingswim", "employer_info": "Hi there! We’re Kingswim and we’re super excited you’ve decided to visit! Thanks to the many families across Australia who recommend Kingswim, you may have heard a little bit about us already… but we’d love to introduce ourselves anyway.\n\nWe are specialists in teaching kids to swim. We’ve been doing it for over 30 years, and have delivered more than 11 million lessons.\nWe teach tiny tots through to big kids, with programs available to babies from 12 weeks of age, right through to graduate level swimmers.\nWe provide a dedicated learn to swim environment, with purpose built learning areas such as graded pool depths and lane lengths. We have warm water and pool deck temperatures, immaculate water quality, and family friendly change rooms, all of which help to provide a comfortable experience for kids and parents.\nOur programs are Swim Australia registered, and all of our teachers hold nationally recognised qualifications. So along with our decades of experience, you can be assured that our programs are up to date, relevant and accredited.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/kolbe-catholic-college-800349", "employer_name": "Kolbe Catholic College", "employer_info": "Our college is a new co-educational Year 7 – 12 school serving the people of the northern suburbs of Melbourne. Officially established by the Archdiocese of Melbourne in late 2006, as a Year 7 to Year 12 Archdiocesan College, Kolbe Catholic College will welcome its first students to Year 7 in January 2008.\n\nThe College is named after St Maximilian Kolbe. His legacy is a story of heroism, courage and self-sacrifice; a beacon of hope for the future. St Maximilian Kolbe’s Feast Day is 14th August – the day he died at the Auschwitz Concentration Camp in 1941, at the age of 47 – having offered his life in substitution for the life of a fellow prisoner who had been condemned to death.\n\nThe College motto – Faith, Courage, Compassion – encompasses the legacy of St Maximilian Kolbe and a vision to provide students with every opportunity to make the most of what life has to offer, to strive to be their very best and be inspired to serve others.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/kingston-state-school-820474", "employer_name": "Kingston State School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/kingston-primary-school-tas-988197", "employer_name": "Kingston Primary School TAS", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/kingston-primary-school-wa-988198", "employer_name": "Kingston Primary School WA", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/kingston-fireworks-928637", "employer_name": "Kingston Fireworks", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/kingston-high-school-871294", "employer_name": "Kingston High School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/kingston-park-raceway-436785", "employer_name": "Kingston Park Raceway", "employer_info": "For the ultimate adrenaline-pumping experience, look no further than Kingston Park Raceway. Feel the speed and exhilaration as you zoom around the track at Australia’s premier go karting and amusement venue. With three specially-designed outdoor tracks and over 100 go karts to satisfy your need for speed, a trip to Kingston Park Raceway is one hell of a day out!\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/kingston-estate-wines-437911", "employer_name": "Kingston Estate Wines", "employer_info": "The winery was built in 1985 on the corner of the family property next to our original vineyard as well as the family home.\n\nToday the winery can be considered two wineries in one: the original winery and the modern extension.\n\nThe original winery is where we make our small batch super premium wines giving us the flexibility and control to develop parcels of wine into exciting styles that truly reflect the varieties and regions from which they come.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/kingston-city-council-609490", "employer_name": "Kingston City Council", "employer_info": "The City of Kingston is about 20km south of Melbourne's Central Business District. Kingston is home to beautiful beaches, world-class golf courses, bushy reserves, tranquil wetlands, bicycle and walking trails and top retail outlets.\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/kingston-international-college-800320", "employer_name": "Kingston International College", "employer_info": "What we offer\nWould you like to take an English course or study Business, International Trade, Marketing, Hospitality, Theology or Early Childhood Education in Australia? Kingston International College is an international college based in Perth, Western Australia. We offer English and nationally recognised vocational courses to international students.\nOur English Courses include: General English, IELTS Intensive Preparation and IELTS Class Pass™. Our Vocational Courses (VET) include: Business, International Trade, Leadership, Marketing, Early Childhood Education, Theology and Hospitality.\nAt Kingston International College, we recognise and appreciate cultural differences. Our staff and students come from all over the world, so our students never feel alone. Our college provides a friendly and relaxed environment where students can learn English, and improve their skills with vocational courses.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/kingspan-environmental-834612", "employer_name": "Kingspan Environmental", "employer_info": "Kingspan Environmental are part of the Kingspan Group PLC, a world leader in the supply of high performance building products to the construction industry. We are a global company with offices in over 80 locations. We operate in sectors including domestic, commercial, agricultural, industrial, transportation/logistics and municipal – and that’s just a few. We’re a company that’s growing fast, and with demand for water and energy predicted to increase by 50% by 2025, we don’t think that’s going to change. Our Expertise & Innovation With one of the longest standing reputations in all of the areas of business we work in, Kingspan Environmental have been creating sustainable, renewable and environmentally friendly solutions for domestic and large scale projects across the world. At the heart of our business is innovation, manufacturing excellence and excellent customer service. See How Kingspan Environmental can help you: Fuel and storage tanks > Wastewater and drainage > Hot water cylinders > Services & Monitoring > Renewable technologies > - See more at: https://www.kingspanenviro.com/about-kingspan-environmental#sthash.fZY2n9qI.dpuf. \n\nSource: this is an extract from the company’s own website."},
{"employer_url": "https://www.seek.com.au/companies/kingsgate-consolidated-928571", "employer_name": "Kingsgate Consolidated", "employer_info": "XPERIENCED PACIFIC RIM GOLD PRODUCER, KINGSGATE CONSOLIDATED LIMITED (ASX:KCN) IS A HIGHLY SUCCESSFUL ASX LISTED GOLD COMPANY WITH SIGNIFICANT EXPERTISE IN GOLD EXPLORATION, DEVELOPMENT AND MINING, USING WORLD’S BEST PRACTICE FOR SAFE, ENVIRONMENTAL AND SOCIALLY RESPONSIBLE OPERATIONS.\nThe Company was listed in 1988 and commenced gold production at its Chatree Gold Mine (“Chatree”) in central Thailand in 2001. Kingsgate is the owner of Chatree through its Thai subsidiary, Akara Resources Public Company Limited.\n\nSince operations commenced in 2001, Chatree has produced more than 1.8 million ounces of gold, and more than 10 million ounces of silver. In recent years, Chatree has operated at a rate of approximately 125,000 to 135,000 ounces per annum.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/kingsley-primary-school-871291", "employer_name": "Kingsley Primary School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/kingsford-smith-school-871286", "employer_name": "Kingsford Smith School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/kings-swim-school-928623", "employer_name": "Kings Swim School", "employer_info": "Hi there! We’re Kingswim and we’re super excited you’ve decided to visit! Thanks to the many families across Australia who recommend Kingswim, you may have heard a little bit about us already… but we’d love to introduce ourselves anyway.\n\nWe are specialists in teaching kids to swim. We’ve been doing it for over 30 years, and have delivered more than 11 million lessons.\nWe teach tiny tots through to big kids, with programs available to babies from 12 weeks of age, right through to graduate level swimmers.\nWe provide a dedicated learn to swim environment, with purpose built learning areas such as graded pool depths and lane lengths. We have warm water and pool deck temperatures, immaculate water quality, and family friendly change rooms, all of which help to provide a comfortable experience for kids and parents.\n\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/kingsford-smith-preschool-unit-875098", "employer_name": "Kingsford Smith Preschool Unit", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/kings-meadows-high-school-871280", "employer_name": "Kings Meadows High School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/kings-transport-432999", "employer_name": "Kings Transport", "employer_info": "Kings Transport & Logistics is an Australian owned and operated company that was established in 1991 with 3 staff, 2 vehicles and a vision to succeed.\nToday, Kings now employ more than 700 staff, engages over 1300 subcontracted drivers and more importantly, offers a diverse range of career opportunities across Australia and New Zealand.\nKings understands that to succeed in today's competitive environment we need to attract and retain quality staff.  We achieve this by creating opportunities that allow our people to achieve their personal and professional goals. \nSource: this is an extract from the company's own website\n "},
{"employer_url": "https://www.seek.com.au/companies/kings-christian-college-800308", "employer_name": "King's Christian College", "employer_info": "King's is a Christian School. We were founded by a group of parents from the King's Church and our Christian ethos is woven through everything that we do.\n\nWe operate from two campuses on Queensland’s Gold Coast. Our Reedy Creek campus was established in 1980 and offers Childcare and Preschool as well as Primary and Secondary schooling plus a Trade Training Centre on the same campus. \nOur Pimpama campus was opened in 2015 in the fast-growing northern Gold Coast region. This campus offers Childcare, Pre-Prep and Primary school (Prep to Year 4. Each year a new year level will be added as our students progress, with Secondary school due to start in 2019.)\n\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/kings-canyon-resort-803608", "employer_name": "Kings Canyon Resort", "employer_info": "Kings Canyon is located in Australia’s Northern Territory and is accessible via a loop off the main highway running between Uluru (Ayers Rock) and Alice Springs.\n\nOur sensitively designed property is located in Watarrka National Park, just nine kilometres from Kings Canyon. Naturally, the Kings Canyon Resort has been built to blend in harmoniously with the surrounds. Kings Canyon offers a wide range of accommodations.\n\nThe property includes the Kings Canyon Hotel with Standard Rooms and Deluxe Spa Rooms and the Holiday Park with a real Outback Caravan Park & Campground and Backpacker Accommodation. Both offer a level of comfort you wouldn’t expect in such a remote location\nSource: this is an extract from the company’s own website."},
{"employer_url": "https://www.seek.com.au/companies/kings-cross-hotel-803613", "employer_name": "Kings Cross Hotel", "employer_info": "Located up the stairs on level 4 is the Kings Cross Hotel ‘Bordello Room’ function space. With a vintage, 1920s style bordello décor, Level 4 has a luxe interior, semi-private seating nooks and a fully stocked bar, it’s perfect for your private party.\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/kingfisher-bay-resort-434455", "employer_name": "Kingfisher Bay Resort", "employer_info": "The Kingfisher Bay Resort Group, managed by Tourism Leisure Corporation, incorporates the award-winning Kingfisher Bay Resort, Eurong Beach Resort, Fraser Island Barges,Fraser Explorer Tours and the Fraser Island Cool Dingo Tour.\nThe Kingfisher Bay Resort Group is the largest tourism operator on World Heritage-listed Fraser Island and in the Fraser Coast/Hervey Bay region. The company employs some 600 staff in tourism businesses focused on Fraser Island including resorts, tours and ferries. The group has been operating on Fraser Island for more than 15 years, from around the time Fraser Island was World Heritage-listed.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/kingman-visual-928523", "employer_name": "Kingman Visual", "employer_info": "At Kingman, paint runs through our veins, not blood.\n\nWe love Signs.\nKingman Visual is a family owned and operated business where passion for quality and customer service is one of our core values.\n\nVernon & Dianne Kingman started the business in 1984 and over time Kingman Visual has grown into one of the largest signage companies in Australia.\n\nAt Kingman, we have a strong reputation for the quality of work we do. We are a full in-house manufacturing company that covers everything from vinyl graphics, signwriting, all the way through to metal fabrication and painting.\n\nAs a company it is important for us that your buying experience with us is memorable and we work very hard to ensure you are getting the best value from us in every aspect of your signage purchase. From product specification to meet your lifespan expectations, to installation planning with our qualified team and updates back to you on progress.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/kingpin-bowling-753259", "employer_name": "Kingpin Bowling", "employer_info": "AN ENTERTAINMENT EXPERIENCE LIKE NO OTHER. \nKingpin is not just about Bowling, it is a full entertainment experience. Kingpin wants you to feel like royalty every time you visit and experience an exclusive atmosphere that no other bar or club could of-fer. With fully licensed bars, curated food menus and the widest activates range in Australia, Kingpin is the spot for your next outing.\n\nSource: This is an extract from the company's own website"},
{"employer_url": "https://www.seek.com.au/companies/kingborough-council-803603", "employer_name": "Kingborough Council", "employer_info": "Welcome\nThe Kingborough municipality has one of the longest stretches of picturesque coastline in Tasmania and is the perfect area to explore many beautiful beaches and bushland, including the spectacular Bruny Island.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/kingaroy-state-school-819375", "employer_name": "Kingaroy State School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/kingaroy-state-high-school-820593", "employer_name": "Kingaroy State High School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/kingsthorpe-state-school-819507", "employer_name": "Kingsthorpe State School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/kingaroy-hospital-821498", "employer_name": "Kingaroy Hospital", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/king-living-928522", "employer_name": "King Living", "employer_info": "The King Living Trade & Commercial division caters to the unique demands of architecture and design communities in Australia and overseas. Registered Architects, Interior Architects, Interior Designers, Specifiers and procurement officers now have a central point of contact to discuss and manage commercial projects.\n \nAs a King Living Trade & Commercial member, you'll enjoy special buying privileges including competitive pricing and expert advice to help you service your clients better. \n \nTo apply for a King Living Trade & Commercial Account, please complete the form below. \n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/king-of-knives-435122", "employer_name": "King of Knives", "employer_info": "King of Knives and Chef King stores carry only the best quality kitchen knives. Knives generally come either individually or as a set or block set. Whilst brands like Bismarck, Wusthof, Brasilia and Ran represent great quality and value for money, the right knife for you is as individual as your hand.  We have it all from European style to Jananese and from steel to ceramic.  \n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/king-furniture-800299", "employer_name": "KING FURNITURE", "employer_info": "Who We Are\nKing Living is famous for designing and manufacturing contemporary, award-winning furniture, since 1977. Every year King Living introduces new designs and take advantage of new technologies to offer customers the very best furniture. Comfort, style, sophistication and durability are the key features of every King Living sofa.\n\nSource: This is an extract from the company's own website"},
{"employer_url": "https://www.seek.com.au/companies/king-island-district-high-school-871274", "employer_name": "King Island District High School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/king-edward-memorial-hospital-795991", "employer_name": "King Edward Memorial Hospital", "employer_info": "About Women and Newborn Health Service\nIn mid-2006, as part of the health reform in Western Australia, King Edward Memorial Hospital (KEMH) joined with other women's based health services to form the new Women and Newborn Health Service (WNHS), which is a part of the larger North Metropolitan Area Health Service.\n\nKEMH was formerly a part of the Women's and Children's Health Service (WCHS) along with Princess Margaret Hospital for Children (PMH).\n\nWith dedicated staff and best practices based on the most current evidence-based medicine, WNHS continues to deliver first-class health care to women and infants in WA.\n\nKEMH is the State's only tertiary maternity and gynaecological hospital and treated its first patients in 1916. Today more than 6000 births take place at the hospital every year and it is WA's only major referral centre for high-risk pregnancies. KEMH also has a state-of-the-art Special Care Nursery, designed to care for premature and sick infants.\n\nKEMH also cares for approximately 5000 women with gynaecological conditions each year - from urological and cancer related problems to sexually transmitted diseases and reproductive disorders.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/king-content-814533", "employer_name": "King Content", "employer_info": "King Content is a leading global content marketing agency, recognised for creating award-winning end-to-end content marketing strategies.\n\nHaving undergone a rapid expansion into international markets over the last two years, King Content has maintained its focus on customised content for geographic markets, delivering bespoke strategies capable of truly resonating with local audiences.\n\nWhether the objective is brand awareness, engagement or lead nurturing, our team of experienced content and social media specialists understand how to create content that targets and captivates brand audiences throughout the buyer journey. Our holistic approach and expertise in all areas of strategy, content development, amplification and measurement make us a truly valuable partner to brands looking to make an impact as publishers.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/kindalin-814785", "employer_name": "Kindalin", "employer_info": "THE KINDALIN VISION\nWe aim to provide every child with a stimulating and challenging environment in which to grow and learn.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/kinetic-it-433231", "employer_name": "Kinetic IT", "employer_info": "\n\n"},
{"employer_url": "https://www.seek.com.au/companies/kincrome-tools-and-equipment-814295", "employer_name": "Kincrome Tools & Equipment", "employer_info": "In a short period of time we have come a long way\n\nOur business commenced in 1987 as a privately owned company and remains that way today. Initially as a supplier into the automotive aftermarket industry, Kincrome now has a broad spread of Trade & Retail customers within the Automotive, Industrial and Hardware markets.\n\nWe have remained committed to these markets and our aim is to continue to focus on these markets, developing our own brand strategy. We believe in our brands and are committed to developing our brands through focusing on our core range of products, category management and a supporting Marketing Plan.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/kincare-433451", "employer_name": "Kincare", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/kincoppal-rose-bay-school-814269", "employer_name": "Kincoppal-Rose Bay School", "employer_info": "Kincoppal-Rose Bay is a member of the international group of Sacred Heart Schools conducted by the Society of the Sacred Heart, a Catholic teaching order established by Saint Madeleine Sophie Barat in France in 1800.\n\nThe Convent of the Sacred Heart, Rose Bay, was founded in 1882. Kincoppal was established at Elizabeth Bay in 1909. The two schools were amalgamated in 1971 to become Kincoppal-Rose Bay School of the Sacred Heart.\n\nOur original building was a private home called Claremont which was built in 1851. It was first leased in 1882 and later purchased by the Society of the Sacred Heart.\n\nThe school's first permanent building was completed in 1888.  Our Chapel, designed by architect John Horbury Hunt, was completed in 1900. Since that time, more buildings have been added to meet the needs of our growing school community.\n\nOur primary school was located in the main school building until 1951, when an adjoining property (an Italian villa) was purchased.  This was demolished in 1966 and replaced with the present junior school.\n\nThe Senior School was a full boarding school until the 1960s when day students were admitted.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/kin-kora-state-school-820534", "employer_name": "Kin Kora State School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/king-and-wood-mallesons-434392", "employer_name": "King & Wood Mallesons", "employer_info": "King & Wood Mallesons is a new breed of law firm combining local depth with a global platform. We are working with clients every day to understand local challenges and navigate through regional complexity. With access to a global platform, we are providing commercial solutions and transforming the way legal services are delivered. Our Australian practice spans international, local and regional blue-chip corporations, financial institutions and government entities. We couple high performance with lateral thinking to provide legal solutions that are bespoke, commercial and often ground breaking. We are delivering deep industry expertise, experience and insights across the full spectrum of commercial, financial and specialist legal services.\n\nSource: this is an extract from the company’s own website"},
{"employer_url": "https://www.seek.com.au/companies/kin-kin-state-school-820546", "employer_name": "Kin Kin State School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/kimberley-remote-area-health-east-875095", "employer_name": "Kimberley Remote Area Health - East", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/kindy-patch-kids-796169", "employer_name": "Kindy Patch Kids", "employer_info": "At Kindy Patch, we provide quality settings with detailed, age specific resources to enrich the development and education of children. The first six years of a child’s life significantly affects their learning, health and well-being. Therefore, we provide children with opportunities to learn, grow, play, build relationships and to develop positive social skills, giving your child the possibility to thrive and excel. Our educators are qualified and caring and are committed to ongoing training to better their skills and knowledge within the industry."},
{"employer_url": "https://www.seek.com.au/companies/kimberley-remote-area-health-west-875096", "employer_name": "Kimberley Remote Area Health - West", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/kimberley-ports-authority-796033", "employer_name": "Kimberley Ports Authority", "employer_info": "ABOUT KIMBERLEY PORTS AUTHORITY\n\nThe Kimberley Ports Authority has been enabled under the Ports Legislation Amendment Act 2014.\n\nThe Minister and the Department of Transport undertook a review of “The Role of Ports in Western Australia”  in 2012 which initiated the ports amalgamation process. Resultantly, the Kimberley Ports Authority will in due course assume the current Department of Transport responsibilities at the following ports:\n\nWyndham Port\nDerby Port\nYampi Sound ports of Cockatoo and Koolan Islands (potentially Irvine Island)\nthe proposed port at James Price Point\nThe transfer of responsibilities from the Department of Transport will not occur until the enabling legislation is passed through Parliament. The Ports Legislation Amendment Bill 2015 will result in the transfer of the three existing Kimberley ports and facilities that are currently regulated under the Shipping and Pilotage Act 1967 (SP Act) to the Port Authorities Act 1999 (PAA).\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/kimberley-park-state-school-819935", "employer_name": "Kimberley Park State School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/kimberley-population-health-unit-871269", "employer_name": "Kimberley Population Health Unit", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/kimberley-hotel-803578", "employer_name": "Kimberley Hotel", "employer_info": "Ideally located just 7 Kilometers from the CBD, Kimberley Gardens Hotel and Serviced Apartments is close to public transport (both Trains and Trams) and the cosmopolitan shops and restaurants of Chapel and Balaclava Road-Carlisle Streets.\n \nThe Property is situated close to St Kilda Beach, Caulfield Racecourse, Monash University Caulfield Capmus and Rippon Lea Estate. Surrounding suburbs include St Kilda, Prahran, Toorak, Caulfield, Balaclava, Malvern, Elwood, Elsternwick and Brighton.\n \nIn a unique setting, the entire hotel is set off the street, is quiet and secluded with an internal well-appointed courtyard and an internal heated pool.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/kimberley-mental-health-and-drug-service-871268", "employer_name": "Kimberley Mental Health and Drug Service", "employer_info": "Kimberley Mental Health & Drug Service (KMHDS) provides specialist mental health and Alcohol & Drug services to the Kimberley region. The service aims to deliver a comprehensive range of high quality; community focused mental health and drug services to residents of & visitors to the Kimberley. The Mental Health teams’ primary aim is to treat people suffering from a clinically diagnosed mental illness.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/kinetic-group-international-814359", "employer_name": "Kinetic Group International", "employer_info": "inetic Group International provide cost effective marketing strategies for some of the most reputable National and International Brands. We do this in the form of a “human commercial”. The effectiveness of this lies in the face to face interaction we can have with customers. This allows us to tailor our message to each individual customer, answer any questions, build genuine rapport and above all else, create a professional long lasting image of our clients in the market place.\n\nWe specialise in customer acquisition programs. Our face to face marketing campaigns focus on promoting a specific product or service whilst providing the highest standard of customer service. Through our customer focused culture we are able to build genuine rapport and to provide a solution tailored to the customers needs; this involves general brand awareness as well as calling on our customers to take action.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/kimberley-land-council-803579", "employer_name": "Kimberley Land Council", "employer_info": "The Kimberley Land Council was formed in 1978 by Kimberley Aboriginal people as a political land rights organisation. Today, we have grown to become the peak Indigenous body in the Kimberley region working with Aboriginal people to secure native title recognition, conduct conservation and land management activities and develop cultural business enterprises.\n\n We are located in the vast Kimberley region of northern Western Australia. Our region is known for its strong and significant Aboriginal culture and heritage that dates back more than 50,000 years. We continue to work to ensure that our land, law, language and culture lives on and continues to be vibrant and long-lasting. We do this by getting back our country, looking after our country and securing our future.\n\n \nThe Kimberley covers about 423,000 sq km with an estimated population of 35,000 people – half of whom are Indigenous. Kimberley Aboriginal people have undergone rapid and significant changes since European colonisation but we have resisted, survived and adapted. \n\nThe Kimberley Land Council was set-up for the benefit of all Kimberley Aboriginal people and works with about 25 native title groups to get native title recognition, protect and enhance the high biodiversity values of the region, pursue cultural enterprise development and work to improve our socioeconomic circumstances.  \n\nWe are one of the biggest employers in the Kimberley, employing about 130 staff across the divisions of native title, legal, land and sea management, corporate services and finance. We have offices in Broome, Kununurra and Derby as well as smaller satellite stations in remote communities that act as a base for Kimberley Ranger Network teams.\nSource: this is an extract from the company’s own website."},
{"employer_url": "https://www.seek.com.au/companies/kimberley-school-of-the-air-871270", "employer_name": "Kimberley School Of The Air", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/kimberly-clark-australia-874688", "employer_name": "Kimberly-Clark Australia", "employer_info": "Leading the world in the essentials for a better life.\nPeople have looked to Kimberly-Clark brands for more than 140 years and today we're proud to help over a billion people around the world cope, laugh, love and live every day. From the best nappies and baby wipes to the softest tissues, to the best supplies for business, we are constantly searching for new ways to make life better for our consumers, our customers and our planet.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/kimberley-accommodation-814494", "employer_name": "Kimberley Accommodation", "employer_info": "Our Beautiful Piece of Australia\nYou will find our Kimberley Accommodation properties located throughout the immense and stunning landscapes of the Kimberley region of Western Australia. Our aim is to provide you with consistent quality and service in accommodation, food and beverage.\n\nAt over one million square kilometers the Kimberley offers a vast landscape to explore. From the pristine white sands of Cable Beach in Broome to the ancient domes of the Bungle Bungles.\n\nThe Kimberley is a truly vast and diverse area full of extraordinary contrasts. The red desert contrasts against the turquoise ocean, rugged arid landscapes are cut with spectacular gorges, billabongs and waterfalls. The region is packed with unique features from wonderful and ancient aboriginal art and culture to primal native wildlife.\n\nThere is so much to see, explore and do. You could spend a lifetime enjoying it all. Stay with us and we’ll help you get the best out of whatever time you have. The Kimberley is our home, let us help you explore and enjoy.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/kimberley-diamond-company-436115", "employer_name": "Kimberley Diamond Company", "employer_info": "The Lerala Mine, situated in north-east Botswana, comprises a cluster of five diamondiferous kimberlite pipes totalling 6.66 hectares in size, together with a processing and recovery infrastructure. Since acquiring the mine in 2012, KDL has sought to refurbish and recommission the exisiting processing facility to reliably process 200 tph kimberlite ore. Mining at Lerala recommenced in mid April 2016. The first kimberlite ore was put through the refurbished processing plant on the 30 April 2016, with diamonds being recovered soon after. The inaugural diamond sale is scheduled for June 2016.\n\nSource: This is an extract from the company's own website"},
{"employer_url": "https://www.seek.com.au/companies/kimberley-aged-and-community-services-875094", "employer_name": "Kimberley Aged and Community Services", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/kilvington-grammar-school-800277", "employer_name": "Kilvington Grammar School", "employer_info": "Kilvington combines the advantages of:\n•a high-quality, independent school education\n•a small, close-knit community\n•affordable fees\n\nOne of the first things people notice when visiting Kilvington is its friendly and open atmosphere. This is vital, as students tend to learn most effectively when they feel comfortable and happy in a welcoming environment.\n\nThe student-teacher relationship is among the most important in each child’s life, and Kilvington teachers are adept at forging strong relationships. As a result of their dedication, experience and professionalism, Kilvington’s staff members are trusted and respected.\n\nKilvington’s benefits to students include:\n•programs tailored to individual learning needs and abilities\n•trusting relationships between students and teachers\n•strong and nurturing pastoral care programs\n•frequent and meaningful consultation between parents and teachers\n•ongoing online feedback on students’ performance, available via the parent portal\n•a truly welcoming school community where it’s easy to fit in and make friends\n•a school which values the strong connections between individuals and their families\n•continuous education offered from the early years to VCE on a single campus\n•close proximity to public transport and easy access via main roads\n•holiday programs and after-school care offered in some years\nDemocratic Principles\n\nKilvington Grammar School supports and promotes the principles and practice of Australian democracy, including a commitment to:\n\n– elected government\n– the rule of law\n– equal rights for all before the law\n– freedom of religion\n– freedom of speech and association\n– the values of openness and tolerance\nSource: this is an extract from the company’s own website."},
{"employer_url": "https://www.seek.com.au/companies/kinder-haven-796176", "employer_name": "Kinder Haven", "employer_info": "Kinder Haven is a cluster of premium child care and education centres located in Victoria, Queensland, New South Wales, and the ACT.\nWe believe that our carers always have something new to learn, so they receive on-going formal and informal training. Each age appropriate room has specific indoor and outdoor programs designed to offer children the maximum opportunity to develop their physical and social skills, as well as their self-esteem and learning skills."},
{"employer_url": "https://www.seek.com.au/companies/kimberley-aboriginal-medical-services-council-803576", "employer_name": "Kimberley Aboriginal Medical Services Council", "employer_info": "KAMSC (Kimberley Aboriginal Medical Services Council) is a regional Aboriginal Community Controlled Health Service (ACCHS), providing a collective voice for a network of member ACCHS from towns and remote communities across the Kimberley region of Western Australia. \n\nThe Broome Regional Aboriginal Medical Service (BRAMS) was the first Aboriginal Community Controlled Health Service (ACCHS) established in the Kimberley in 1978, and was followed by the East Kimberley Aboriginal Medical Service (EKAMS, in Kununurra) in 1984. The vision for a unified voice, to provide centralised resources and collective advocacy for the sector, achieved reality in 1986 with the establishment of KAMSC.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/killarney-p-10-state-school-819396", "employer_name": "Killarney P-10 State School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/kilkivan-state-school-820498", "employer_name": "Kilkivan State School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/kilcoy-state-school-820294", "employer_name": "Kilcoy State School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/kilcummin-state-school-820015", "employer_name": "Kilcummin State School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/kilcoy-state-high-school-819490", "employer_name": "Kilcoy State High School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/kilcoy-pastoral-company-435717", "employer_name": "Kilcoy Pastoral Company", "employer_info": "Kilcoy Pastoral Company Premium 100 Day Grain-Fed Beef is produced in the picturesque town of Kilcoy at the base of the Conondale Range in Queensland’s Sunshine Coast Region.\nLocal beef producer, Damian Kennedy, established Kilcoy Pastoral Company in 1953. The original plant was capable of processing 40 head of cattle per day to supply the local surrounding butchers. His son, Ian Kennedy, took the reins as Managing Director in 1965. His innovative approach, business strategy and continual entrepreneurial pursuits saw his ground breaking achievements include pioneering the first consignment of chilled beef to Japan and developing and launching natural beef brands into Japan in 1999. He was also integral to the founding of AUS-MEAT, the Australian body responsible for establishing and maintaining National Industry Standards for meat production and processing.\nIt was in 1999 that the Company began its transformation into the Kilcoy Pastoral Company we know today, a highly specialised facility specifically for the grain-fed market.\nWith a singular market focus, our highly skilled team has the ability to provide an unbeatable customer experience. Kilcoy Pastoral Company has grown to be one of the five largest beef processors in the country, employing over 750 people and processing more than 800 premium grain-fed cattle a day.\nSource: This is an extract from the company's own website"},
{"employer_url": "https://www.seek.com.au/companies/kikkik-434369", "employer_name": "Kikki.K", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/kilcoy-hospital-821527", "employer_name": "Kilcoy Hospital", "employer_info": "Kilcoy Hospital is an acute hospital providing general medical, emergency, allied health and clinical support services.\nClinical services also include allied health and maternity outpatients and a palliative care bed in a hospice environment. The hospital facilitates transfers to appropriate facilities when required.\nA range of support and community home visiting services is provided in association with private home care services. Community health nurses and social workers help ensure continuity of care for locals.\nThe hospital also has a range of health promotion and education programs including diabetes education, antenatal education and parenting support. A child and youth service is available.\n\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/kiewit-814028", "employer_name": "Kiewit", "employer_info": "Excellence. It is the foundation of everything we do. What began in 1884 with two hardworking brothers has grown into a Fortune 500 construction, mining and engineering powerhouse.\n\nKiewit’s ethical, forward-thinking workforce continues to build upon the company’s reputation of safe, high-quality engineering. Consistently ranked among the top five of the Engineering News-Record Top 400 Contractors, our company is a leader in a variety of market sectors throughout North America and, most recently, Australia.\n\nAs an employee-owned company, Kiewit’s assets are managed by the people who know our work best. For us, business is personal. As our own stakeholders, we are invested in every project we take on. We continuously strive to build high-quality work at the lowest cost.\n\nOur philosophy on safety is simple: Nobody Gets Hurt. Knowing that one lapse in judgment can lead to catastrophic events, the safety of the men and women on our job sites and the community that surrounds our projects is always first.\n\nKiewit never stands still. Just as our founders relentlessly chased their dream, we continue to chase new and exciting opportunities.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/kidstuff-814196", "employer_name": "Kidstuff", "employer_info": "A little bit about us...\nSince 1969\nAt Kidstuff, you'll notice our toys look a little different. So does our service. We sell toys that inspire individuality and reward curiosity. We feel passionately about our customers. We like to surprise. If your eyebrows raise slightly when you visit our store, we feel like we've done our job. Behind our doors and here online you'll find unique and prestigious toy brands from around the world, the biggest and best range of educational toys, as well as a delightful range of eclectic gifts and novelties.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/kids-capers-childcare-928302", "employer_name": "Kids Capers Childcare", "employer_info": "We are a family owned and operated business on the north side of Brisbane. We opened our founding centre in Clayfield in 2003. With a background in design and development we embraced the chance to create something that would enrich the community and its surrounds. Whether it is a state of the art new structure or converting a heritage listed church, each Kids Capers Centre is a unique concept.\n\n \n\nWe believe the success of our company lies with our dedicated Educators.  Each centre operates individually with an experienced and dedicated Centre Manager who oversees his or her team of Educators. Support Managers oversee and assist the Centre Managers. Being part of this community allows us to share a wealth of knowledge, experience and talent.\n\n \n\nWith over 950 families and over 200 Educators, Kids Capers has become firmly entrenched in communities from Brisbane to the Sunshine Coast, creating a safe and secure environment that families can trust.\n\n \n\nKids Capers existing centres include natural playscapes where you might find logs, rocks, timber cubby houses, creek beds, mud kitchens and even chook pens. \nSource: This is an extract from the company's own website"},
{"employer_url": "https://www.seek.com.au/companies/kiara-college-871249", "employer_name": "Kiara College", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/kiana-school-988196", "employer_name": "Kiana School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/kidsport-796017", "employer_name": "KidSport", "employer_info": "Enabling WA children to participate in community sport and recreation\nKidSport enables eligible Western Australian children aged 5-18 years to participate in community sport and recreation by offering them financial assistance towards club fees.\n\nChanges to KidSport\n\nApplicants listed on a valid Health Care or Pensioner Concession card should now:\nApply online on the Department's website or\nSubmit a KidSport application form and a copy of the card to their local government.\nKidSport no longer has referral agents.\nApplicants not listed on a valid concession card need to meet one of the new KidSport Financial Exceptions.\nIf you meet an exception you can apply for KidSport through a KidSport Financial Assessor.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/kia-ora-state-school-820328", "employer_name": "Kia-Ora State School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/kiama-municipal-council-803562", "employer_name": "Kiama Municipal Council", "employer_info": "Cultural Development is a broad term covering a range of activities that give communities the opportunity to tell their stories, build their creative skills and be active participants in the development of their culture. Kiama Council contributes to the cultural development of the Kiama local government area through a range of strategies:\n\nCouncil employs a Community and Cultural Development Officer four days per week with two days dedicated solely to cultural development. Council's current Community and Cultural Development Officer can be contacted on (02) 4232 0549 or by email\n\nKiama Cultural Grants ~ cultural arts grants of up to $3000 available\nKiama Cultural Arts Planning ~ Council's cultural arts planning document\nKiama Cultural Network ~ connecting and informing local artists and art enthusiasts\nKiama Cultural Board ~ Council's community based cultural art advisory board\nExhibition Spaces ~ arts exhibition, workshop and performance space for local artists\nDaisy the Decorated Dairy Cow ~ Kiama iconic public artwork\nKiama Council Art Collection ~ access to view Council's art collection online\nEvents and Markets ~ Council and community events and markets held in the Kiama local government area\nBusking in Kiama ~ Busking information, policy and application form\nPublic Art ~ Council is currently in the process of auditing its public art collection, more information will become available in the future.\n \nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/khans-supa-iga-group-868016", "employer_name": "Khans Supa IGA Group", "employer_info": "Khan’s Supa IGA Group was established in 1981 and currently operates 11 supermarkets and an BP Auto Village Auto Centre with more than 800 friendly staff located throughout NSW.\n\nWe provide a large range of quality fresh food with a full supermarket offer. In addition liquor is available in selected stores. At each of our locations we provide a range of value added services to assist our local communities which help to differentiate us from our competitors.\n\nThroughout the year we provide a number of special offers with Weekly Specials, Instore Specials, Managers Specials, Market Days and special discounts for our Frequent Shopper Club Members.\n\nWe provide support to our local communities via the IGA Community Chest Program. In addition we provide valuable employment opportunities in our store localities with ongoing career opportunities.\nSource: This is an extract from the company's own website"},
{"employer_url": "https://www.seek.com.au/companies/kia-motors-814753", "employer_name": "KIA Motors", "employer_info": "Kia produces more than 2.8 million vehicles a year at 14 manufacturing and assembly operations in eight countries. Kia is determined to design and build cars that continue to surprise customers, featuring the latest technologies, striking award-winning designs and premium interior finishes. \n\nTo keep in touch with the latest Automotive trends and consumer needs, Kia’s international headquarters are located in Korea, Germany and the USA.\n\nThese are just a few of the many reasons to drive a Kia. Click below to learn what makes Kia the choice for those who seek the exceptional.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/keystone-radiology-816752", "employer_name": "Keystone Radiology", "employer_info": "WHO WE ARE\nKeystone Radiology is a group of young, subspecialist trained radiologists and nuclear physicians who are passionate about providing world class medical imaging services in regional areas.\n\nTHE KEYSTONE DIFFERENCE\nOur subspecialist radiologists and nuclear physicians are clinically focused, they strive to provide their patients with the best possible care and exceed the expectations of our referrers.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/key-pharmaceuticals-800261", "employer_name": "Key Pharmaceuticals", "employer_info": "Key Pharmaceuticals is an Australian owned and operated private company. Most of our products are therapeutic goods designed to improve health, well being, vitality and physical appearance; we also market home use diagnostics. The business was established in 1901 by two families, and eventually became known as Key Pharmaceuticals in 1985. Following many years of rapid growth, Key is now one of the leading Australian companies in the field of Over the Counter (OTC) pharmaceuticals.\n\nStarting out as an importer and representative of overseas companies, Key is today involved in a full range of brand management activities from research and product development through to marketing, sales and export. The majority of Key’s brands are owned by the company. At the same time, Key retains exclusive licence and distribution arrangements with companies in the USA, Europe, Asia as well as Australia. Some of these relationships have been in place for decades and in-licensed products represent an important and valued part of Key’s business. It is a core part of Key’s strategy to balance its own products with in-licensed and exclusive distribution brands.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/kfc-432299", "employer_name": "KFC", "employer_info": "In 1930, in a humble service station in Corbin, Kentucky, 40-year old Harland Sanders began cooking for hungry travellers who stopped by for gas, serving them his southern-style fried chicken from his very own kitchen table. As word spread and Sanders' fame began to grow people started travelling from far and wide just for a taste of his food. Sanders spent the next nine years perfecting his secret blend of 11 herbs and spices, and the basic cooking technique that's still used today.\n\nWe are passionate about serving our customers freshly prepared, great tasting food with a key part of this being The Colonel's signature blend of 11 herbs and spices. Even today these remain a secret with the original recipe under lock and key in our headquarters in Kentucky, USA.\n\nSource: this is an extract from the company’s own website."},
{"employer_url": "https://www.seek.com.au/companies/keypath-education-834804", "employer_name": "Keypath Education", "employer_info": "Our Technology Gives You Unique Visibility Into the Student Journey\n\nHigher education professionals are expected to know and do more than ever before in a climate of uncertainty. Our technology suite allows you to make decisions based on real-time data.\nHow can institutions better attract the increasing number of nontraditional students in order to achieve long-term growth and fulfill their missions? That was the idea. Since our founding more than 26 years ago, we have pioneered inquiry-based enrollment marketing for nontraditional students, connecting them to the right institutions and the right educational opportunities at scale.\n\n \n\nAn Evolution Beyond Marketing\n  \n\nInstitutions have evolved. Student expectations of their education have evolved. It’s only fitting that we evolve as well. Our transition from PlattForm to Keypath Education is, in a sense, a return to basics with a focus on the entire student journey. \nSource: this is an extract from the company’s own website."},
{"employer_url": "https://www.seek.com.au/companies/kewdale-tavern-438100", "employer_name": "Kewdale Tavern", "employer_info": "The Kewdale Tavern is an award winning venue nestled in Perth’s largest logistics area offering various function spaces, catering for ‘After Work Sundowner’s’ all the way to ‘Weddings’.\nLocated 15 minutes from the city and 5 minutes from the Perth International Airport, The Kewdale Tavern has five areas to choose from including The Sports Bar, The Beer Garden, The Restaurant, The Alfresco & Bar Dining. Whichever you choose, we are sure your guests will leave pleasantly surprised yet ultimately impressed.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/key-media-813860", "employer_name": "Key Media", "employer_info": "Publications\npublications\nKey Media publishes a range of industry-leading B2B and consumer magazines. These magazines focus on key business vertical and niche consumer markets such as financial services, legal, human resources, personal wealth and property. Key Media's dedication to quality content and design makes our publications the industry standard.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/key-assets-fostering-867979", "employer_name": "Key Assets Fostering", "employer_info": "We’re a non-government fostering agency, providing foster placements for children and young people with complex needs. We’re a not-for-profit organisation and operate as an independent out-of-home care provider across all four Australian states.\n\nWho we are:\n\nWe were founded in Australia in 2007, and currently provide fostering services in Western Australia, Queensland, New South Wales and South Australia.\n\nWe’re part of the international Core Assets Group; a leading children’s services provider with almost 20 years’ experience of supporting foster carers, and children and young people in care.\nWhat we do\n\nWe work with foster carers of various backgrounds and levels of experience, to provide a secure environment for children and young people across the country. In Western Australia, we also provide services for children with disabilities.\n\nWe’re child-focused, supportive and professional. We believe in a team approach to fostering. That’s why we work with foster carers and local governing departments to provide placements that really make a difference to the lives of children and young people in care.\nSource: This is an extract from the company's own website"},
{"employer_url": "https://www.seek.com.au/companies/kesser-torah-college-800257", "employer_name": "Kesser Torah College", "employer_info": "Kesser Torah College is a Jewish educational facility offering Jewish Education and care for children aged 2 years – Year 12. The College incorporates the Early Childhood Centres (Carl Rose Early Learning School and the Education & Care Centre), Primary School and High Schools, situated in beautiful Dover Heights, Sydney.\n\nKesser Torah was incorporated in December 2003, and is a Jewish orthodox school with a Chabad ethos.  It has grown to accommodate over 480 students catering to over 250 families. With a staff complement of 90 professionals, the school is committed to enhancing academic and extra-curricular learning for each child as an individual, and to providing the highest quality Jewish and Secular education, as well as pastoral care. The teachings of the Lubavitcher Rebbe OBM continue to inspire the educational philosophy of Kesser Torah College.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/kewdale-primary-school-871239", "employer_name": "Kewdale Primary School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/kewarra-beach-resort-803552", "employer_name": "Kewarra Beach Resort", "employer_info": "Kewarra Beach Resort & Spa is a private boutique property boasting a strong focus on environmental sensitivity with superb cuisine and world class service.\n\nJust 20 minutes from Cairns situated in picturesque tropical North Queensland set on 30 acres of lush landscaped rainforest gardens this private boutique beachfront property provides the ultimate Australian holiday experience. While boasting extensive botanical gardens with detached secluded suites and spacious private bungalows it’s no surprise that this wonderfully romantic hideaway has become a firm favourite with honeymooners and nature lovers the world over.\n\nOur team provides the highest level of personal service to discerning guests seeking a stylish escape that captures the very essence of our remarkable region. Motivated by passion and a desire for excellence, our team constantly strives to exceed guests’ expectations.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/kerry-ingredients-433331", "employer_name": "Kerry Ingredients", "employer_info": "We provide the largest, most innovative portfolio of Taste & Nutrition technologies and systems and Functional Ingredients & Actives for the global food, beverage and pharmaceutical industries. Our consumer foods division, Kerry Foods, is also a leading consumer foods processor and supplier in selected EU markets.\n\nSince the commissioning of our first dairy and ingredients plant in Listowel, Ireland in 1972, we have grown to become the industry’s leading provider of technology-based ingredients and solutions for all sectors of the food, beverage and pharmaceutical markets. Our industry leading technologies are backed by the industry’s most robust in-house processing capabilities. We apply our processing expertise to address manufacturing challenges and help customers design winning consumer products.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/kerr-engineering-803542", "employer_name": "Kerr Engineering", "employer_info": "Kerr Engineering is located in Carlisle, Perth, Western Australia.\n\nEstablished in the mid 1960's by Kevin Kerr, the business in the early days manufactured BMX side cars, speedway racing bikes and sprint cars. Kevin expanded the business into general engineering.\n\nIn 2000, Kevin retired and sold the business to the current owners - the Kinsman brothers - Mark and David Kinsman. Mark began his career with the company, completing his apprenticeship with Kerr Engineering. Today he is the Managing Director at the Carlisle factory. David completed his Accounting and Finance Degree and is the Chief Financial Officer located in Sydney. The Kinsmans have made it their personal mission to make Kerr Engineering a leader in its field.\n\nThe business has continuously expanded and enhanced its services and Kerr Engineering currently employs more than 30 highly experienced tradespeople.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/kew-toy-library-806794", "employer_name": "Kew Toy Library", "employer_info": "The Kew Toy library stocks approximately 2,000 toys which cater for children from birth to 6 years of age.  We can help you select the most suitable toys for your children based on their stage of development.\n \nChildren possess a natural curiosity to explore and play acts as a medium to do so.  Let your child enjoy unlimited play and learning with the range of over 2000  toys available at our library.\n\nSource: this is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/kerwin-rae-866032", "employer_name": "Kerwin Rae", "employer_info": "About What We Do\nFor small to medium-sized business owners who are dissatisfied with their lack of results or who simply want to accelerate growth. We specialize in educating, training and supporting business owners to identify, plan and manage your marketing, sales and strategic planning in order to grow your business fast.\nWe provide you the tools, strategies, and tactics to accelerate your growth and overcome any obstacles you may encounter on your journey as an entrepreneur. Unlike other coaches, consultants or seminar companies that provide at best pieces to a puzzle.We have a blueprint for success and have been specializing in building businesses for over 15 years, helping over 100,000 businesses, in 154 different industries and in 11 countries around the world.\nWe live, sleep and breathe fast growth business.\n\nAbout Kerwin\nKerwin Rae is a businessman, entrepreneur, investor and international speaker. As one of the Australia’s leading business strategists for over a decade, he has consulted in 11 countries and over 154 different industries and taught over 100,000 people the world over through his seminars and workshops. To date making his clients well in excess of Hundreds of Millions Dollars.\n\nKerwin has addressed and worked with all levels of business specializing in Small to Medium businesses and national and international franchise groups. He has also coached thousands of consultants and coaches in numerous countries on business development, marketing, sales, human behavior and entrepreneurial psychology.\n\nKerwin has also worked with high school and university students and the general public. As part of the celebrated Young Achievers (YA) association, he was involved for a number of years as a leading mentor.\nSince starting his first business at 23 years of age, Kerwin has successfully overcome both business and personal adversity."},
{"employer_url": "https://www.seek.com.au/companies/kerman-contracting-435206", "employer_name": "Kerman Contracting", "employer_info": "We specialise in non-process infrastructure, processing plants, bulk storage and materials handling facilities, industrial facilities and accommodation villages.\n\nOur considerable experience in both design and construction and exposure to an array of processes and techniques enables us to tailor a solution most suited to the operational functions, design life, durability, environmental or logistical challenges for any particular project. For our clients this translates to cost effective construction, timely project completion and greater return on investment.Kerman provides fully integrated design and construction expertise. Our capability is defined by three key areas, with delivery by traditional means, design and construct and Engineering, Procurement & Construction \nSource: this is an extract from the company’s own website"},
{"employer_url": "https://www.seek.com.au/companies/kepnock-state-high-school-820401", "employer_name": "Kepnock State High School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/kepa-poultry-927968", "employer_name": "Kepa Poultry", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/keppel-sands-state-school-819971", "employer_name": "Keppel Sands State School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/kenwick-school-871226", "employer_name": "Kenwick School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/kentz-433234", "employer_name": "Kentz", "employer_info": "Kentz, a Member of the SNC-Lavalin Group,  is a global engineering specialist solutions provider operating in 36 countries worldwide. They have provided Engineering, Construction and Technical Support Services (TSS) to clients in the energy and resources sectors for more than 90 years.\n\nKentz Group has been delivering top-quality services to leading international clients in all sectors of industry and commerce since 1919. With an extensive track record in executing projects of the highest quality, to agreed schedules and within budget; they are totally dedicated to innovation and excellence in the provision of all their services. \nSource: this is an extract from the company's own website"},
{"employer_url": "https://www.seek.com.au/companies/kentville-state-school-820426", "employer_name": "Kentville State School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/kentech-796915", "employer_name": "Kentech", "employer_info": "Kentech were awarded the complete Electrical and Instrumentation Maintenance Services to Support QSGTL PearlMTA2 2016 (TAE&I). Our scope of work included TPSP (temporary power), planning, decommissioning, execution, commissioning and start-up the Turnaround (TA) event, at the worksite which is located within Ras Laffan Industrial City (RLIC) in the State of Qatar. Kentech provided qualified management, planners supervision, trade labour, tools, equipment to support the TA which included instrument maintenance / specialty turnaround services, electrical maintenance / specialty turnaround services, mobile plant & equipment, minor projects…\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/kindon-state-school-820191", "employer_name": "Kindon State School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/kent-street-senior-high-school-871222", "employer_name": "Kent Street Senior High School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/kent-removals-and-storage-813389", "employer_name": "Kent Removals and Storage", "employer_info": "For over 70 years Kent has been moving Australians around the corner, across the country, and around the globe. We have helped over a million people move.\n\nEstablished in 1946, Kent has built a reputation for excellence, providing attentive, caring, personal service to people and families across Australia.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/kennedy-health-care-800249", "employer_name": "Kennedy Health Care", "employer_info": "Telemedicine Clinic is a sub-specialist radiology centre that provides day and night reporting services and support to more than 100 public service hospitals and local health authorities in Europe.\n\nWe have 160+ accredited sub-specialist radiologists who focus on specific diagnostic areas that include Neuro, Body, Musculoskeletal, PET-CT, Mammography Screening and Nuclear Medicine. Our structured focus gives us the added edge to guarantee delivery of high quality readings in a timely manner.\n\nTMC is a proud co-founder of the Spanish Conscious Capitalism Chapter and part of the global Conscious Capitalism movement. Our goal is to make our company as human— as creative, inventive, caring, purpose driven —as the wonderful human beings who work inside it.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/kensington-street-social-927908", "employer_name": "Kensington Street Social", "employer_info": "KENSINGTON STREET SOCIAL IS THE DEBUT SYDNEY RESTAURANT BY RENOWNED MICHELIN-STARRED BRITISH CHEF JASON ATHERTON.\nLocated within The Old Clare Hotel in Chippendale, an industrial heritage-listed site that was formerly the Carlton & United Brewery administration building, the relaxed menu focuses on Mediterranean sharing plates that showcase the very best Australian produce and wine. With dishes designed to be shared, Culinary Director Jason Atherton and Executive Chef Robert Daniels have created a menu that is informal and versatile - whether you’re looking for a quick glass of wine and a sourdough flatbread sat at the bar overlooking the open kitchen, or a multiple course dinner with paired wines on the intimate mezzanine level. \nSource: This is an extract from the company's own website"},
{"employer_url": "https://www.seek.com.au/companies/kensington-secondary-school-871219", "employer_name": "Kensington Secondary School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/kensington-primary-school-wa-927907", "employer_name": "Kensington Primary School WA", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/kennedy-state-school-819633", "employer_name": "Kennedy State School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/kennards-hire-433560", "employer_name": "Kennards Hire", "employer_info": "Kennards Hire® is the largest privately owned general hire company in Australia, winner of the 2008 Hire Company of the Year, and is a family-owned business that has grown from one centre in Bathurst, NSW in 1948 to currently 139 hire centres nationally and in New Zealand. And that's just the general hire business! Kennards Hire® also operates specialist divisions, such as Kennards Lift and Shift, which specialises in lifting and materials handling equipment. We also have Kennards Concrete Care, who are concrete surface preparation, remediation and demolition specialists. In addition we have Kennards Pump & Power for generator and pump equipment and Kennards Traffic specialising in traffic control equipment.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/kenmore-state-school-819573", "employer_name": "Kenmore State School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/ken-hall-plumbers-927834", "employer_name": "Ken Hall Plumbers", "employer_info": "Today Ken operates Adelaide's leading plumbing company out of their showroom/office at 4-6 Kensington Road, Rose Park.\n\nKen Hall Plumbers offer services in all areas of the trade from service on a domestic, commercial and property management level all the way through to construction. The company offers a complete range of services including unblocking drains, fitting tapware, hot water, roof repairs and irrigation, through to complete bathroom renovations and video inspections of  sewer drains. \nOur success is driven by exceptional customer service, a dedicated workforce and demonstrating respect of our customers trust.\n Today Ken is a licensed general builder, master plumber and gas fitter. \n \nWe employ a team of over 75 people and provide a service with considerable expertise and vast experience into all areas of the trade. We have someone on call 24 hours a day, 365 days per year to meet your needs and promise same day service anywhere in the metro area.\nSource: This is an extract from the company's own website"},
{"employer_url": "https://www.seek.com.au/companies/kendenup-primary-school-871212", "employer_name": "Kendenup Primary School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/kenmore-state-high-school-819832", "employer_name": "Kenmore State High School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/kenmore-south-state-school-820287", "employer_name": "Kenmore South State School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/kenilworth-state-community-college-819970", "employer_name": "Kenilworth State Community College", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/kennards-self-storage-436470", "employer_name": "Kennards Self Storage", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/kempton-primary-school-871210", "employer_name": "Kempton Primary School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/kelvin-grove-state-college-800246", "employer_name": "Kelvin Grove State College", "employer_info": "Kelvin Grove State College is part of a unique educational precinct. It is only three kilometres from Brisbane City’s central business district. Our college seeks to provide a supportive and engaging learning environment for all. Our focus is on excellence in all areas of education. This is articulated and promoted through expectations of a strong work ethic, pride in, and recognition of, socially just practices including valuing social diversity, and civic participation\n\nThe college is convenient to public transport and is close to all the conveniences of the city. It is also adjacent to Kelvin Grove Urban Village. The college’s strong and established links with the adjoining Queensland University of Technology and other tertiary institutions allow students to plot and progress their own learning pathways from Prep to University within one educational establishment. \n\nThe co-location of the college with QUT, including its Engineering, Education and Creative Industries faculties, forms a unique precinct that provides a focus on excellence in learning.​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/kemps-petersons-927794", "employer_name": "Kemps Petersons", "employer_info": "Our primary focus as a debt collection agency is to recover outstanding accounts as cost effectively as possible.  We achieve Keeping You in Business by combining technology with a personal touch.\n\nKemps Petersons Receivables have the depth and expertise in all aspects of Debt Collection, Field Service & Skip Tracing and Credit Reporting to service overdue accounts for a diverse national client base.\n\nInvestment in the latest technologies ensures Kemps Petersons Receivables continues to provide a superior edge in the debt collection marketplace, offering a full range of information and services.\n\n We are an exceptional team comprising of highly qualified and dedicated collections and managerial team members.  We have considerable experience in all aspects of debt collection.\n•Collection process\n•Commercial collections\n•Strata Levy Arrears collections\n•Field Services & Skip Tracing\n•Credit Reporting\n\nContinuous improvement is an essential part of our service approach as we are dedicated to providing excellence in all we do.  Kemps Petersons Receivables employees are well informed of legislative changes that affect our services and adhere to all regulations governing our organisations and client relationships. \nSource: This is an extract from the company's own website"},
{"employer_url": "https://www.seek.com.au/companies/kelmscott-senior-high-school-871200", "employer_name": "Kelmscott Senior High School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/kempe-engineering-434550", "employer_name": "Kempe Engineering", "employer_info": "Established in Australia and operating for more than 25 years, we provide integrated specialist engineering solutions including the delivery of numerous projects, state-of-the-art technology solutions, products and ongoing asset support services to clients.\nWe have developed the in-house expertise and infrastructure to provide our clients with specialist engineering solutions for the \"whole-of-life\" of their production plants including; Turnkey engineered solutions; Manufactured products, automated plant and fabrications; Project packages; Maintenance programs; Equipment refurbishment; Individual product supplies.\n\nSource: this is an extract from the company’s own website"},
{"employer_url": "https://www.seek.com.au/companies/kemp-strang-927796", "employer_name": "Kemp Strang", "employer_info": "Welcome\n\nAt Kemp Strang we understand the importance of diving well below the surface of the legal issue at hand. We combine depth of legal knowledge, with depth of understanding of our clients and their objectives, to deliver solutions focussed advice.\n\nWe understand that our commercial acumen is as valuable to our clients as our technical skill. We approach our work with a business-first mindset and aim to make the law serve your business, not the other way around.\n\nOur partners are always accessible and we resource our transactions with a dedicated team that is experienced and motivated. We appreciate the increased cost pressures that most clients are subject to, and aim to deliver advice which is both focussed and cost-effective.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/kempsey-shire-council-803519", "employer_name": "Kempsey Shire Council", "employer_info": "Great natural beauty and a truly relaxed lifestyle – that sums up the Macleay Valley in a nutshell and makes it easy to understand why many visitors, after holidaying in the area, choose to move here permanently. The Kempsey Shire has a population of over 28,000 and is part of the Mid North Coast Region which is the fastest growing non-metropolitan area in NSW. As the population continues to grow, the need for additional services and facilities is always considered and planning for the future is well in hand.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/kelso-state-school-820242", "employer_name": "Kelso State School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/kelmscott-primary-school-871199", "employer_name": "Kelmscott Primary School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/kelly-trotter-motor-group-834744", "employer_name": "Kelly Trotter Motor Group", "employer_info": "Welcome to Kelly Trotter Motor Group.\n\n•More choices with over 200 new vehicles in stock.\n\n\n•Search our range of 150 Used vehicles all with extended warranty.\n\n\n•Kelly Trotter Motor Group provides its customers with more than 25 years of experience and offer 4 fantastic brands to choose from.\n\n\n•We provide automotive solutions for customers for the Hunter Region through to Newcastle and beyond, we will even come to you!\n\n\n•Our team has partnered with St George Finance to offer our customers affordable finance solutions. \nSource: this is an extract from the company’s own website."},
{"employer_url": "https://www.seek.com.au/companies/kellypartners-828955", "employer_name": "Kelly+Partners", "employer_info": "Kelly+Partners was founded in on a handshake and a determination to challenge the status quo, in 2006, as a small group of accountants dedicated to providing advice and expertise at the highest levels.\n\nKelly+Partners have achieved extraordinary results following the distinctive visions of our founders - a cohesive team of advisors intensely focused on helping our clients manage their entire financial universe and solving our clients’ most important problems. \n\nWe have experience in the fields of accounting, taxation, business advisory, audit, taxation consulting, wealth management and family office services. \n\nOur specialty is counsel to Private Business Owners, individuals and families of significant wealth to keep control of, preserve and grow their wealth. \n\nWe have some of the largest, most complex and demanding businesses, owners, individuals and families across private advisory matters in Sydney and nationally. \n\nWe have a track record of original and ground-breaking solutions and innovations that have had a dramatic impact on the way business is conducted in our industry and we are regarded as thought leaders. \n\nOur distinctive ownership and operational structure defines our approach. \n\nWe maintain a ratio of associates to Client Directors significantly below that of other firms and our Client Directors are equity owners who have made a minimum 10-year commitment to be with the firm ensuring continuity of advice to our clients. \n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/kells-the-lawyers-437909", "employer_name": "Kells the Lawyers", "employer_info": "\r\n\r\n"},
{"employer_url": "https://www.seek.com.au/companies/kelly-sports-434419", "employer_name": "Kelly Sports", "employer_info": "\r\n\r\n"},
{"employer_url": "https://www.seek.com.au/companies/kellerberrin-district-high-school-871193", "employer_name": "Kellerberrin District High School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/kellerberrin-memorial-health-service-871194", "employer_name": "Kellerberrin Memorial Health Service", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/kelloggs-436429", "employer_name": "Kellogg's", "employer_info": "At Kellogg, we LOVE breakfast. To us it’s so much more than just a meal. We passionately believe in the power and promise that comes from eating the right breakfast. It’s the first fuel for our bodies—nourishing us for today, tomorrow and for life.\n\nFor more than 100 years, we’ve been working to serve the world a better breakfast. Whether it’s through the creation of cereals such as Corn Flakes and Special K or our more recent breakfast drinks, we want everyone to have the advantage that can come from eating breakfast.\n\nWe know that beginning the day with you is a privilege so we’ll continue to do our best to earn a place at your table every morning.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/kellerberrin-community-health-service-871192", "employer_name": "Kellerberrin Community Health Service", "employer_info": "Our care is holistic in approach and is designed to assist the person to attain an optimal level of independence, prior to discharge home or to appropriate accommodation. The Kingston Centre plays a vital role in the community providing aged care, aged mental health services and highly regarded rehabilitation programs for adults of all ages\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/keller-836040?child=803511", "employer_name": "Keller Ground Engineering", "employer_info": "Keller in Australasia.  Operating throughout Australia and New Zealand as Keller Foundations, providing Piling and Diaphragm Walling techniques, and Keller Ground Engineering providing Ground Improvement and other specialty techniques, Keller is your first choice partner in geotechnical solutions.\n\nKeller Ground Engineering or one of our sister companies is constantly looking for Managers, Engineers, Supervisors, Leading Hands and Operators.\n\nIf working in an exciting, stimulating, diverse and challenging environment is what you are looking for then give us a ring or send us an email.\n\nWe are committed to a regular intake of Graduates & Undergraduates across the company. We seek enthusiastic self motivated people with a relevant degree who have a flexible approach and an aptitude for contracting. Please send us an email marked for the attention of the HR Manager telling us what you would like to do in the geotechnical/civil engineering industry.\nSource: this is an extract from the company’s own website."},
{"employer_url": "https://www.seek.com.au/companies/keller-836040?child=836041", "employer_name": "Keller Foundations", "employer_info": "Keller in Australasia.  Operating throughout Australia and New Zealand as Keller Foundations, providing Piling and Diaphragm Walling techniques, and Keller Ground Engineering providing Ground Improvement and other specialty techniques, Keller is your first choice partner in geotechnical solutions.\n\nKeller Ground Engineering or one of our sister companies is constantly looking for Managers, Engineers, Supervisors, Leading Hands and Operators.\n\nIf working in an exciting, stimulating, diverse and challenging environment is what you are looking for then give us a ring or send us an email.\n\nWe are committed to a regular intake of Graduates & Undergraduates across the company. We seek enthusiastic self motivated people with a relevant degree who have a flexible approach and an aptitude for contracting. Please send us an email marked for the attention of the HR Manager telling us what you would like to do in the geotechnical/civil engineering industry.\nSource: this is an extract from the company’s own website."},
{"employer_url": "https://www.seek.com.au/companies/keller-836040", "employer_name": "Keller", "employer_info": "Keller in Australasia.  Operating throughout Australia and New Zealand as Keller Foundations, providing Piling and Diaphragm Walling techniques, and Keller Ground Engineering providing Ground Improvement and other specialty techniques, Keller is your first choice partner in geotechnical solutions.\n\nKeller Ground Engineering or one of our sister companies is constantly looking for Managers, Engineers, Supervisors, Leading Hands and Operators.\n\nIf working in an exciting, stimulating, diverse and challenging environment is what you are looking for then give us a ring or send us an email.\n\nWe are committed to a regular intake of Graduates & Undergraduates across the company. We seek enthusiastic self motivated people with a relevant degree who have a flexible approach and an aptitude for contracting. Please send us an email marked for the attention of the HR Manager telling us what you would like to do in the geotechnical/civil engineering industry.\nSource: this is an extract from the company’s own website."},
{"employer_url": "https://www.seek.com.au/companies/keilor-hotel-437875", "employer_name": "Keilor Hotel", "employer_info": "Some things get better with age; the Keilor Hotel is one of them. The Galway Arms Bistro is the perfect place to enjoy a fine meal & a glass of wine.\nOur Venue is ideal for your function. We have many years of experience in catering for engagements, christenings, special occasions, birthday celebrations and wakes.\nFor memorable & inspiring events, look no further. Our Marquee & Vinery is the perfect location for couples looking for a sophisticated, affordable wedding.\nSource: this is an extract from the company’s own website"},
{"employer_url": "https://www.seek.com.au/companies/keith-prowse-travel-800235", "employer_name": "Keith Prowse Travel", "employer_info": "Keith Prowse Travel (KPT)\n\nKeith Prowse Travel specialises in sports events, entertainment and conference travel packages. The company has been associated with the sale of tickets to sporting and special events since 1830, opening with the world’s first ticketing office.\n\nToday Keith Prowse Travel has access to major events and festivals across the world including the Hong Kong Sevens, Melbourne Cup, Chelsea Flower Show, Australian Open Tennis, USA Sports, Edinburgh Tattoo and Singapore Grand Prix.\n\nKeith Prowse Travel is a licensed travel agent with a dedicated team of travel and events ticketing experts based in Sydney who are passionate about delivering unique and memorable experiences.\n\nThe team can also help to build tailored packages to suit the needs of special interest groups of all sizes including cultural, religious, arts, business, family, sports, incentive, conference and educational tours.\n\nExperiences are what define you, and KPT delivers great experiences…\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/kearney-group-financial-services-867918", "employer_name": "Kearney Group Financial Services", "employer_info": "As a multi-disciplinary practice, the Kearney Group offers a wide range of services that not only complement one another, but produce a greater outcome when combined than when used alone.\n\nAs always, our advice draws on the expertise of professionals from across our practice, and our Collaborative Approach provides the opportunity for cross-departmental knowledge sharing and seamless integration into full-suite accounting and financial planning services as required.\nThe Kearney Group is an innovative professional financial services firm which specialises in holistic and individually tailored client-centred care that enriches the business ventures and personal lives of our clients by appropriately positioning and protecting what they have today, planning for what they want in their future and preparing the path by which they’ll reach their goals. \nThe Kearney Group is a vibrant, innovative industry-leader that provides holistic and integrated professional financial services and sets the standard for first-class client-centred care. \nSource: This is an extract from the company's own website"},
{"employer_url": "https://www.seek.com.au/companies/keebra-park-state-high-school-820638", "employer_name": "Keebra Park State High School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/kedron-state-high-school-819414", "employer_name": "Kedron State High School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/keema-automotive-group-995240", "employer_name": "Keema Automotive Group", "employer_info": "Our goal is for you to become a Keema cars customer for life by providing you with the most hassle-free automotive purchasing, servicing, and ownership experience possible. We are a third generation family owned and run dealership with 60 years’ experience providing cars to customers in Brisbane and South East Queensland. We are very fortunate to represent a large portfolio of brands we believe in, and products this good deserve to be backed up by a world-class customer service experience and that's what we will provide you when you choose to do business with Keema Cars.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/kedron-wavell-services-club-436955", "employer_name": "Kedron Wavell Services Club", "employer_info": "As a Not-For-Profit organisation, Kedron-Wavell Services Club Inc has a team of over 200 which includes Management, Frontline Management, Administration and Operational Staff.\n\nWe are proud to be an Equal Opportunity Employer with all team members employed under an EBA agreement which is bargained for by staff, management and the union. We also have a food safety program accredited through international HACCP standards which ensures the safest, highest quality product is provided for our members and guests. We pride ourselves on our safe and healthy work environment and maintain this through an in-house OH& S team.\n\n\nSource: This is an extract from the company's own website"},
{"employer_url": "https://www.seek.com.au/companies/kealba-hotel-437710", "employer_name": "Kealba Hotel", "employer_info": "The Kealba Hotel\n\nYou will be immediately impressed on visiting the newly refurbished Super TAB and Lounge at the Kealba Hotel. The Kealba boasts a new “state of the art” TAB and Sports Bar layout comprising a new huge Video Wall in the Sportsbar – a great way to watch your favourite sporting events. The Lounge area boasts a new layout designed to provide a superior customer experience. The Kealba Hotel is the perfect venue to eat, drink or play in impressive style. Come in and see us today.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/kbr-432688", "employer_name": "KBR", "employer_info": "KBR is a global provider of differentiated professional services and technologies across the asset and program life cycle within the Government Services and Hydrocarbons sectors.  We employ approximately 34,000 people worldwide (including our joint ventures), with customers in more than 80 countries, and operations in 40 countries, across three synergistic global businesses – Government Services, Technology & Consulting and Engineering & Construction.\n\nFrom safe and reliable water supplies, state-of–the-art health and educational facilities to efficient transport systems and clean energy, KBR has been supporting clients to deliver vital infrastructure to Australian communities for more than 50 years.\nKBR offers a wide range of professional consulting services to private and public sector clients to deliver projects of any size in both urban and remote environments. We are technically and geographically diversified to match the characteristics of our principal markets and have the capability to service our clients' requirements across all phase of project development and delivery including:\n\n\n• Engineering studies, planning, feasibility studies and conceptual design\n• Detailed engineering design and design management\n• Project and program management\n• Engineering, procurement, construction and commissioning\n• Asset management \n• Environmental assessment, approvals and management\n• Stakeholder consultation and engagement\n\n\nKBR's collaborative and flexible approach to project delivery is reflected in our long-term relationships and contracting arrangements with clients. At KBR, We Deliver."},
{"employer_url": "https://www.seek.com.au/companies/kawungan-state-school-819952", "employer_name": "Kawungan State School", "employer_info": "The staff, parents and students associated with this school welcome you into the school community. Kawungan State School was established in 1991 and now sits in spacious, attractive and well-maintained grounds. The school is fortunate in being able to provide modern classrooms with up-to-date resources and facilities. Kawungan State School is a co-educational campus offering a range of learning experiences for a wide variety of students in primary school working collaboratively with a special education unit. Together, these learning experiences support staff and students in achieving the best educational outcomes for every student attending Kawungan State School.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/specialty-fashion-group-433042?child=433831", "employer_name": "Katies", "employer_info": "\n\n"},
{"employer_url": "https://www.seek.com.au/companies/kcgm-433386", "employer_name": "KCGM", "employer_info": "Kalgoorlie Consolidated Gold Mines (KCGM) is the management company of the Kalgoorlie Operations for Joint Venture Owners Barrick Australia Pacific Pty Ltd and Newmont Asia Pacific Ltd. \n\nThe current KCGM Life of Mine Plan sees gold processing until around 2029. Mt Charlotte underground mining will finish around 2018 and Fimiston Open Pit mining will conclude around 2019. On completion, the Fimiston Open Pit will measure 3.5 km in length, 1.5 km in width and up to 700 metres in depth. Several key projects are being undertaken to allow for mineral processing until 2029. These include increasing the capacity of tailings storage facilities, as well as upgrades at the Fimiston and Gidji Processing Plants to reduce air emissions. While the current Life of Mine Plan has KCGM operating to around 2029, KCGM continues to look for opportunities to extend mine life.\n\nSource: this is an extract from the company’s own website"},
{"employer_url": "https://www.seek.com.au/companies/kava-cafe-800219", "employer_name": "Kava Cafe", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/kawana-waters-state-college-800226", "employer_name": "Kawana Waters State College", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/kathmandu-432645", "employer_name": "Kathmandu", "employer_info": "We design, we test, we adapt, right here in New Zealand.\n\nWe were born in New Zealand – a breathtaking country where isolation breeds innovation and the hunger to explore.\n\nFor 30 years, we have designed our gear to take on the rugged landscapes of our homeland and to outfit the adventurous spirit of our people.\n\nWith Kiwi ingenuity, and an open mind, we continuously adapt our gear to endure different weather conditions, diverse terrains, and the everchanging needs of travellers.\n\nWe act with people and the planet in mind – from the creative minds of our designers, to the careful hands of our suppliers, to the backs of our customers all around the world.\n\nWe believe that adventure begins when you pack your bag.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/katherine-south-primary-school-988193", "employer_name": "Katherine South Primary School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/katherine-school-of-the-air-988192", "employer_name": "Katherine School Of The Air", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/katherine-hospital-800216", "employer_name": "Katherine Hospital", "employer_info": "Introduction\n\nThe Katherine Hospital is a non-specialist public hospital that services Katherine and the surrounding region and remote areas.\n\nIt has 60 beds.\n\nThis guide has information about making an appointment, services, visiting the hospital and how to contact Katherine Hospital.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/katherine-high-school-988191", "employer_name": "Katherine High School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/kate-hill-435896", "employer_name": "Kate Hill", "employer_info": "Luxurious detailing, feminine styles and functional design are synonymous with the Kate Hill brand.\n\nThese three core characteristics lie at the heart and soul of this Australian owned company and are represented in every handbag, wallet and accessory designed by our passionate team. Established in 2007, Kate Hill is committed to creating products that fit effortlessly into the lifestyles of everyday women.\n\nEvery season Kate Hill delivers a collection of new and now pieces. Our commitment to quality and providing a memorable shopping experience can be seen at any of our stores across Australia or online. No matter where you shop with Kate Hill, you can always expect quality, value and exceptional customer service.\n\nSource: this is an extract from the company’s own website"},
{"employer_url": "https://www.seek.com.au/companies/katherine-group-school-988190", "employer_name": "Katherine Group School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/katarzyna-group-813572", "employer_name": "Katarzyna Group", "employer_info": "As one of Australia’s largest and most successful independent hospitality groups, The Katarzyna Group own and manage an impressive array of venues, restaurants and accommodation including Cloudland, Family, Press Club, Bincho, Birdees and Bunk Backpackers.\n\nOur venues boast their own unique individuality yet all deliver and resemble who we are as a group. \n\nWe are meticulous, bold and full of life.\n\nWe are The Katarzyna Group.  \nSource: This is an extract from the company's own website"},
{"employer_url": "https://www.seek.com.au/companies/kedron-state-school-820308", "employer_name": "Kedron State School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/katanning-senior-high-school-871168", "employer_name": "Katanning Senior High School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/katanning-primary-school-871167", "employer_name": "Katanning Primary School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/kaspersky-lab-927477", "employer_name": "Kaspersky Lab", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/katanning-adult-community-corrections-875082", "employer_name": "Katanning Adult Community Corrections", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/katanning-hospital-871166", "employer_name": "Katanning Hospital", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/karumba-state-school-820415", "employer_name": "Karumba State School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/karumba-hospital-821551", "employer_name": "Karumba Hospital", "employer_info": "Karumba has been reclassified as a primary health care centre under new guidelines for rural and remote health facilities being introduced across Queensland.\n\nKarumba offers nurse-led clinic facilities from Monday to Friday with services including primary healthcare, emergency stabilisation and pathology collection, as well as ambulance services and a 24-hours a day, seven-days a week emergency on-call service.\n\nKarumba is staffed by a director of nursing with an additional registered nurse from May to October during the tourist season each year when the population increases by 2000-3000 people.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/kart-world-belmont-927455", "employer_name": "Kart World Belmont", "employer_info": "WHY WE ARE THE BEST GO KARTING VENUE IN WA…\n\nWe have been established since 1989 and are considered the most professionally run Go Karting centre in WA. Our friendly and approachable staff are dedicated to ensuring that your Go Karting experience at Kart World is exactly as it should be – safe & FUN.\nWe use world class, top quality German engineered Rimo karts – the Porsche’s of go karts! We have 5 levels of karts catering to beginners through to serious drivers and our top level karts outclass every one of our competitors.\nOur indoor karting track has been engineered for skill and speed and every driver receives an individual print out of their lap times. You can also check your scores here on our website!\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/karrinyup-primary-school-871161", "employer_name": "Karrinyup Primary School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/karrikins-group-community-813735", "employer_name": "Karrikins Group Community", "employer_info": "We are a growth-oriented consulting firm with deep expertise in business transformation and community investment. We live at the intersection of commercial gain and social impact, and our work reflects the positive influence we have on the world. By transforming the way people think, act and buy we are able to solve the most complex problems that arise where tensions exist between legacy approaches and future opportunity.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/karridale-primary-school-871160", "employer_name": "Karridale Primary School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/karridale-group-436428", "employer_name": "Karridale Group", "employer_info": "KG is a privately owned construction and maintenance contractor headquartered in Bentley, Western Australia.\n\nAcquired in 2010, the business has developed in recent years to meet the growing demands of the Australian construction and maintenance market.\n\nSpecialising in process plant and non-process infrastructure SMP works, KG has completed site construction and maintenance projects throughout Australia with values ranging from $0.5 – 50M.\n\nKG has an experienced and long-serving management team, whose vision and philosophies are closely aligned with the company’s.  This experience and our commitment to client satisfaction form the cornerstone of our business.\n\nKG employs a highly skilled local workforce, supported by a large database of previous employees, enabling us to rapidly mobilise large labour forces to client sites.  Our safety systems and culture are well developed and are evidenced by our excellent safety record.\n\nAt KG we take a collaborative approach to contract execution, preferring to partner with our clients to achieve their goals and exceed their expectations.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/karratha-tavern-438262", "employer_name": "Karratha Tavern", "employer_info": "ACCOMMODATION:\nCattrall Park Motel is the best value accommodation in Karratha.\nLocated on site at the Karratha Tavern, Cattrall Park boasts of a range of modern guest facilities and all the comforts of home, including TV, Foxtel, and reverse cycle air conditioning.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/karratha-youth-justice-service-875081", "employer_name": "Karratha Youth Justice Service", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/karratha-primary-school-871157", "employer_name": "Karratha Primary School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/karratha-adult-community-corrections-875080", "employer_name": "Karratha Adult Community Corrections", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/karras-cold-logistics-803481", "employer_name": "Karras Cold Logistics", "employer_info": "Extraordinary levels of service and excellent equipment standards were key underpinnings to the success of the business in the early years, and were the seeds of what we now know at Karras as the Karras Principles.\n\nAt the heart of the Company today, is a family culture. Upholding our family values and principles, whilst reinvesting in people, top quality equipment and Information Technology are primary objectives for the current Management Team. \nPrinciples\n##The Customer deserves the utmost in respect and commitment\n##Be reliable, flexible, responsive and creative\n##To display integrity, ethics and quality to customers, fellow staff and the community at large\n##Listen, understand, think and execute\nKarras delivers value for our customers by creating unique and powerful supply chain solutions that put your critical products where they need to be - at the lowest cost - and with a level of quality unmatched in our industry.\n\nSince 1976, we have assisted many organisations with their Logistics requirements. We serve retailers, importers, wholesalers, manufacturers and processors in industries including: \n##Aviation\n##Bakery \n##Beverages\n##Confectionary\n##Dairy\n##Film\n##Fruit & Vegetable\n##Meat Products\n##Plastics\n##Poultry\n##Seafood\nSource: this is an extract from the company’s own website."},
{"employer_url": "https://www.seek.com.au/companies/karratha-international-hotel-803484", "employer_name": "Karratha International Hotel", "employer_info": "Positioned just off the Dampier Highway and minutes from the commercial precinct of Karratha, the Karratha International Hotel is the only AAA rated 4 star, full service hotel in the Pilbara region. Discover a blend of modern design and amenities at one of the best hotels in regional Western Australia. The Karratha International Hotel provides a relaxed and discerning level of hospitality in a hotel dedicated to the perfect guest experience.\n\nKarratha International Hotel’s accommodation is ideal for business providing well appointed work spaces in each guest room. Should your requirements need a little more space why not book a meeting room with full conference facilities including polycom telephony, data projectors and WiFi connections. If it is simply rest and relaxation you are looking for – we can provide this too, with a number of attractive packages available to choose from. Whether you are here on business or just taking some time out to relax, let us look after your every requirement.\nSource: this is an extract from the company’s own website"},
{"employer_url": "https://www.seek.com.au/companies/karratha-senior-high-school-871158", "employer_name": "Karratha Senior High School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/karnet-prison-871151", "employer_name": "Karnet Prison", "employer_info": "Karnet Prison Farm plays a vital role in the prison system, providing work for minimum-security prisoners. It produces food including milk, meat and eggs for the State's prisons.\n\nKarnet focuses on preparing prisoners for successful re-entry into the community when they are released, giving them job skills linked to agricultural production. The prison breeds cattle and sheep and has an abattoir, a dairy, poultry farm, market gardens and an orchard.\n\nAs part of a state-wide prisoner community work program, the prison is closely associated with the Community Liaison Group (CLG). For more information about the CLG or to become a member, refer to the application form and information package below or contact Karnet Prison Farm.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/kas-australia-927464", "employer_name": "Kas Australia", "employer_info": "KAS brings you collections of lifestyle products for your home. Our luxurious bath towel ranges made of cotton rayon blends in jacquard quality, feature both floral and geometric patterns.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/karingal-813701", "employer_name": "Karingal", "employer_info": "Karingal is a not-for-profit organisation that commenced services in Geelong in 1952.\n\nIt was established to improve the quality of life for people with a disability by providing and promoting valued services, care and supports in:\n\nPersonal development\nEducation programs\nVocational placement, training and support services\nAccommodation and associated support services and\nAged care and related services.\nTo ensure these services and supports are delivered in a timely and effective manner Karingal undertakes to:\n\nPromote the organisation, its services and purpose\nEncourage partnerships with all levels of government, businesses and potential funding bodies\nUndertake ventures and business enterprises that promote Karingal's purpose and\nPromote membership of the Association to the Karingal community.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/kambalda-west-district-high-school-871118", "employer_name": "Kambalda West District High School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/kari-aboriginal-resources-816750", "employer_name": "KARI Aboriginal Resources", "employer_info": "Today, KARI is proud to employ almost 100 people and has established offices in South West Sydney, Sydney Metro and Western Sydney. We strive to offer a continuum of award-winning services that all begin at general community engagement, move on to models of early intervention and ultimately work to deliver an effective foster care program – all with the end goal of family restoration and preservation.\nOur commitment to providing high quality, sustainable services and programs that benefit our community is unwavering. As a result, KARI has been recognised by many as one of the nation’s leading Aboriginal service providers. We seek to help our community flourish. We believe in helping our families to grow strong and we will continue to be the best we can for our community.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/kambalda-primary-school-871117", "employer_name": "Kambalda Primary School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/kardinya-primary-school-871143", "employer_name": "Kardinya Primary School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/katanning-youth-justice-service-875083", "employer_name": "Katanning Youth Justice Service", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/karlarra-house-871150", "employer_name": "Karlarra House", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/karen-millen-435446", "employer_name": "Karen Millen", "employer_info": "The brand is now available in over 350 stores and concessions in 45 countries worldwide, with 100 stores in the UK and over 250 internationally.\n\nThe brand is currently in the most prestigious fashion cities including; London, Paris, Madrid, New York, L.A. and Hong Kong. 2011 has been a hugely successful year for us, and the last five years has seen the brand truly emerge globally with international turnover increasing by over 400%.\n\nOne of the key components of the brand's success is its distinct signature that has remained constant throughout expansion. By offering a consistent franchise and cohesive brand experience worldwide, Karen Millen maintains its reputation as one of the most recognised brands in the world, with women worldwide wanting to buy into the brand's signature style.\n\nSource: this is an extract from the company’s own website"},
{"employer_url": "https://www.seek.com.au/companies/kambala-814793", "employer_name": "Kambala", "employer_info": "Kambala is an Early Learning Centre — Year 12 Independent Anglican girls’ school, located in beautiful grounds on the rising shore above Rose Bay, overlooking Sydney Harbour.\n\nKambala values traditional, proven educational practices and is responsive to the need to incorporate worthwhile innovations.\n\nOur current high ranking is due in large part to the commitment and expertise of staff, the leadership of the School Council members and Principal, the support of\nparents and Old Girls and, of course, the quality\ndedication and determination of our students.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/kambalda-health-centre-871116", "employer_name": "Kambalda Health Centre", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/kalumburu-remote-community-school-871115", "employer_name": "Kalumburu Remote Community School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/kalkie-state-school-819664", "employer_name": "Kalkie State School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/kallangur-state-school-820583", "employer_name": "Kallangur State School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/kalkaringi-school-988188", "employer_name": "Kalkaringi School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/karratha-automotive-group-927430", "employer_name": "Karratha Automotive Group", "employer_info": "For many years the friendly staff at Karratha Automotive Group have been selling and servicing New and Used vehicles in Karratha and the surrounding area.\n\nOur friendly staff are specialists who are proud of their work and look forward to assisting you when searching for your new or used vehicles.\n\nKarratha Automotive Group at a glance:\n\nWe are a family owned business.\nWe are a multi award winning dealer.\nOur awards are based on recognition for excellence in sales, service and Customer Satisfaction.\nKarratha Automotive Group actively supports our local community, charities and sporting clubs.\nWe enhance your buying experience by providing expert after sales service with courtesy pick-up and drop-off convenience, knowing your car is being treated with the care and professionalism you would expect in our large and modern workshop service area.\n\nOur team are dedicated to providing you with the best of care at all times, so whether you are buying, selling or leasing come and experience the difference at Karratha Automotive Group.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/kalgoorlie-boulder-community-high-school-875073", "employer_name": "Kalgoorlie-Boulder Community High School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/kalgoorlie-boulder-population-health-unit-875074", "employer_name": "Kalgoorlie-Boulder Population Health Unit", "employer_info": "Population Health comprises Community Health, Health Promotion and Public Health, and aims to protect, promote and restore people's health. It represents the combination of sciences, skills and beliefs that are directed to the maintenance and improvement of the health of whole populations through collective actions.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/kalgoorlie-youth-justice-service-875072", "employer_name": "Kalgoorlie Youth Justice Service", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/kalgoorlie-school-of-the-air-871110", "employer_name": "Kalgoorlie School Of The Air", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/kalgoorlie-primary-school-871109", "employer_name": "Kalgoorlie Primary School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/kalgoorlie-hospital-800198", "employer_name": "Kalgoorlie Hospital", "employer_info": "This is a public hospital. This hospital has between 100 and 199 beds. This hospital has an emergency department . \nHospital services:\n\n\n-Emergency department\n-Maintenance renal dialysis unit\n-Obstetric services\n\n-Oncology unit\n-Paediatric service\n-Psychiatric unit \nSource: This is an extract from the company's own website"},
{"employer_url": "https://www.seek.com.au/companies/kalgoorlie-health-campus-871108", "employer_name": "Kalgoorlie Health Campus", "employer_info": "The $59.6 million redevelopment of Kalgoorlie Health Campus was officially opened on 28 August 2015 by Health Minister Dr Kim Hames. Local residents and surrounding communities can enjoy improved patient services with more options for visiting clinicians to accommodate future demand.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/kalgoorlie-aged-care-assessment-team-871107", "employer_name": "Kalgoorlie Aged Care Assessment Team", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/kalgoorlie-adult-community-corrections-875071", "employer_name": "Kalgoorlie Adult Community Corrections", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/kaleen-preschool-871105", "employer_name": "Kaleen Preschool", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/kaleen-primary-871106", "employer_name": "Kaleen Primary", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/kalbarri-district-high-school-871103", "employer_name": "Kalbarri District High School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/kalbarri-health-centre-871104", "employer_name": "Kalbarri Health Centre", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/kalari-436199", "employer_name": "Kalari", "employer_info": "With over 30 years’ experience, Kalari is Australia’s most innovative and prominent specialist bulk logistics provider to the mining and resources sector and other selected industries.\n \nKalari offers customised, best-fit, contracted solutions for high-volume logistics challenges to many of Australia’s leading corporations – with particular emphasis on safety, compliance assurance, people and leadership, operational excellence, customer engagement and sustainability. We cover a vast geographical area servicing more than 100 mining and industrial sites across Australia.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/kalannie-primary-school-871101", "employer_name": "Kalannie Primary School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/kalbar-state-school-819506", "employer_name": "Kalbar State School", "employer_info": "The town of Kalbar, located in the Scenic Rim Regional Shire is a rural orientated community within a half hour drive of Ipswich and just over an hours drive to Brisbane, Toowoomba or the Gold Coast.\n\nThe shire offers a pleasant rural atmosphere providing a relaxed country environment, charming and hospitable towns with scenic views and nearby city facilities.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/kalamunda-senior-high-school-871098", "employer_name": "Kalamunda Senior High School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/kalamunda-senior-high-school-education-support-centre-871099", "employer_name": "Kalamunda Senior High School Education Support Centre", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/kalamunda-primary-school-871097", "employer_name": "Kalamunda Primary School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/kalamunda-education-support-centre-871096", "employer_name": "Kalamunda Education Support Centre", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/kalamunda-hospital-795990", "employer_name": "Kalamunda Hospital", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/kalamunda-community-health-office-795989", "employer_name": "Kalamunda Community Health Office", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/kalamia-hotel-803447", "employer_name": "Kalamia Hotel", "employer_info": "Christian Schooling and \nDistance Education QLD\nWelcome to Riverside Christian College in QLD, we are an independent, non-denominational and co-educational P-12 Christian school which offers both Distance Education School and Day School.\nThe Day School is located in the heritage-rich city of Maryborough Queensland. Riverside Day School is a safe & secure environment for students. The College successfully combines traditional and innovative teaching methods with twenty-first century technology. The College has a family oriented approach with a strong pastoral care program and a high student to teacher ratio.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/kalamia-state-school-820340", "employer_name": "Kalamia State School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/kaizen-motors-813927", "employer_name": "Kaizen Motors", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/kairi-state-school-820531", "employer_name": "Kairi State School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/kaimkillenbun-state-school-819643", "employer_name": "Kaimkillenbun State School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/kailis-marine-875556", "employer_name": "Kailis Marine", "employer_info": "Capabilities\n\n\nMarine Engineering:\n-Vessel repairs and refits\n-Offshore structures\n-Pipelines\n-Pressure vessels\n-Sea fastening\n-Ships, barges, jetties\n-Shutdowns & breakdowns\n-Load-out\n-Barge transport\n-Surface treatment \n\n\nDiving:\n\n-Class certified UWILD & propeller polishing (subject to environmental regulations)\n-Site jacking\n-Salvage\n-Contaminated water diving\n-NOPSA approved Dive Safety Management System (DSMS)\n-IMS Inspections\n-All facets of IRM & Construction\n-Cyclone mooring design, installation and maintenace\n-Project management & support\n\nMarine:\n-Broad suite of vessels and crew\n-Utility/transfer work\n-Accommodation\n-Dive support\n-Construction\nSource: This is an extract from the company's own website"},
{"employer_url": "https://www.seek.com.au/companies/kailis-bros-434012", "employer_name": "Kailis Bros", "employer_info": "George Palassis Kailis arrived in Western Australia from the tiny Greek island of Kastellorizo in 1914, bringing with him the proud seafaring history of his people. In 1926, George was selling fresh fish from a basket in Perth, when he found employment in an inner city fish shop which he eventually took over in 1936.\nThe shop, trading as GP Kailis & Sons, became a landmark in Barrack Street Perth, where it stayed until March 1990. In 2000 Kailis Bros established state of the art award winning premises in Oxford Street Leederville.\nSince its humble beginnings the family business has now expanded to service the seafood needs of Australia and the world over. Its head office and processing and distribution operation in Canning Vale is recognised as one of Australia's premier food service facilities.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/kaefer-434090", "employer_name": "Kaefer", "employer_info": "KAEFER operates in three business areas; Industry, Marine & Offshore and Construction. \n\nThe KAEFER Competency Centre Pre-Insulation (CCP) system has its main application on LNG plants and receiving terminals, such as the jetty load out and vapours return lines. The system is designed for the insulating of piping that operates at cold or cryogenic temperatures. \n\nKAEFER CCP provides a pre-insulation process that offers compelling benefits over conventional hand applied and other insulation methods. \n\nKAEFER CCP has invested heavily in research and development to refine a mechanised process that results in a high-quality overall solution that can be completed anywhere, on-time and at a competitive costs. \n\nSource: this is an extract from the company’s own website"},
{"employer_url": "https://www.seek.com.au/companies/kands-freighters-434132", "employer_name": "K&S Freighters", "employer_info": "K&S Freighters provides road, rail and coastal sea forwarding in support of full and\nbreak bulk loads, including export packing, wharf lodgement and the delivery of integrated supply chain and systems solutions to our key customers.\n\nK&S Freighters is recognised as a true multi modal provider of transport solutions, maintaining outstanding facilities and resource base and controlling one of the largest company owned and operated fleets in Australia, over 160,000 sq m of warehousing and a large range of rail and sea containers.  Key major national locations include Truganina\nVic, Enfield NSW, Coopers Plains Qld, Fisherman Islands Qld, Gillman SA and Kewdale\nin WA.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/k2-technology-813521", "employer_name": "K2 Technology", "employer_info": "K2 Technology Pty Ltd, founded in 2000, has established itself as a leading provider of Asset Management Services, including Maintenance and Reliability, Supply Chain and Operations Support.\n\nK2 prides itself on offering a highly skilled and dedicated workforce to deliver a cost effective solution to our clients. Our expertise is continually refined, ensuring we provide leading edge services in line with the latest available processes.\n\nWith a head office in Perth, an office in Brisbane supporting the East Coast and two agents representing us in the Asian market, K2’s expansion ensures its ability to offer its expertise to an expanding client base.\nSource: this is an extract from the company’s own website"},
{"employer_url": "https://www.seek.com.au/companies/kaeser-compressors-814771", "employer_name": "Kaeser Compressors", "employer_info": "From the state-of-the-art production facility in Coburg, Germany, KAESER is proud to manufacture its extensive range of; stationary, low pressure, portable and dental compressors, which are exported globally through a comprehensive network of branches, subsidiary companies and authorised partners.\n\nCloser to home, KAESER Compressors Australia - which was established in 1990 - serves the Australian, New Zealand and New Caledonian markets from its 30,000 ft2 purpose built factory in Dandenong, Victoria. In addition, KAESER has Sales and Service Centres and a dedicated network of authorised partners strategically located throughout the region.\n\nSource: This is an extract from the company's own website."}
]