[
{"employer_url": "https://www.seek.com.au/companies/j-and-p-richardson-industries-814860", "employer_name": "J & P Richardson Industries", "employer_info": "J&P RICHARDSON\n\nJ & P Richardson Industries Pty Ltd (JPR) is a progressive and innovative company that has been providing services in the Electrical and Mechanical Contracting field since 1958. J & P Richardson has grown and developed over the years through our on-going commitment to quality, both in our performance and in our technical capability, our health and safety programs, and the continual improvement of our management systems.\n\nOur success is due to the combined expertise of approximately 500 skilled, loyal and dedicated staff, backed by a professional and innovative management team. J & P Richardson Industries Pty. Ltd sphere of operations has evolved over the years; with our diverse range of activities, we are able to offer our clients services that ensure customer satisfaction and compliance with all regulatory and legislative requirements.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/jeanswest-432605", "employer_name": "Jeanswest", "employer_info": "\n\n"},
{"employer_url": "https://www.seek.com.au/companies/jenny-craig-433233", "employer_name": "Jenny Craig", "employer_info": "\n"},
{"employer_url": "https://www.seek.com.au/companies/jennys-kindergarten-815034", "employer_name": "Jenny's Kindergarten", "employer_info": "Jenny’s Kindergarten’s are an established family run organisation since 2000 with a strong passion to be the leading providers in premium Early Childhood Education and Care.\nAt Jenny’s our mission is to provide premium Education and care in an enriching, challenging, safe and supportive learning environment that meets the needs of each individual child and their family. Our educator’s role is to encourage and support each individual child to develop and reach their fullest potential emotionally, intellectually and socially.\nWe are committed to life-long learning and believe that children need to be actively involved in the program in order for them to extend their thinking and desire to learn well into the future.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/jeld-wen-861306", "employer_name": "Jeld-Wen", "employer_info": "JELD-WEN is a world leader in the design and manufacture of Windows and Doors. With an established reputation for commitment to innovative design, unsurpassed craftsmanship and excellent customer service, JELD-WEN has provided reliable doors and windows to homes, apartments and commercial buildings around the world for more than 50 years. \n\nThe JELD-WEN Australia team is passionately committed to transforming the residential built environment. As a business, JELD-WEN Australia takes pride in knowing their customers and appreciating the unique way in which they express their lives through their homes.\nJELD-WEN Australia’s product offering delivers a total home solution with a diverse product suite from each individual brand giving customers a versatile and creative range of interior and exterior choices. JELD-WEN Australia is committed to maintaining the trust of its customers and continuing to grow and flourish as the partner of choice for Australia’s residential industry. \nSource: this is an extract from the company’s own website."},
{"employer_url": "https://www.seek.com.au/companies/jennys-elc-815029", "employer_name": "Jenny's ELC", "employer_info": "Choosing the right childcare centre or kindergarten for your child is a big decision for all growing families. At Jenny’s Early Learning Centre, we understand what our families are looking for in a childcare service: a warm, nurturing and engaging environment, with the support of caring, highly qualified early learning educators. It’s all about finding that perfect fit for your child – we understand the needs of our families and our children, and we are happy to help! As a trusted provider of Early Childhood Services, Jenny’s ELC offers care programs for children ranging from 6 weeks to 6 years old, including recognised Preschool Programs at each Centre. Our four centres are located across the local area in Epsom, Maiden Gully, Strathfieldsaye and Bendigo Hospital. They host state of the art facilities that meet the unique developmental needs of every child. \n\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/jefferson-automotive-group-861098", "employer_name": "Jefferson Automotive Group", "employer_info": "The Jefferson Automotive Group has been operating for over 35 years and has grown to be one of Melbourne’s largest and most successful automotive dealership groups.\n\nOriginally established in 1980, the company began as a small Ford dealership employing just 40 people. After successful and sustained growth, the Group now employs over 500 staff across 14 locations, incorporating Ford, Hyundai, Mitsubishi, Subaru, Toyota, Lexus and Kia brands.\n\nJefferson Automotive Group has something for everyone, we offer a comprehensive range of motoring requirements including vehicle servicing, parts, aftermarket accessories, and finance and insurance options.\n\nThe management and staff across our group of motor vehicle dealerships are proud to welcome you to our business and invite you to enjoy the ‘”Freedom to Choose”.\n\nSource: this is an extract from the company’s own website."},
{"employer_url": "https://www.seek.com.au/companies/jellis-craig-real-estate-438446", "employer_name": "Jellis Craig Real Estate", "employer_info": "Established in 1991, the Jellis Craig network is a business based on ethics, integrity and personal service. With a commitment to progressive thinking, Jellis Craig has continually evolved and grown to become one of Melbourne’s leading real estate groups. Jellis Craig’s network of 16 strategically located offices are positioned across Melbourne’s most sought after suburbs and reach into local, interstate and international markets.  \n16 offices across the Jellis Craig network including 2 lifestyle locations \nOver 500 staff members and over 250 sales consultants \n40 bilingual or multilingual sales staff \nSell approximately 3000 homes per year\nHost more than 300 opens and meet over 3,000 potential buyers each week.\nSell more $2million plus property than any other real estate group in Melbourne.  \nA fully integrated database of over 300,000 qualified buyers.  \nAward winning website generating 1.2 million visits per year, with approx 45% new visitors and 55% returning visitors.  \n Approx 60,000 overseas visitors to jelliscraig.com.au per year. \nLed by CEO, Nick Dowling, Jellis Craig Corporate is a team of professional specialists across real estate, technology, business, marketing and creative. Working collaboratively with each sales office, the team’s objective is to achieve best practice and growth for the Jellis Craig network. \nSource: this is an extract from the company’s own website."},
{"employer_url": "https://www.seek.com.au/companies/jemena-432985", "employer_name": "Jemena", "employer_info": "Jemena owns and operates a diverse portfolio of energy and water transportation assets across the east coast of Australia. With more than $9 billion worth of major utility infrastructure, we supply millions of households and businesses with essential services every day.\nWe have more than a century’s experience and expertise in the utilities sector and, with our strong portfolio of high-quality distribution and transmission assets, we are ready to make the most of opportunities for growth and innovation in our operations.\nAs a provider of gas, electricity and water, we have enduring relationships with our customers and the communities where we operate. They are at the heart of our commitment to deliver energy and water safely, reliably and affordably, and to the sustainable growth of our business in the long term.\nJemena is backed by the strong resources of our shareholders, State Grid Corporation of China and Singapore Power."},
{"employer_url": "https://www.seek.com.au/companies/jda-software-800139", "employer_name": "JDA Software", "employer_info": "Supply chains are complex. The answer is simple - Run JDA!\n\n\nJDA delivers end-to-end supply chain solutions that help you seamlessly connect your supply chain and profit more in an omni-channel world.\n\nWith JDA, you can seamlessly deliver for your end-customers, optimizing their experience with your retail store or product — all while you achieve your profit goals. More than 4,000 JDA global customers use JDA integrated retail and supply chain planning and execution solutions to optimize costs, increase revenue and reduce time to value.\n\nOur mission is to help you seamlessly connect your supply chain so you can deliver for your customers.\nSource: this is an extract from the company’s own website."},
{"employer_url": "https://www.seek.com.au/companies/jd-security-801767", "employer_name": "JD Security", "employer_info": "WHATEVER SIZE YOUR BUSINESS WE CAN HELP\nJD Security is a leading integrator of security, video & access control systems serving Small & Medium Business, Enterprise Business, Government & National Accounts across Australia. There’s no better choice for security companies in Sydney, or the rest of Australia, with as much experience and dedication to you and your security monitoring and alarm monitoring than our team.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/jbs-433467", "employer_name": "JBS", "employer_info": "JBS Australia is the largest meat processing company in Australia and a division of JBS, the largest animal protein processing company in the world, working in the areas of food, leather, products for pets, biodiesel, collagen, cans and cleaning products. \n\nSource: this is an extract from the company's own website"},
{"employer_url": "https://www.seek.com.au/companies/jds-814277", "employer_name": "JDS", "employer_info": "JDS is a privately owned Australian-based organisation with offices in Melbourne, Sydney, Brisbane and Adelaide. Often relied upon for highly complex, business critical projects, JDS is known as a leading provider of specialist expertise. That’s why it continues to invest in training and skills development beyond industry standards. This success has also gained recognition within the industry evidenced by strong partnerships with our vendors HPE Software, CA Technologies, AppDynamics, Splunk, and ServiceNow. We have been consistently winning multiple awards since 2005. To continue this momentum, JDS is always on the lookout for consultants to join its team. Your input is welcome. Your voice is valued. And you have the ability to make a difference.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/jcu-dental-800138", "employer_name": "JCU Dental", "employer_info": "Our vision\nJCU Dental aims to support the vision of James Cook University Discipline of Dentistry through:\nprovision of clinical experience to dental students\ncomprehensive dental care to the public of northern Queensland\nemergency dental care services when required\nprovision of specialist procedures referred by local clinical practitioners\nprovision of clinical education and research environment\nOur History\nThe Discipline of Dentistry at James Cook University was established in 2008 in response to the challenges presented by the oral health needs of northern Australia, and its foundation is part of the College of Medicines and Dentistry’s strong commitment to the provision of professional health education in the area. Ours is one of only three dental schools in Australia located outside a capital city. The School’s establishment was funded by a grant of $52.5m from the Federal Government. The new, purpose-built building on the Smithfield campus of the University opened 2011. The Federal funding was supported by $22m to build the Smithfield clinic which opened in February 2012 and later $10m for the Townsville clinic which opened in 2014.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/jbwere-434859", "employer_name": "JBWere", "employer_info": "Drawing on the skills of our specialist teams and the expertise of the NAB Group, JBWere can deliver a range of private wealth services for your needs. We can also offer you advice on structuring, tax planning, estate planning and succession advice, risk management and insurance, self managed superannuation fund strategies and benefit compensation - all under one roof. JBWere offers three core wealth management services depending on your needs and aspirations: investment management, strategic financial advice and access to private banking. Our clients have the flexibility to select an integrated private wealth management offering across all disciplines, or individual services that suit their personal circumstances. Whether you are looking to grow, protect or transfer your wealth, we can help.\n\nSource: this is an extract from the company’s own website"},
{"employer_url": "https://www.seek.com.au/companies/jwh-group-995237", "employer_name": "JWH Group", "employer_info": "An entirely Western Australian, family owned organisation, JWH Group Pty Ltd has grown from employing 120 office staff in 2003 to currently 650 staff and in excess of 2,500 sub-contractors. A composite group of building companies situated in twelve locations with an even spread between metropolitan and regional areas, the group is now Western Australia’s third largest home builder, and a Top 10 project builder in size nationally with an annual turnover of approximately $400 million.\n\nThe collaboration of reputable and successful companies, coupled with geographical spread and dedicated staff with many years of experience forms a foundation for JWH Group Pty Ltd to move forward into the future.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/juvenile-justice-nsw-436008", "employer_name": "Juvenile Justice NSW", "employer_info": "The Department of Justice delivers legal, court and supervision services to the people of NSW by managing courts and justice services, implementing programs to reduce crime and re‑offending, managing custodial and community-based correctional services, protecting rights and community standards and advising on law reform and legal matters. \n\nThe Department delivers a diverse range of essential services and supports to the community of NSW at the point in their lives where they come into contact with either the criminal or civil justice system.\n\nSource: this is an extract from the company’s own website"},
{"employer_url": "https://www.seek.com.au/companies/jv-engineering-803436", "employer_name": "JV Engineering", "employer_info": "JV Engineering was established in 1994. As a local fabricator servicing the mineral processing, mining and related industries the Company gained the reputation as a reliable fabricator meeting not only the timelines, but also excels in the quality of fabrication at cost effective prices.\n\nAs a dynamic Organization with reliable and established relationships throughout the industry, JV Engineering is capable of small scale fabrication up to extended scope on multi-million dollar projects.\n\nThe very efficient and productive teams have built a reputation to manage installations of fabricated items in record timelines. These skills and productivity is the attraction to our Customers where manpower and resources are a consideration to deliver equipment in tight timelines cost effectively.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/just-magazines-803431", "employer_name": "JUST Magazines", "employer_info": "THE ENTHUSIASTS’ MARKETPLACE.Looking for a vehicle that’s out of the ordinary? Look for JUST CARS! From veterans and classics to modern high performance, exotic and luxury cars, as well as hot rods and modified vehicles, JUST CARS is THE marketplace for collectable cars. With hundreds of collectable, desirable and just plain special vehicles for sale in print and online, it’s no wonder JUST CARS is a favourite with car enthusiasts. Looking to buy or sell a special vehicle? Start with JUST CARS\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/just-jeans-432806", "employer_name": "Just Jeans", "employer_info": "Here at Just Jeans, we pride ourselves on the denim expertise we bring to wearing jeans. Our wardrobes are authentic, and truly reflect who we are, so we can always be the best versions of ourselves.\n\nWe’re the Australian denim destination. Having opened our first store on Chapel Street, Prahran in December 1970, we have over forty years’ of experience in denim – so we know a thing or two about finding the ultimate fit and style for our customers.\n\nAt Just Jeans we want our customers to walk out of our stores looking great and feeling positive about themselves. Alongside all of the quality Just Jeans denim, you’ll also find some of the world’s leading jeans brands, including Levi’s, Riders by Lee, Mavi, Guess, True Religion, Calvin Klein and 7 For All Mankind.\n\nIncluding our extensive online store, Just Jeans now has over 246 stores around Australia and New Zealand, each determined to help you find the perfect denim fit for your every occasion. So drop in, say hi, and fall in love with your denim wardrobe with Just Jeans. We’ll fulfil all your denim desires – trust us, it’s what we do.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/just-group-433110", "employer_name": "Just Group", "employer_info": "\n\n"},
{"employer_url": "https://www.seek.com.au/companies/just-cruises-800184", "employer_name": "Just Cruises", "employer_info": "Just Cruises is an Australian Fully Licensed Travel Agency specialising in Cruising both Domestic and International.  We also specialise in flights, transfers and accommodation as well as land based tours. Our goal is to ensure that our clients get a competitive price for their travel arrangements at the time of booking, without compromising excellent customer service and Cruise knowledge. We do the searching and compare prices with other websites and Travel Agencies to offer you Competitive Fares, Cabin Upgrades and Onboard Spending Money. \nWe are one of P&O Cruises, Princess Cruises and Royal Caribbean Cruises Top Agencies in Australia and we are a P&O and Princess Diamond Partner. This give us access to Exclusive Cruise Rates, Cabin Upgrades and Onboard Credit for most cruises for our clients. We also have developed a close business relationship with Royal Caribbean, Celebrity Cruises and Holland America Line and have access to very competitive pricing.\n\nWe aim to be the most experienced Cruise Agency in Australia and are dedicated to learning as much as we can about the products we sell. Our consultants cruise regularly and undertake training and ship inspections continually to enhance and improve on their knowledge of each ship and cruise line.  Each member of the Just Cruises Team has a passion for travel and Cruising in particular.  We get just as excited about you getting excited about your cruise!\n\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/just-crazy-bargains-927005", "employer_name": "Just Crazy Bargains", "employer_info": "Welcome to JUST CRAZY BARGAINS!\nTo enhance your shopping experience with us, we are pleased to provide our new web site for your to peruse. We are still adding more content but for the time being, you can get all the details of our stores with locations and contact details for all of our Just Crazy Bargains and Fair Dinkum Bargains stores.\n\nGive your closest store a call to find what you are looking for.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/suncorp-432359?child=753068", "employer_name": "Just Car Insurance", "employer_info": "\n\n"},
{"employer_url": "https://www.seek.com.au/companies/jwt-434669", "employer_name": "JWT", "employer_info": "J. Walter Thompson Company was founded in 1864 and has been making pioneering solutions that build enduring brands and business for more than 150 years. Today the company has evolved to include several global networks including J. Walter Thompson Worldwide, Mirum and Colloquial.\n\n\nSource: This is an extract from the company's own website"},
{"employer_url": "https://www.seek.com.au/companies/jcb-construction-equipment-australia-753385", "employer_name": "JCB Construction Equipment Australia", "employer_info": "Welcome to JCB Construction Equipment Australia\n\nWe are the proud Australian distributor for the globally renowned JCB brand of construction and agricultural equipment. At JCB Construction Equipment Australia, we distribute a comprehensive range of new and used JCB construction machinery, parts and equipment.\n\nWe have an extensive dealer network throughout Australia. We look forward to speaking with you.\n\nJCB reliability is second to none\n\nFor us it’s about bringing global industry expertise at a local level and giving our customers the assurance that wherever they are in the world, we are there and ready to support their needs.\n\nFind out how JCB can help your business by calling 1300 522 232 today. Or book an call back online here.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/just-better-care-433677", "employer_name": "Just better care", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/jurox-pty-814305", "employer_name": "Jurox Pty", "employer_info": "Jurox, Australia's most innovative veterinary pharmaceutical manufacturer, is nestled in the picturesque NSW Hunter Valley. Jurox believes success comes through high quality and superior formulation.\n\nOur dedication to customer service has proven to be a valuable asset to end-users, as word of mouth referral by veterinarians, breeders and rural sellers continues to grow. From this, Jurox has become a major player in the veterinary pharmaceuticals market and is rapidly becoming a well known name in the rural animal health market. Jurox now offers more than 120 proprietary veterinary and over-the counter lines to a diverse animal health market world-wide.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/just-auto-services-926983", "employer_name": "Just Auto Services", "employer_info": "Just Auto Service Centre\n\nOur experienced auto mechanics keep your car running safely and efficiently, specialising in servicing, maintenance and all repairs to late model cars, vans & light trucks.\n\nWhether you need a log book service, roadworthy certificate, tune-up, or mechanical or auto electrical repairs, Just Auto Service Centre are trusted experts with over 15 years experience in the auto industry.\n\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/just-cuts-433533", "employer_name": "Just Cuts", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/jurlique-435581", "employer_name": "Jurlique", "employer_info": "Jurlique founders, Dr Jurgen Klein and his wife Ulrike, had searched the world for the perfect place to create their pure and potent skin care. When they found the unspoiled Adelaide Hills in South Australia, they knew they had found Jurlique's natural home. 'Our vision was to formulate and manufacture the purest skin care products, based on the healing properties of nature...We did not follow a trend, we were trendsetters.'  \nSource: this is an extract from the company's own website"},
{"employer_url": "https://www.seek.com.au/companies/jurovich-surveying-926969", "employer_name": "Jurovich Surveying", "employer_info": "A market leading survey firm dedicated to providing professional surveying services to the construction and land development industries. With well trained, competent and professional surveyors and the latest state of the art equipment and techniques we can and will provide you with the best surveying services in the industry.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/the-star-432691?child=433483", "employer_name": "Jupiters Hotel and Casino", "employer_info": "THE STAR SYDNEY\nSYDNEY'S PREMIER CONFERENCE AND EVENT DESTINATION\n\nThe Star, Sydney’s premier conference and event destination offers three luxury hotel towers, a multi-purpose Event Centre, a grand selection of award-winning restaurants and bars, a nightclub, a luxury day spa, a designer shopping precinct and stunning city views. So whether it’s a cocktail party, conference, meeting, product launch, awards night or dinner, The Star can cater for all your event requirements.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/jurien-bay-health-centre-871091", "employer_name": "Jurien Bay Health Centre", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/juniper-806801", "employer_name": "Juniper", "employer_info": "About Juniper"},
{"employer_url": "https://www.seek.com.au/companies/juniper-networks-434718", "employer_name": "Juniper Networks", "employer_info": "We believe the network is the single greatest vehicle for knowledge, collaboration, and human advancement that the world has ever known. Now more than ever, the world relies on high-performance networks. And now more than ever, the world needs network innovation to unleash our full potential.\n\nThe network plays a central role in addressing the critical challenges we face as a global community. Consider the healthcare industry, where the network is the foundation for new models of mobile affordable care for underserved communities. Or the energy sector, where the network is helping to accelerate the distribution of clean, renewable sources of energy. In education, the network continues to expand access to quality teaching resources, so that people of every socioeconomic background have a chance to educate themselves and participate in the global economy. At its core, the network has become a platform—one that transforms how we interact with our government institutions, conduct business on a daily basis, and connect with our family and friends.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/jurien-bay-district-high-school-871090", "employer_name": "Jurien Bay District High School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/jungdranung-remote-community-school-871089", "employer_name": "Jungdranung Remote Community School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/jundah-state-school-820538", "employer_name": "Jundah State School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/jundah-primary-health-care-centre-821483", "employer_name": "Jundah Primary Health Care Centre", "employer_info": "Jundah provides nurse-led clinic facilities (Monday to Friday), ambulance services and 24-hours a day, seven days a week emergency on-call services.\nVisiting general practitioner services are provided by the Royal Flying Doctor Service (RFDS) every Wednesday.\nVisiting allied health services are provided by the Central and North Queensland Medicare Local based in Longreach, and the Central West Hospital and Health Service (HHS). Medical Local services provided include physiotherapy, podiatry, a dietician and a diabetic educator. Services provided by Central West HHS include occupational therapy, social work, dental and speech pathology.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/junction-youth-health-service-act-796128", "employer_name": "Junction Youth Health Service ACT", "employer_info": "The Junction Youth Health service is a free primary health care service that provides health services to people aged 12 to 25 years old (and their children), living in the ACT and surrounding region. All appointments at The Junction are bulk-billed to Medicare.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/junction-park-state-school-819831", "employer_name": "Junction Park State School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/junction-australia-813847", "employer_name": "Junction Australia", "employer_info": "Junction Australia is a trusted and leading independent provider of quality community support and housing services. We aim to strengthen lives and communities across Australia.\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/junction-hotel-437651", "employer_name": "Junction Hotel", "employer_info": "Welcome to the Junction Hotel!\nLocated at the intersection of High St & Plenty Rd, we are the ideal location to get together with friends, whether it be within the warm and inviting bistro for a delicious meal, or the Sportsbar for the coldest beer in Preston. We have something for everyone here at the Junction!\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/jumbunna-investments-926898", "employer_name": "Jumbunna Investments", "employer_info": "The Jumbunna Investment website provides a pathway to a number of organisations that Jumbunna Investments maintains either a commercial association or provides philanthropic support.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/jumbun-community-health-care-centre-821448", "employer_name": "Jumbun Community Health Care Centre", "employer_info": "Aboriginal and Torres Strait Islander Health\nAllied Health Assistance\nChild  and Family Health\nClinical Nurses\nDiabetes Education\nDietetics\nExercise Physiology\nHearing Health for Children\nHome and Community Care\nOccupational Therapy\nPharmacy\nPhysiotherapy\nPodiatry\nPsychology\nSocial Worker\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/julia-creek-state-school-819977", "employer_name": "Julia Creek State School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/julia-creek-hospital-821550", "employer_name": "Julia Creek Hospital", "employer_info": "Julia Creek Hospital transitioned to the McKinlay Shire Multi Purpose Health Service in 2012. The service is a Level 2 service as categorised by the Clinical Services Capability Framework.\n\nMcKinlay has a flexible bed capability with 10 beds for general medical and surgical, and simple paediatric admissions. There are also two residential aged care beds with capability of expanding to seven beds if required, as well as one palliative care bed.\n\nIn 2014, McKinlay received funding to upgrade the kitchen with modern facilities to better support the nutritional requirements of patients.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/julatten-state-school-820579", "employer_name": "Julatten State School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/jubilee-hotel-803422", "employer_name": "Jubilee Hotel", "employer_info": "PERFECT FOR MEDIUM SIZED FUNCTIONS FROM 40 TO 100 PEOPLE, THE COSMOPOLITAN BAR ENCAPSULATES ALL THAT IS THE JUBILEE HOTEL. PERFECTLY PAIRING THE OLD WITH THE NEW, THE BAR SHOWS OFF IT'S EXPOSED BRICK WALLS AND RESTORED FLOORING, ALONG WITH A BRAND NEW BAR AND AUDIO-VISUAL ELEMENTS.\n \nCOMPLETELY EQUIPPED WITH THE LATEST SMART TV'S, PRESENTATIONS ARE MADE SIMPLE WITH THE COMPLIMENTARY AV PROVIDED ALONGSIDE THE ROOM. THE COSMOPOLITAN BAR COMES COMPLETE WITH A LARGE BAR, AV ELEMENTS AND A PRIVATE SMOKING AREA. THE SECLUSION OF THE ROOM IS PERFECT FOR THOSE WANTING TO EXPERIENCE THE ATMOSPHERE OF THE VENUE, WHILE STILL MAINTAINING THE CONCEALMENT OF A PRIVATE ROOM.\n \nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/jtmec-electrical-contracting-753258", "employer_name": "JTMEC Electrical Contracting", "employer_info": "Powering mining and construction.\nJTMEC is committed to providing a diverse range of reliable, safe and innovative electrical services and products primarily to the mining and construction industries.\n\nThrough our competent and professional team we will help improve your productivity and safety performance.\n\nWe have the manpower, equipment, safety record and the experience to take on any electrical challenge the mining and construction industries throw at us.\n\nWe get in and just get it done with a minimum of fuss. Our reputation for delivering on time and on budget is proven, and is winning us contracts all over Australia.\n\nWhether you need electrical design and engineering, need to hire a substation, or bring in some skilled labour, JTMEC is ready, willing and able to help.\n\nSource: This is an extract from the company's own website"},
{"employer_url": "https://www.seek.com.au/companies/jr-duty-free-433572", "employer_name": "JR Duty Free", "employer_info": "JR/Duty Free offers world-class duty free and retail shopping, located in airports across Australia, New Zealand, Israel and Tahiti and in the city centre of the main capitals of Australia.\n\nExperience the convenience of finding everything you are looking for within one store; from luxury brands and designer fashion to an extensive range of beauty, fragrance, electronics, liquor products and wine.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/jt-mining-electrical-contracting-803421", "employer_name": "JT Mining Electrical Contracting", "employer_info": "Powering mining and construction.\n\nJTMEC is committed to providing a diverse range of reliable, safe and innovative electrical services and products primarily to the mining and construction industries.\n\nThrough our competent and professional team we will help improve your productivity and safety performance.\n\nWe have the manpower, equipment, safety record and the experience to take on any electrical challenge the mining and construction industries throw at us.\n\nWe get in and just get it done with a minimum of fuss. Our reputation for delivering on time and on budget is proven, and is winning us contracts all over Australia.\n\nWhether you need electrical design and engineering, need to hire a substation, or bring in some skilled labour, JTMEC is ready, willing and able to help.\nOur people are our strength.\n\nWe strongly believe that our people are our strength, and our business has grown by our reputation for being able to put the right people in the right place.\n\nWe employ over 110 people across Australia, and each person brings significant industry experience and a diverse array of skills.\n\nAlthough our people have vastly different and often specialised skillsets, they all share the same passion to succeed.\n\nOur goal is to exceed your expectations.\nSource: this is an extract from the company’s own website."},
{"employer_url": "https://www.seek.com.au/companies/jp-morgan-432786", "employer_name": "JP Morgan", "employer_info": "\"J.P. Morgan is one of the world’s leading investment banks with deep client relationships and broad product capabilities in Australia and New Zealand. As one of the few full-service and fully integrated investment banks in Australia, J.P. Morgan also provides commercial banking, asset management, treasury services and investor services. The firm’s offices are located in the financial centres of Sydney and Melbourne in Australia, and in Wellington, New Zealand.\n\nSource: this is an extract from the company's own website.\""},
{"employer_url": "https://www.seek.com.au/companies/jp-flynn-builders-814139", "employer_name": "JP Flynn Builders", "employer_info": "JP Flynn Builders began operations delivering maintenance and repair solutions to residential property management companies in the inner eastern suburbs of Melbourne.\n\nWe have grown to now service all Major Insurance Companies in Greater Metropolitan Melbourne and Regional Victoria areas.\n\nWe have the capability and processes in place to support our:\n\nFully resourced Project Management department,\n24/7 make safe service,\nHighly trained and trade qualified building estimating team and;\nFully equipped cabinetmaking and joinery workshop\nBeyond maintaining a commitment to quality, service and our core values, JP Flynn is constantly striving to supply new and innovative customer service levels to our partners and customers.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/joyce-palmer-health-service-821603", "employer_name": "Joyce Palmer Health Service", "employer_info": "Provides an integrated health service to approximately 3000 Palm Island people.\n\nThe facility is named after Joyce Palmer, a well known Island health worker who commenced her work back in the late 1940's at the Islands old grass hospital.  Joyce provided health care to the people of Palm Island for over 40 years until she retired in 1984 due to ill health.\n\nPalm Island Hospital\n\nConsists of an emergency department and a 15-bed general ward and provides a primary level of acute care services. These include: an emergency services component which manages resuscitation and stabilisation prior to referral to the secondary or tertiary hospital; general management of medical and aged patients; minor surgical procedures; outpatient clinics; basic radiography; pathology sample collection; antenatal and post natal care, with referral arrangements for all other categories. A number of visiting specialists conduct regular clinics with the facility.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/joyce-mayne-433987", "employer_name": "Joyce Mayne", "employer_info": "Joyce Mayne specialises in household and personal products, such as computers, home appliances, furniture, bedding, homewares and more. We have stores throughout New South Wales and Queensland regional areas. Check our Store Finder for the nearest Joyce Mayne to you.\n\nEach enterprise carrying on business under any name or style including the words \"Joyce Mayne\" other than from the website is operated by an independent franchisee pursuant to a franchise granted by another related body corporate of Joyce Mayne (\"Other Joyce Mayne Franchisee\"). Joyce Mayne Online is not related to Other Joyce Mayne Franchisees.\n\nEach Other Joyce Mayne Franchisee carries on business from a retail store located in a Joyce Mayne Complex, with complexes located throughout Australia. Other Joyce Mayne Franchisees do not offer any goods for sale on this website.\n\nThe Offer Goods may not be on show or available from Other Joyce Mayne Franchisees, and where the Offer Goods are available from an Other Joyce Mayne Franchisee, the price for the Offer Goods may vary from the Offer Price. If you wish to view the Offer Goods in person or enquire whether the Offer Goods are available to purchase from an Other Joyce Mayne Franchisee, you should ring 1300 JOYCE MAYNE (1300 569 236) before attending any Joyce Mayne complex to check to see if an Other Joyce Mayne Franchisee has the Offer Goods in store.\n\nEach Other Joyce Mayne Franchisee expressly do not represent that any item of Offer Goods will be offered by or available from any Other Joyce Mayne Franchisee at the Offer Price, or at all.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/joss-group-995236", "employer_name": "Joss Group", "employer_info": "Joss Group is a private company established in 1975 by husband and wife team Colin and Lorraine Joss. From its base in Albury NSW the company primarily specialised in construction management and the building of commercial and industrial projects.\n\nOver the years the company has experienced significant growth and successfully diversified into other industry streams including facility management, distribution, warehousing and property development.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/joy-foods-803410", "employer_name": "Joy Foods", "employer_info": "Humble Beginnings\nFrom small beginnings, our family business began making delicious foods, filled with nature’s wholesome goodness. 25 years on, it’s still about great tasting food and as we say, “It’s what’s inside that matters!”\n\nQuality Team And Recipes\nThe heart of our business is in the kitchen. We believe great ingredients and great taste are the key to every eating occasion. Our passionate foodies bring recipes to life in our kitchen and we’re always in search of the best ingredients for the perfect recipe.\n\nMade And Sold Locally\nWe’re proudly a family owned Australian business and we're delighted to share our latest creation with you and your family.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/jora-826949", "employer_name": "Jora", "employer_info": "au.jora.com is an Australia-based search engine for jobs. Unlike traditional job boards, users can search through thousands of career opportunities, all sourced from many job sites from around Australia. We understand that finding a job can be quite frustrating, so we aim to make the website as simple and as intuitive as possible.\n\nWe're working hard to ensure that you can find your dream job using our service. If you have any questions, please don't hesitate to send us your comments or new feature requests. We'll try to reply as soon as possible. After all, you are the reason why we have built this website.\n\nJora is proud to make job search easier all around the world."},
{"employer_url": "https://www.seek.com.au/companies/jordan-river-learning-federation-878084", "employer_name": "Jordan River Learning Federation", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/joondalup-youth-justice-service-875068", "employer_name": "Joondalup Youth Justice Service", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/joondalup-resort-803408", "employer_name": "Joondalup Resort", "employer_info": "Nestled amongst tranquil bushland, Joondalup Resort’s facilities offer a world away from your office where you can clear your mind and focus solely on your conference, function, meeting or special event.\n\nGain your delegates’ full attention by offering the ultimate corporate experience, without the hassles of hard-to-reach function rooms or extortionate parking fees. Arriving at Joondalup Resort gives the feeling of fully escaping the fast-paced stressors of the city, whilst still being close enough to accommodate those busy schedules.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/joondalup-primary-school-871078", "employer_name": "Joondalup Primary School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/joondalup-hospital-800174", "employer_name": "Joondalup hospital", "employer_info": "Welcome\nOn behalf of all the doctors and staff at Joondalup Health Campus, I am pleased to welcome you to our website.\n\nAt Joondalup Health Campus, we are growing with our community to provide excellent health care.\n\nWe are dedicated to providing high quality health care to the residents of Perth's northern suburbs.\n\nFollowing a major redevelopment funded primarily by the State Government and Ramsay Health Care, JHC has recently expanded from a 380-bed general hospital to a 664-bed sub-tertiary facility treating more than 67,000 patients annually.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/joondalup-health-campus-435410", "employer_name": "Joondalup Health Campus", "employer_info": "Welcome\nOn behalf of all the doctors and staff at Joondalup Health Campus, I am pleased to welcome you to our website.\n\nAt Joondalup Health Campus, we are growing with our community to provide excellent health care.\n\nWe are dedicated to providing high quality health care to the residents of Perth's northern suburbs.\n\nFollowing a major redevelopment funded primarily by the State Government and Ramsay Health Care, JHC has recently expanded from a 380-bed general hospital to a 664-bed sub-tertiary facility treating more than 67,000 patients annually.\n\nThe redevelopment delivered extensive new facilities for both public and private patients including a new Emergency Department, expanded Level 2B Special Care Nursery, 12 new operating theatres, a Coronary Catheter Lab, new Day Procedures Unit, and the 145-bed Joondalup Private Hospital.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/joondalup-education-support-centre-871077", "employer_name": "Joondalup Education Support Centre", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/joondalup-community-health-centre-795987", "employer_name": "Joondalup Community Health Centre", "employer_info": "Publicly reporting hospital performance data aims to empower clinicians, service providers, hospital and health system managers and others to drive improvements, and increase transparency and accountability within the health system.\n\nThe statistics presented on this website are the most up-to-date nationally consistent data available at the hospital level.\n\nIndividual states and territories may have more recent hospital statistics available, but they are not necessarily comparable between jurisdictions.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/joseph-banks-secondary-college-871079", "employer_name": "Joseph Banks Secondary College", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/jones-the-grocer-816749", "employer_name": "Jones the Grocer", "employer_info": "welcome to jones the grocer:\ngourmet food for everyday living\n we hope to welcome you into one of our 19 international stores soon. If you’d like to view our current cafe menus, please visit the cafe page or you can drop us a line to inquire about special events, masterclasses or current in store promotions by filling out our contact form below. \n\nSource: This is an extract from the company’s own website."},
{"employer_url": "https://www.seek.com.au/companies/jord-international-926751", "employer_name": "Jord International", "employer_info": "Jord has served the oil & gas, power and resource industries for over 40 years, with innovation, value and reliability. We are a privately owned firm that has grown steadily and organically, by solving unique problems with speed and personal service.  Jord custom designs, manufactures, commissions and services process plant and systems. This may be delivered as individual capital equipment or integrated into modular systems or complete turnkey plant.  Jord’s motto IDEAS ENGINEERED reflects our pursuit of creative technical solutions that are cost effective and dependable.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/jones-hill-state-school-819739", "employer_name": "Jones Hill State School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/jonday-holdings-814386", "employer_name": "Jonday Holdings", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/joy-global-433514", "employer_name": "Joy Global", "employer_info": "We are Global in more than just our name. We have presence and support capabilities for our customers in 20 countries and more than 130 locations. We can be found in the farthest reaches of the globe, wherever our customers are operating, positioned to partner with them and solve their toughest challenges. \n\nThe diversity of our geographic presence is reflected in our multicultural workforce. To be successful and continuously improve, our 15,000 employees collaborate closely with customers and colleagues across the globe, often making a significant impact in the most remote locations. We believe that the diversity of through and experience that Joy Global employees bring to their work enables us to be more innovative and creative as we work to meet our customers' needs. \n\nIn all our regions, employees have the opportunity to get involved in their community, providing tangible support and needed resources in the places where we live and work.                                                               Source: this is an extract from the company's own website"},
{"employer_url": "https://www.seek.com.au/companies/jonas-software-australia-926668", "employer_name": "Jonas Software Australia", "employer_info": "Jonas Software operates over 70 independently managed software companies around the world, providing them with the strategic guidance and financial security required to be leaders in their respective markets. With our roots formed in the Construction and Club Management markets, our reach has grown extensively within the Hospitality and Industrial verticals, and today we are proud to supply industry leading enterprise management software and related services to the following 17 vertical markets:\n\nHospitality\nClub Management\nFitness, Sports & Leisure\nFoodservice\nSalon\nAttractions\nEducation\nRetail\nCamps\nEvent Management\nHotels & Resorts\nIndustrial\nConstruction\nMoving & Storage\nMetal Service Centers\nRadiology/Laboratory Information Systems\nProduct Licensing\nPayment Processing\nDynamic Case Management\n\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/jtb-834454", "employer_name": "JTB", "employer_info": "JTB Travel – Australia’s Most Experienced and Trusted Japan Travel Providers\n\nWelcome to JTB Travel. Did you know that we’ve been providing Japan travel experiences to Australians since 1962? That’s over 50 years doing what we do best. Back then Australia still used pounds instead of dollars.\n\nIn fact, the JTB Group Japan has been providing Japan travel experiences since 1912. For the past 100 years, throughout the incredible ups and downs of the world we’ve been offering amazing travel experiences day in and day out for travellers like you. Today, JTB, a licensed travel agent, has 20 offices in Australia, New Zealand and Fiji providing jobs for around 600 people.\n\nWe have a very broad range of clients from families, couples, independent travellers, business and corporate and also people who are planning their first trip to Japan. \n\nTo find out more about what we have to offer, and how we can make your travel an experience you will treasure for always, take a look at our Japan Travel homepage or go to our Contact JTB page to get in touch. We look forward to being of service to you for your next Japan experience and around the world.\nSource: this is an extract from the company’s own website."},
{"employer_url": "https://www.seek.com.au/companies/jondaryan-state-school-819382", "employer_name": "Jondaryan State School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/jollibee-foods-corporation-806525", "employer_name": "Jollibee Foods Corporation", "employer_info": "Jollibee is the largest fast food chain in the Philippines, operating a nationwide network of over 750 stores. A dominant market leader in the Philippines, Jollibee enjoys the lion’s share of the local market that is more than all the other multinational brands combined. The company has also embarked on an aggressive international expansion plan in the USA, Vietnam, Hong Kong, Saudi Arabia, Qatar and Brunei, firmly establishing itself as a growing international QSR player.\n\nA company that values family\n\nJollibee was founded by Tony Tan and his family with its humble beginnings as an Ice Cream Parlor which later grew into an emerging global brand. At the heart of its success is a family-oriented approach to personnel management, making Jollibee one of the most admired employers in the region with an Employer of the Year Award from the Personnel Management Association of the Philippines, Best Employer in the Philippines Award from Hewitt Associated and a Top 20 Employer in Asia citation from the Asian Wall Street Journal. \n\nAside from promoting a family oriented work environment, the brand’s values also reflect on their advertising and marketing. Jollibee knows their target audience very well: the traditional family and all communication materials focus on the importance of family values, making Jollibee the number one family fast food chain in the Philippines and a growing international QSR player.\n\nA Well-Loved Brand \n\nCustomer satisfaction has always been key to Jollibee’s success. Never losing sight of its goals, Jollibee has grown to be one of the most recognized and highly preferred brands in the Philippines. Now the market leader among fast food chains in the Philippines, claiming a market share that totals to more than half of the entire industry. \n\nGreat tasting products and quality systems\n\nJollibee’s growth is due to its delicious menu line-up – like its superior-tasting Chickenjoy, mouth-watering Yumburger and Champ hamburger, and deliciously satisfying Jollibee Spaghetti -ably complemented with creative marketing programs, and efficient manufacturing and logistics facilities. It is made possible by well-trained teams that work in a culture of integrity and humility, fun and family-like. Every Jollibee outlet welcomes customers with a clean and warm in-store environment and friendly and efficient service. \n\nAnd it is this tried and tested formula of delivering great-tasting food, adherence to world class operating standards and the universal appeal of the family values the brand represents that are driving the expansion of Jollibee both locally and in the overseas market.\n\nWidest store network in the Philippines and an emerging global player\n\nJollibee is the largest fast food chain in the Philippines, operating a nationwide network of more than 750 stores. A dominant market leader in the Philippines, Jollibee enjoys the lion’s share of the local market that is more than all the other multinational brands combined. The company has also embarked on an aggressive international expansion plan, and currently has 80 stores outside the Philippines-USA (26), Vietnam (32), Brunei (11), Jeddah (7), Qatar, Hong Kong, and Kuwait (1 each), firmly establishing itself as a growing international QSR player. \n\nClick on the link for the list of stores\nPhilippines\nInternational\n\nA Triumph for and of the Filipino and a source of Filipino pride.\n\nJollibee dedicated its continuous success to the Filipinos who have been there from the very start.\n\nJollibee is so well-loved everytime a new store opens, especially overseas, Filipinos always form long lines to the store. It is more than home for them. It is a stronghold of heritage and monument of Filipino pride.\nSource: this is an extract from the company’s own website."},
{"employer_url": "https://www.seek.com.au/companies/jolimont-primary-school-871076", "employer_name": "Jolimont Primary School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/johnson-village-services-926595", "employer_name": "Johnson Village Services", "employer_info": "The township of Leigh Creek is located 567km North of Adelaide, approximately a 6 hour drive from the CBD. Situated on the edge of the Northern Flinders Ranges, Leigh Creek is the perfect destination for visitors seeking a variety of activities and experiences!\n\nIt has been developed as a new township because the original settlement at Leigh Creek, located 13 km north of the present site, happened to be under the coal seam. In 1977 the new town site was chosen and by 1980 the first houses were occupied. The entire old town was auctioned off. Such is the economic imperative which drives this community.\n\n It is a modern township with a series of neat modern roads and small, attractive plots of land on which standard modern houses had been built to house the workers and their families who previously provided the labour force for the huge Leigh Creek open cut coal mine which exists 22 km north of the town.\n\nThe Leigh Creek area was first settled by Harry Leigh (after whom the town and creek are named) in 1856. Coal was discovered in 1888 and small quantities were mined, but it wasn't until the 1943 that the fields were commercially exploited. By 1986 100 million cubic metres of overburden had been removed from the mine site.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/johnson-and-johnson-medical-753257", "employer_name": "Johnson & Johnson Medical", "employer_info": "Caring for the world, one person at a time, inspires and unites the people of Johnson & Johnson. We embrace innovation—bringing ideas, products and services to life to advance the health and well-being of people around the world. We believe in collaboration, and that has led to breakthrough after breakthrough, from medical miracles that have changed lives, to the simple consumer products that make every day a little better. Our over 125,000 employees in 60 countries are united in a common mission: To help people everywhere live longer, healthier, happier lives. \nSource: This is an extract from the company's own website"},
{"employer_url": "https://www.seek.com.au/companies/johnson-controls-433313", "employer_name": "Johnson Controls", "employer_info": "Johnson Controls is a global diversified technology and industrial leader serving customers in more than 150 countries. Our 130,000 employees create quality products, services and solutionsto optimize energy and operational efficiencies of buildings; lead-acid automotive batteries and advanced batteries for hybrid and electric vehicles; and seating components and systems for automobiles. Our commitment to sustainability dates back to our roots in 1885, with the invention of the first electric room thermostat. Through our growth strategies and by increasing market share we are committed to delivering value to shareholders and making our customers successful.  \n\n?Source: this is an extract from the company’s own website"},
{"employer_url": "https://www.seek.com.au/companies/johnson-and-johnson-433399", "employer_name": "Johnson & Johnson", "employer_info": "About Johnson & Johnson\nCaring for the world, one person at a time, inspires and unites the people of Johnson & Johnson. We embrace innovation—bringing ideas, products and services to life to advance the health and well-being of people around the world. We believe in collaboration, and that has led to breakthrough after breakthrough, from medical miracles that have changed lives, to the simple consumer products that make every day a little better. Our over 125,000 employees in 60 countries are united in a common mission: To help people everywhere live longer, healthier, happier lives.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/johns-lyng-group-435856", "employer_name": "Johns Lyng Group", "employer_info": "Our team of building Supervisors, Estimators and Technicians are available 24/7.\n \nWe constantly exceed building quality standards, meaning great outcomes for our clients. We ensure the right people, with the correct technical skills, are deployed immediately.\n \nJohns Lyng Group has the capability to deliver emergency building works across all sectors, including fire / flood damaged structures affected by natural disasters.\n \nOur teams offer the flexibility to deliver small and large loss building works, with a successful outcome as our main priority every time.\n\nSource: This is an extract from the company’s own website."},
{"employer_url": "https://www.seek.com.au/companies/johnny-bigg-by-tarocash-834482", "employer_name": "Johnny Bigg by Tarocash", "employer_info": "Johnny Bigg by Tarocash was created with the bigger, taller guy in mind. Recognising our guys desire to be well dressed. Johnny Bigg provides him with a one stop shop. Launching initially with an online store we have since opened the doors in New South Wales, Victoria, Queensland, South Australia and Western Australia. Johnny Bigg is dedicated to providing a fashionable diverse and affordable product range for the bigger guy who wants to looks smart when stepping out. \n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/john-wollaston-anglican-community-school-926634", "employer_name": "John Wollaston Anglican Community School", "employer_info": "An Anglican Archdeacon born on 28 March 1791 in London, John Wollaston enjoyed the greater part of his life as a village priest in England \n\nHe was schooled at Charterhouse, where his father, Edward Wollaston, was a Master and his maternal grandfather, Headmaster, and at Christ's College, Cambridge (B.A., 1812; M.A., 1815). Having taken holy orders, he married Mary Amelia May in 1819, the youngest daughter of Colonel George Gledstones. They had five sons and two daughters.\n\nFinding the income from his time at West Wickham, Cambridgeshire, insufficient for his growing family, he applied in 1840 for the position of Chaplain to the Western Australian Land Company's proposed settlement at Australind.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/john-xxiii-college-800165", "employer_name": "John XXIII College", "employer_info": "I extend to you a very warm welcome to the John XXIII College website where we offer you a glimpse of what our College has to offer for your child's education. Here you can find out about the values and philosophy that form the foundation of our curriculum and John XXIII College's approach to education.\nWe offer a co-educational learning environment where all our students (Pre-Kindergarten to Year 12) are supported, on an individual basis, to reach their goals - both academically and in their personal and spiritual development. At John XXIII College we are passionate about nurturing young minds and bringing out the best in our students.\n\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/john-willcock-college-871073", "employer_name": "John Willcock College", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/john-sands-435786", "employer_name": "John Sands", "employer_info": "John Sands is a leading manufacturer of innovative social expression products.\n \nTo help consumers connect and celebrate their relationships in a way that truly reflects themselves, John Sands offers an extensive product line including greeting cards, gift-wrap, stationery and calendars. \nJohn Sands licenses popular character brands and designs through partnerships with well-known character brands and numerous European design studios. John Sands offers the very best product from around the world to Australia and New Zealand. \nSource: this is an extract from the company’s own website"},
{"employer_url": "https://www.seek.com.au/companies/john-paul-village-816748", "employer_name": "John Paul Village", "employer_info": "John Paul Village is a Catholic Retirement Village that incorporates a residential aged care facility. It was opened in 1985 and remains an active part of the Catholic Parish of St John Bosco Engadine, under the inspiration of the Salesians of Don Bosco. John Paul Village provides caring services to the residents and to older or disabled people as an expression of Cristian love and concern for people, irrespective of race, creed or colour.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/john-tonkin-college-800163", "employer_name": "John Tonkin College", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/john-paul-college-daisy-hill-434472", "employer_name": "John Paul College Daisy Hill", "employer_info": "There is a deep sense of pride in wearing the burgundy and blue for all who are part of the John Paul College family.\nBuilt by the community for the community, our values are defined in our school motto Unity, Christ, Learning, and remain as strong today as they were when we first opened in 1982.\nAs one of Queensland’s largest and most progressive  independent, co-educational schools, we have a reputation for producing outstanding citizens who have the confidence to take on the world.\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/john-page-motors-926542", "employer_name": "John Page Motors", "employer_info": "John Page Motors have been proudly supporting the Caboolture District since May 1977.We are a regional dealer in a semi-rural area on the northern outskirts of Brisbane, at the southern end of the Sunshine Coast.\n\nJohn Page Motors provide the latest range of New Nissan motor vehicles, including the tireless Patrol and Navara workhorses, and the exciting and high-performing 370Z. Our dealership also sells John Deere Agricultural tractors and Grounds Care equipment.\n\nAt John Page Motors we pride ourselves on our customer satisfaction and are always working on ways to improve our customer's ownership experience. We employ 30 full-time staff with parts and service departments staffed by factory-trained professionals. Our senior technicians have many years’ experience between them. We have strong Used Vehicle and equipment departments with a good range of locally owned and serviced vehicles and machines. With the rural sector in mind we also handle a large range of implements and sprayers for almost every application, as well as generators and petrol and diesel engines from 3.75 to 400HP.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/john-law-real-estate-800160", "employer_name": "John Law Real Estate", "employer_info": "Achieving record sales with superior results for the past 8 year in Cabramtta, Canley Vale, Canley Heights, Cecil Hills, Greenfield Park, Bossley Park, Prairiewood, Wetherill Park, Fairfield, Fairfield Heights, Fairfield West, Liverppol, Casula, Prestons, West Hoxton, Yagoona, Sefton, Bass Hill, Bankstown & Greenacre and Queensland. We have a proven commitment and dedication to our clients and a highly successful long service history to our area. At John Law REAL ESTATE our multi-award winning staff, are trained to assist and advise you with all your real estate needs & Enquiry. \nSource: this is an extract from the company’s own website."},
{"employer_url": "https://www.seek.com.au/companies/john-hughes-group-434934", "employer_name": "John Hughes Group", "employer_info": "The John Hughes Group employs approximately 560 people and sells over 1700 new and used vehicles every month with an annual turnover of $550 million. The Company has diversified into many peripheral areas in the automotive industry, it has its own Insurance Company, its own Finance Company, a Finance Broking operation, underwrites its own extended warranties, is in the tyre and battery business provides its own roadside assistance, has twelve mobile service vans, and has its own fleet of trucks to transport vehicles to and from the varied locations.\n\nFor a number of years John Hughes was a director of Channel 9 in Perth and Burswood Management Limited, the Company operating the casino complex in Western Australia.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/john-holland-group-432569", "employer_name": "John Holland Group", "employer_info": "\n\n"},
{"employer_url": "https://www.seek.com.au/companies/john-deere-financial-753213", "employer_name": "John Deere Financial", "employer_info": "Living up to a legacy isn't always easy. Especially when that legacy encompasses nearly 175 years of quality products, innovative solutions and honest value.  John Deere's heritage of achievement lives on in every employee, every product, and in every way we touch and enrich lives. It's a commitment that distinguishes us in the marketplace and drives us toward even higher levels of performance.\n\nCareer opportunities – get where you want to go\n\nIf you have a strong work ethic, a passion for excellence and a creative mind, unleash your potential with an employer that can provide all you need to succeed. At John Deere, you can create and enjoy a fulfilling career with the freedom to explore new projects, the support to think outside the box, and the help of advanced tools and technology so necessary for innovation and achievement. With our excellent training and developmental opportunities, you can advance your career as fast and as far as your ambition, skills and competencies allow.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/john-forrest-secondary-college-871065", "employer_name": "John Forrest Secondary College", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/john-deere-434417", "employer_name": "John Deere", "employer_info": "If you have a strong work ethic, a passion for excellence and a creative mind, unleash your potential with an employer that can provide all you need to succeed. At John Deere, you can create and enjoy a fulfilling career with the freedom to explore new projects, the support to think outside the box, and the help of advanced tools and technology so necessary for innovation and achievement. With our excellent training and developmental opportunities, you can advance your career as fast and as far as your ambition, skills and competencies allow.\n\nOur culture is inclusive and dynamic. We actively seek employee input to help improve policies and procedures while maintaining our strong leadership position. At John Deere, diversity goes beyond culture to include diversity of ideas, disciplines, perspectives, and styles.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/john-crane-australia-926452", "employer_name": "John Crane Australia", "employer_info": "John Crane has a strong legacy that dates back to the creation of the Crane Packing Company in 1917. Prior to World War II, the company’s England-based operations were sold to Tube Investments, which resulted in the creation of TI Group. Then in 1987, TI Group acquired the remaining regional operations and the company reunited as John Crane — named after one of the company’s original founders. In 2000, TI Group merged with Smiths Industries to become Smiths Group plc, a global technology company based in London. Today, John Crane is the largest subsidiary of Smiths Group plc.\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/john-butler-primary-college-871062", "employer_name": "John Butler Primary College", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/john-blair-motor-sales-926431", "employer_name": "John Blair Motor Sales", "employer_info": "John Blair Honda is part of the John Blair Motor Group, a privately owned retail business that has been established since 1975.\nThroughout its history, the John Blair Group has built a reputation as a pre-eminent Dealer across a number of brands, receiving awards in Sales, Service and overall Dealer Excellence.\nDrawing upon this legacy, John Blair Honda is able to embrace the core values that have been fundamental to the overall success of the Group; it’s People, Professional and Integrity, Passion, Innovation, and Service Excellence.\nThese Core Values are the foundation principles that John Blair Honda stands for, not for their competitive value or their contribution to its success, but because they represent what the Dealership truly believes in, and how it conducts itself.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/john-cootes-furniture-800154", "employer_name": "John Cootes Furniture", "employer_info": "John Cootes Furniture has been servicing Greater Sydney for all their Furniture needs over the past 30 years. Over the last 20 years we have ventured into the Penrith and Tuggerah markets with full force.\nJohn Cootes Furniture is an Australian owned and operated business and is family run. We pride ourselves in having the best value for money and the most competitive furniture prices in Sydney.\nWe are dedicated to keeping you, the customer, at the forefront of every decision we make.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/john-batman-group-867953", "employer_name": "John Batman Group", "employer_info": "John Batman Group is a family owned and operated company established in 1963 in Melbourne, Australia.\n\nNamed after this city’s founder, John Batman Group has a long running track record in consistently setting and meeting high standards and values.\n\nJohn Batman Group supplies a vast array of Tourism & Hospitality products and services to all sectors of the accommodation and hospitality industry including hotels, motels, resorts, serviced apartments, B&B’s, holiday parks, healthcare, aged care, clubs, pubs, cafes and restaurants.\n\nJohn Batman Group has grown rapidly over the years and has continued to expand and develop the 2 streams of the business:\n1.Print & Publications \n2.Hospitality Products\n\nOur main client base currently stretches across Australia, New Zealand and the South Pacific.  Our success has always been based around delivering excellent service to our customers. Never complacent, John Batman Group has become a company acknowledged for personal commitment and proactive solutions. The John Batman Group team is made up of skilled professionals with years of experience in their fields, incorporating a variety of professions from sales, marketing, administration, graphic artists and skilled craftspeople. As a leading supplier to the hospitality industry, John Batman Group takes great pride in the products and services it provides.  Our extensive product portfolio of commercial products are designed and produced specifically to cater for the unique needs of the hospitality industry.\n\nAll of the John Batman Group products are proudly designed and/or produced in Australia.\n Providing a variety of product solutions and supply essentials to suit any style and budget, our product range offers the perfect mix of quality, luxury and affordability.\nSource: This is an extract from the company's own website"},
{"employer_url": "https://www.seek.com.au/companies/jobsupport-926372", "employer_name": "Jobsupport", "employer_info": "Jobsupport’s mission is to place, train and maintain as many people with a significant intellectual disability as possible into quality jobs in the regular workforce that meet both their employment needs and the needs of the employer.\nJobsupport delivers its mission through two programs:\n\n \n\n1.    Jobsupport’s Open Employment service places people with an intellectual disability into paid jobs in the regular workforce. \n\n2.    Jobsupport’s Transition service, which was previously called Community Work Options. Jobsupport Transition gives school leavers with an intellectual disability extra help before they attempt paid employment, by providing them with successful work experience and by addressing issues that are preventing their acceptance by an open employment service.  \nSource: This is an extract from the company's own website"},
{"employer_url": "https://www.seek.com.au/companies/jobs-in-school-hours-813517", "employer_name": "Jobs In School Hours", "employer_info": "Jobs In School Hours provides an opportunity for mums who are looking for a work life balance.  We offer part time work, typically during school hours. You are paid for every minute you work and have the opportunity to represent national and global companies.  With over 15 years of experience we provide training, user friendly CRM and extremely supportive managers, ensuring you will love your job.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/joblink-plus-436198", "employer_name": "Joblink plus", "employer_info": "Joblink Plus was formed over 30 years ago by a group of citizens overseeing the Australian Government’s Community Youth Support Scheme initiative that operated from a modest establishment in Marius Street in Tamworth. \n \nBeginning as a shopfront for business services, it provided resume services and employment advice for those who needed assistance to gain employment.\n \nThe organisation then evolved into Tamworth and District Training Services. It was during this time that the organisation was directly involved in major projects to contribute to the wider Tamworth community , such as various Skillshare initiatives.\n\nSource: This is an extract from the company's own website"},
{"employer_url": "https://www.seek.com.au/companies/jobadder-796735", "employer_name": "JobAdder", "employer_info": "\n\n"},
{"employer_url": "https://www.seek.com.au/companies/job-centre-australia-437037", "employer_name": "Job Centre Australia", "employer_info": "Job Centre Australia Limited is a not-for profit community-based organisation that has provided services to people with a disability through State and Federal Government funding for 25 years.\n\nWe specialise in empowering people with a disability, illness or health condition to improve their circumstances through a range of training, support and employment opportunities.\n\nOur vision: To enhance our client’s quality of life by developing their potential.\n\nOur mission: Empowering people for tomorrow’s opportunities.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/jmc-academy-435409", "employer_name": "JMC Academy", "employer_info": "Established in 1982 by John Martin Cass, JMC Academy was originally founded in Sydney to meet the demand for qualified professionals in the entertainment technology industry. From day one, JMC Academy broke ground as Australia's first private college to qualify for accreditation in the fields of Audio Engineering, Digital Television and Digital Multimedia.\n\nCelebrating almost 35 years of education, JMC Academy remains Australia’s leading Creative Industries institution, offering Degrees and Diplomas in Music, Songwriting, Audio Engineering, Film and Television Production, Entertainment Business Management, Digital Design, 3D Animation and Game Design.\n\nWith advanced-design campuses, ongoing technology upgrades, a dedicated team of academics and industry professionals, and a network of international master class lecturers, JMC Academy is committed to ensuring our graduates make their own indelible mark on industry.  \n\nJMC Academy’s ultimate focus is to deliver inspiring and technologically sophisticated programs, which cater to the global needs of the Creative industries. By nurturing, supporting and mentoring students who share a true passion and dedication for these industries, we are able to guide them into rewarding careers.\n\nSource: this is an extract from the company’s own website"},
{"employer_url": "https://www.seek.com.au/companies/job-prospects-435969", "employer_name": "Job Prospects", "employer_info": "Job Prospects is a leading jobactive and Disability Employment Services – Employment Support Service (DES-ESS) provider that works with jobseekers to gain and sustain employment and with employers to recruit and maintain their workforce.  Job Prospects provided services to more than 47,700 people of all ages last year"},
{"employer_url": "https://www.seek.com.au/companies/jll-432553", "employer_name": "JLL", "employer_info": "We’re a pretty big real estate company, a Fortune 500 company actually, with about 80,000 experts in over 80 countries all over the world. We’ve been around for nearly 250 years and have worked on some of the biggest deals and real estate projects in the world. But when it comes to real estate, we don’t just think about measurement in square feet, or achievement as signing a lease agreement. At JLL, we go beyond that. We look for ambition. We discover the things our clients want to achieve. And of course, the things our people want to achieve.\nWe work with some impressive clients, from all kinds of industries; from tech startups to big global firms. We work with people who buy, build, occupy and invest in industrial, commercial, retail, residential and hotel real estate. "},
{"employer_url": "https://www.seek.com.au/companies/jlg-industries-814909", "employer_name": "JLG Industries", "employer_info": "JLG Industries, Inc. has been earning customer confidence and trust through innovation since 1969. Our customers are our greatest priority, and we remain steadfast in our commitment to understanding their challenges.\n\nAs the world’s leading designer and manufacturer of access equipment, JLG products and personnel can be found all over the world, going above and beyond to support customers. We deliver the powerful, versatile equipment that they need, along with unsurpassed training and service, because we have a responsibility to be more than a manufacturing company. We are a partner in our customers’ success, reaching out worldwide to enable performance, boost productivity, ensure uptime and support forward progress.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/jj-richards-434312", "employer_name": "JJ Richards", "employer_info": "J.J. Richards & Sons Pty Ltd is a proudly Australian owned and operated family business that has been providing innovative waste management solutions throughout Australia since 1932.\nThe Company has grown to be Australia's largest privately owned waste management company through its philosophy of safety, reliability and excellence in customer service.\nOur commitment to establish and maintain a close, productive working relationship with our customers ensures we provide the most efficient and cost effective service possible.\nThis commitment has been the basis of our continued growth and development into the 21st century.                                                                           Source: this is an extract from the company's own website"},
{"employer_url": "https://www.seek.com.au/companies/jindi-cheese-926279", "employer_name": "Jindi Cheese", "employer_info": "Jindi Cheese was founded in 1985 by the Ronalds family and is located in the beautiful dairy district surrounding Jindivick in West Gippsland. Hidden away on a winding country laneway called Old Telegraph Road, the factory produced its first white mould cheese in 1986 using the highest quality milk from cows grazing on the area's renowned lush grassland. Since opening, Jindi has enjoyed domestic and international recognition and has grown to become a leading specialty cheese manufacturer.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/jindalee-state-school-819460", "employer_name": "Jindalee State School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/jingili-primary-school-988187", "employer_name": "Jingili Primary School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/jinibara-state-school-819866", "employer_name": "Jinibara State School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/jindalee-aged-care-residence-800150", "employer_name": "Jindalee Aged Care Residence", "employer_info": "Are you looking for a career in aged care? Or are you already an experienced aged care professional looking for a fresh start in a new facility?\n\nAged care workers make an invaluable contribution to the daily lives of many thousands of people across Australia.\n\nThe staff at Jindalee are resident focused and deliver the highest quality of care. Whilst working together as a team to achieve this, they are also able to work independently when required. If you believe you have what it takes to become a part of the Jindalee team, please fill out the form below to begin the application process with Jindalee.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/jims-skip-bins-926261", "employer_name": "Jims Skip Bins", "employer_info": "Jim Penman started Jim’s Mowing in Melbourne, Australia in 1982 whilst studying for a doctorate in history. From a modest beginning, initially starting with the idea of making “a few dollars” by mowing other people’s lawns, Jim’s has grown into the world’s largest lawn mowing franchise. A commitment to customer service and excellence saw this business grow at a rapid rate with more customers than one person could effectively manage, leading Jim to commence franchising in 1989. The Jim’s Mowing system proved successful enough to be duplicated across many other industries, with the Group establishing Jim’s divisions for all manner of household and business services between 1994 and the present day.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/jims-mowing-433777", "employer_name": "Jims Mowing", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/jims-car-cleaning-brisbane-926254", "employer_name": "Jims Car Cleaning Brisbane", "employer_info": "We’d love to hear from you! Get in touch with us today. \n\nOnce we have received your query or feedback, a member of our team is going to be in touch with you.\n\nFor a free quote, please click the below service you require:\n\nGeneral Cleaning Quote Car Cleaning Quote Window Cleaning Quote Carpet Cleaning Quote Blinds Cleaning Quote Pressure Cleaning Quote\nYou Can Reach Us At\n\nD5/1-13 The Gateway,‎ Broadmeadows VIC 3047\n\nFor any enquiries regarding complaints, commendations, and national deals, contact us via phone or email - we're here to help. \nPhone: 131 546\nWeb: www.JimsCleaning.net.au\n\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/jimbour-state-school-820096", "employer_name": "Jimbour State School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/jimboomba-state-school-819684", "employer_name": "Jimboomba State School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/jimbelunga-nursing-centre-926225", "employer_name": "Jimbelunga Nursing Centre", "employer_info": "Jimbelunga has been providing an extensive range of aged health care and support services in the community since November 1994.\n\nPlace of Friendship\nJimbelunga Nursing Centre comes under the Auspices of the Aboriginal and Torres Strait Islander Community Health Service Brisbane Ltd.\nJimbelunga was established to meet the Cultural and Spiritual needs of Aboriginal and Torres Strait Islander people.\nHowever, we are very proud of the fact that the facility currently caters for the wide range of people from other cultures and the wider community.\nThe Hon. Mary Crawford officially opened Jimbelunga in 1994.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/jigsaw-strategic-research-438650", "employer_name": "Jigsaw Strategic Research", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/jilkminggan-school-988186", "employer_name": "Jilkminggan School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/jigsaw-436839", "employer_name": "Jigsaw", "employer_info": "What we do\n\nLearning Links works in collaboration with schools, early childhood settings and parents to help children with learning disabilities and difficulties.\n\nThese include conditions such as ADHD, high functioning Autism, Dyslexia, Dyscalculia, fine and gross motor delays and speech and language delays. The children are often anxious, have trouble communicating and interacting with others, and many have behavioural issues. In the later years they are often challenged in literacy, numeracy and impacting on their ability to complete education and participate in the community.\n\nEarly intervention for young children who experience developmental delays is critical to mitigate the risk of poor educational outcomes later in life. Learning Links is recognised as a pioneer in the area of inclusive early childhood education. At our inclusive preschool, children of all abilities learn side by side, maximising their learning abilities and wellbeing as they progress to primary school.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/jigsaw-sales-group-438098", "employer_name": "Jigsaw Sales Group", "employer_info": "Jigsaw Sales Group is an award winning outsourced sales and marketing company contracted to build awareness, revenue and the customer base for some of the most recognised brands in the country. \n\nOur face-to-face approach to direct marketing and sales provides a professional yet personal experience, with a measurable, effective approach to advertising that delivers results without breaking your bottom line.  \nWith financial demands on not-for-profits organisations and sporting clubs, Jigsaw’s methods can provide you with a guaranteed return on investment. \n\nOur team of face-to-face sales specialists can provide the public face your organisation needs to get your figures back into the black and keep them there.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/jigalong-remote-community-school-871055", "employer_name": "Jigalong Remote Community School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/john-curtin-college-of-the-arts-800157", "employer_name": "John Curtin College of the Arts", "employer_info": "With an outstanding record of achievement both academically and in the Arts, John Curtin hosts a range of exciting opportunities for your child to thrive in our unique learning environment.\n\nAs Western Australia’s only Selective Arts College, John Curtin College of the Arts caters for over 1500 students from across the State offering gifted and talented courses in media arts, dance (ballet and contemporary), drama, music, music theatre and visual arts.\n\nWith four decades of experience in gifted and talented education, the college is renowned for delivering quality arts programs and a specialised differentiated curriculum. This provides an exciting approach to learning through specialised and innovative teaching that supports high academic performance.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/jo-mercer-436293", "employer_name": "Jo Mercer", "employer_info": "In recent years the brand has flourished with the decision to inject new talent in both the management and product design teams resulting in a stable and consistent brand vision.\n\nIn November 2010 it was this vision that saw the business change name to Jo Mercer and ultimately steer the brand in a new direction with a fresher and undeniably contemporary approach to both store fit-outs and shoe designs.\n\nThough the evolution of the brand has been a dynamic one, Jo Mercer continues to capture the essence of years past with exceptional quality and superior craftsmanship while still evoking the minds of the fashion conscious.\n\nAs always, outstanding customer service remains at the forefront of the brand’s values and through dedicated staff training and development Jo Mercer promises a memorable shopping experience every time.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/jewish-care-435068", "employer_name": "Jewish Care", "employer_info": "Jewish Care is the first choice for aged care and community services for Jewish people in Melbourne and throughout Victoria. Whether you seek personal support or you require help for a loved one, Jewish Care is here for your every need with services such as residential and community aged care, healthy ageing activities and therapies, home help, counselling, disability services, financial aid and support, employment and education. We offer real choices, coupled with the highest quality care and support, now and for generations to come.\nclaims The Claims Conference negotiates for compensation payments and aid to victims of Nazi persecution and for the return of and restitution for Jewish-owned property. Jewish Care Victoria acknowledges the support and generous funding provided by the Claims Conference. This enables us to care for our ageing Holocaust survivors and support them to remain at home in dignity and independently.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/jg-king-homes-803356", "employer_name": "JG King Homes", "employer_info": "At the heart of the JG King Building Group is our homes business unit which constructs high quality residential housing throughout Victoria and into southern NSW. JG King Homes head office is in Ballarat, with offices and display homes in Melbourne and throughout regional Victoria.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/jetstar-airways-432848", "employer_name": "Jetstar Airways", "employer_info": "Jetstar Airways forms an integral part of the Qantas Group's two-brand strategy, operating in the leisure and value-based market. Jetstar Airways Pty Limited is a wholly owned subsidiary of the Qantas Group, with its Australian low fare operations first commencing in May 2004.Jetstar operates across 19 Australian domestic destinations and 17 short and long haul overseas destinations. Jetstar's Australian and New Zealand based fleet comprises more than 80 aircraft. Jetstar Airways is currently the third largest airline (by domestic market share) and a top five international airline by capacity share, serving international routes to and from Australia. \nSource: this is an extract from the company's own website"},
{"employer_url": "https://www.seek.com.au/companies/jet-pets-animal-transport-813950", "employer_name": "Jet Pets Animal Transport", "employer_info": "Jetpets was founded in 1991 by Sandy Matheson, who after gaining years of experience in the airline industry, and a lifetime as an animal lover, saw the need for a pet travel agency focused on the safety, comfort and welfare of pets.\n\nJetpets is a testament to Sandy’s original vision, safely and comfortably transporting thousands of pets around the globe every year. With a team of expert Pet Travel Consultants, Pet Handlers and Vets to make this possible. With investments in state of the art facilities including fleet, transit lounges etc. It’s little wonder our clients choose to fly with Jetpets again and again and refer us to others.\n\nJetpets is widely regarded as Australia’s trusted pet travel experts. Built on a company culture based around pet loving, professional and friendly customer service.\n\nJetpets is proud of the contribution it has made to the industry and looks forward to continuing serving our many customers’ needs each and every day.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/jetcrete-437327", "employer_name": "Jetcrete", "employer_info": "Jetcrete owns and operates a fleet of specialised equipment at various sites throughout Australia.  All equipment is fitted with the best safety systems available and is compliant with the highest underground specifications used in the mining industry.\n\nUsing our 28 years of experience with spraying in both the civil and mining industries, Jetcrete now has proven capabilities for all elements of the shotcrete process.\n\nDrawing on over 35 years experience with spraying in both the civil and mining industries;  with a work force of over 150 personnel and having a modern fleet of plant, Jetcrete now has the proven capabilities for all elements of the shotcrete process. This includes capabilities for batching, delivery and application in any condition or location.\n\nSource: this is an extract from the company’s own website"},
{"employer_url": "https://www.seek.com.au/companies/jet-engineering-803335", "employer_name": "Jet Engineering", "employer_info": "Jet Engineering was formed in 2006 by two workmates with an impressive track record of 35 years combined experience in the mining industry and a shared passion for problem solving. In the years they worked together, Shayne Ritchings and Tony Hutchinson realised they had a winning combination with complementary design, project management and manufacturing skills along with inside knowledge of the practicalities of design and manufacturing for mine sites.\n\nTony and Shayne identified a gap in the market for a small, quality focused, engineering fabrication shop that handled projects from concept through to design, manufacture and installation.\nSource: this is an extract from the company’s own website"},
{"employer_url": "https://www.seek.com.au/companies/jets-transport-express-753219", "employer_name": "JETS Transport Express", "employer_info": "JETS Transport Express is Australia's road feeder service of choice for the international air cargo industry. Our uniquely designed trailers feature airride suspension, a retractable lift deck capable of lifting a 5,000 kilogram ULD, lockable double hinged rear doors and retractable air rollers which make us your ideal choice for sensitive, valuable and awkwardly shaped airfreight.  \n\nSource: This is an extract from the company's own website"},
{"employer_url": "https://www.seek.com.au/companies/jet-couriers-435680", "employer_name": "Jet Couriers", "employer_info": "At Jet Couriers we strive to provide Point- to- Point courier services you can count on. We are ready and available to pick-up and deliver 365 days a year, 24 hours a day.\n\nOperating from multiple control centres, we boast an all modern fleet of radio controlled vans and tray trucks. Our uniformed drivers deliver statewide.\n\nWhen you want efficient, professional service, you can confidently depend on Jet Couriers!\n\nJet Couriers was formed in 1989. The company aims to provide quality courier and transport services at a competitive price. A strategy of controlled growth and diversification only into kindred fields of service has seen.\nJet Couriers become a major identity in the Metropolitan Distribution Industry.\n\nCompanies within the Jet Couriers group are encouraged to keep their own local identities whilst being part of an interdependent service support group.\n\nJet Couriers staff and drivers in all states have a wealth of experience in the courier industry, and share a commitment to service excellence that has brought outstanding success to the group. The combined fleet provides clients with a delivery system, which offers the widest range of delivery options, with the greatest possible flexibility, while at the same time being cost effective.\n"},
{"employer_url": "https://www.seek.com.au/companies/jet-airways-436007", "employer_name": "Jet Airways", "employer_info": "Welcome aboard Jet Airways, India's premier international airline which provides you with one of the finest experiences across the skies. Our high standards of service and reliability, efficient operations and focus on innovation has enabled us become one of India's favourite domestic and international airline. \nJet Airways has received an extensive range of awards and commendations for every kind of service it provides. Our efficiency and quality of the highest standards in every sphere of service has earned us a prestigious Superbrand status.  \nTo be amongst the most innovative and admired brands, renowned for service excellence.\n\nCorporate Mission\n\nJet Airways will be renowned for reaching out to all our guests with a heart-warming spirit that is our unique Indian hospitality.\n\nWe will delight our guests with genuine care and personalised quality service, along with consistent, reliable and efficient operations.\n\nWe will innovate and deliver service excellence, setting standards for competition to emulate.\n\nJet Airways will be the most sought after place to work.\n\nJet Airways will achieve these objectives whilst simultaneously ensuring sustainable profitability for all stakeholders.\n\n\nSource: This is an extract from the company's own website"},
{"employer_url": "https://www.seek.com.au/companies/jessie-mcpherson-private-hospital-800142", "employer_name": "Jessie McPherson Private Hospital", "employer_info": "From a church hall to a tertiary care facility\n\nJessie McPherson Private Hospital is a 106 bed tertiary level Private Hospital which has been co-located at Monash Medical Centre Clayton since 1987.   Our co – location with Monash Health provides a unique opportunity for access to world-renowned research and teaching facilities.\n\nJessie McPherson Private Hospital also has a wider official specialist role for greater Melbourne, regional Victoria and interstate in such specialties as cardiology, cardiothoracic surgery, neuro-surgery, gastro-surgical high acuity maternity and neonatal services. \n\nJessie McPherson Private Hospital is known for providing quality private health care to the people of Melbourne, regional Victoria, interstate and overseas.\n\nWith almost 80 years experience, we pride ourselves on providing exceptional care for our patients. Our team is committed to continuing this tradition of care: we have highly skilled staff and are equipped with some of the most modern and advanced medical facilities in Victoria.\n\n \n\nWe are a modest facility that provides exceptional care. As one of only a few private hospitals to provide tertiary level services in the state we have preferred provider agreement status with most health funds. Patient out of pocket expenses are significantly less than most other private hospitals.\n\n \n\nWe offer our patients complete care in one location and ensure they stay with us for their full recovery period. \n \n \n\n \n \n\n Our values\n\n      At Jessie McPherson we work together with:\n◾Integrity\n by acting fairly, honestly and openly\n  \n◾Compassion\n as we interact with dignity and empathy\n  \n◾Accountability\n to take ownership and responsibility for performance\n  \n◾Respect\n as we value difference and individual worth; and\n  \n◾Excellence\n as we aim for and recognise innovation, quality and professionalism.\nSource: this is an extract from the company’s own website."},
{"employer_url": "https://www.seek.com.au/companies/jesuit-social-services-814524", "employer_name": "Jesuit Social Services", "employer_info": "Our vision\nBuilding a just society.\n\nOur mission\nStanding in solidarity with those in need.\n\nExpressing a faith that promotes justice.\n\nOur values\nIn all we do, we strive to be welcoming, discerning and courageous.\n\nWelcoming – forming strong, faithful relationships\nDiscerning – being reflective and strategic in all we do\nCourageous – standing up boldly to effect change\nThese values guide how we run our programs, how we work with each other, how we run our organisation, and how we work with our external partners.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/jimmy-possum-furniture-814059", "employer_name": "Jimmy Possum Furniture", "employer_info": "ICONIC AUSTRALIAN BUSINESS JIMMY POSSUM TO RETIRE\n \nAfter two successful decades in business, Margot and Alan Spalding have made the difficult decision to retire JIMMY POSSUM.\n \nJIMMY POSSUM’s six retail stores in Bendigo, Melbourne, Sydney, Canberra, Brisbane and online will take their final customer orders on Sunday, June 5th while the factory in Bendigo will remain open to produce the final pieces of JIMMY POSSUM furniture ever to be made.\n \nThe next three weeks will be the final opportunity for people to order their own unique and iconic piece of JIMMY POSSUM furniture. So if you’ve ever thought you’d love a JIMMY POSSUM piece – now is the time to make it happen.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/jervis-bay-primary-871051", "employer_name": "Jervis Bay Primary", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/jervis-bay-preschool-871050", "employer_name": "Jervis Bay Preschool", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/jervis-bay-court-796138", "employer_name": "Jervis Bay Court", "employer_info": "Complaints and Feedback\nAlthough the Jervis Bay Territory is not geographically a part of the Australian Capital Territory the laws of the Territory apply to Jervis Bay by virtue of the Jervis Bay Acceptance Act 1915 (Cth) - so far as they are applicable and providing that they are not inconsistent with an Ordinance made for the Territory.\n\nEach court of the ACT has jurisdiction in and in relation to Jervis Bay as if it formed part of the ACT.\n\nThe Magistrates Court sits at Jervis Bay on a regular basis.\n\nThe Jervis Bay Court may be contacted through the Jervis Bay Administration Office on (02) 4442 1217. Office hours are 8:30 am to 5:00 pm, Monday to Friday. \nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/jerramungup-health-centre-871048", "employer_name": "Jerramungup Health Centre", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/jericho-state-school-819975", "employer_name": "Jericho State School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/jerramungup-district-high-school-871047", "employer_name": "Jerramungup District High School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/jericho-community-clinic-821482", "employer_name": "Jericho Community Clinic", "employer_info": "The Jericho Bush Nursing Service was transferred to the Central West Hospital and Health Service in April 2013 and has now been integrated with other health clinics. The service acknowledges the assistance of Anglicare in transferring the service and the support of the local community that has donated equipment and supplies.\n\nThe outpatient clinic is open three days a week from Wednesday to Friday and is in the process of being expanded to four days a week—potentially five days a week in the future.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/jensens-market-supplies-926063", "employer_name": "Jensens Market Supplies", "employer_info": "Jensens Market Supplies is a private family owned company categorised under the wholesale of Fruits and Vegetables.\n\nAt Jensens our number one goal is our customers satisfaction. We go to enormous lengths to find and deliver the best, freshest fruits and vegetables. We pride ourselves on delivering an extensive variety of high quality produce to our customers exactly when and where they want it.\n\nWe have a wide customer base comprising of: Hotel groups, Restaurants, Retail concepts, Event caterers, Contract caterers, Business and Industry groups, Independent caterers, Third-party foodservice suppliers, Schools and colleges, Offices, Hospitals, Pub groups, Bars, Health clubs, and we intend to continue providing a wide range of produce to our growing customer-base, while maintaining a strong reputation for quality produce, punctual delivery and a service tailored to the needs of each individual customer.\n\nAt Jensens we strongly believe that the customers should be as informed as possible and so we are always on hand to lend an ear and talk to our customers. Do not hesitate to Contact us Today! You can call our office number anytime (24/7).\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/jerdacuttup-primary-school-871041", "employer_name": "Jerdacuttup Primary School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/surf-dive-n-ski-435057?child=434192", "employer_name": "Jetty Surf", "employer_info": "Having started in 1964, Surf Dive ‘n Ski have seen over 86 stores open Australia wide over the past 50 years. Surf Dive ‘n Ski stock the leading brands for surf, skate, street and snow in Australia and pride ourselves on exceptional customer service and product knowledge. Our authenticity is in our DNA, sponsoring Australia’s best athletes in surf, skate and snow, supporting high profile action sport events as well as grass roots competitions. Roll in to one of our stores, or get shopping online and join the tribe. We have the best styles from your favorite brands including Billabong, RVCA, Element, Volcom, Rusty, Rip Curl, Nixon, Von Zipper, Tigerlily, Seafolly, Havaianas, Vans, Hurley, Converse and many more!"},
{"employer_url": "https://www.seek.com.au/companies/jaycar-electronics-433087", "employer_name": "Jaycar Electronics", "employer_info": "Jaycar Electronics is a leading Specialist Electronics Retailer with a store network of 120 stores across Australian and NZ and growing, with the Jaycar Electronics and Road Tech Marine brands. We are a large privately owned group experiencing significant growth as a result of a dynamic business culture and innovative product range. We are one of Australia’s largest privately owned retailers with a 30 year track record of success and a core purpose: Affordable technology to make it, enhance it and use it."},
{"employer_url": "https://www.seek.com.au/companies/jaybro-814839", "employer_name": "Jaybro", "employer_info": "As a company we have changed a lot since we began in 1996, however our foundational values remain the same.\nWe manufacture, import and distribute safety and environmental products to construction contractors, utilities, mining, manufacturing and local government across Australia\n\nOur products ensure your safety - DONE\nFast, reliable deliveries, our drivers know our business and know your needs. They go the extra mile to ensure your delivery is on time, every time.\n\nWe move fast to get results - DONE\n\nOur strong reputation has been built on the fact that we deliver to customer orders completed.\n\nWe are the civil supply experts - DONE\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/jensen-property-926062", "employer_name": "Jensen Property", "employer_info": "At Jensen Property we stand together, our team of  sales agents, exceptional property managers and very talented  admin support believing in excellence from the ground up.\nOur philosophy is built on strong team ethics, a determination to deliver and maintain a better quality service to our clients. That’s our commitment to you.\nThere are so many exciting challenges as technology speeds forth and continues to change the face of real estate. We are enjoying these new directions and opportunities.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/jayline-distributors-925905", "employer_name": "Jayline Distributors", "employer_info": "WELCOME TO JAYLINE\nJayline is a South Australian based distribution company. We are proud to supply commercial markets with green sustainable cleaning chemicals and washroom solutions that will save you money.\n\n\nDownload an order form\n\nDownload and fill in the PDF or Excel order form, then send it back us via email to place your order -  sales@jaylinedistributors.com.au\npdf order form\nexcel order form\nDownload our product catalogue\n\nproduct catalogue thumb\nWHY USE JAYLINE\nAndrew Rosser, Business Director at St Peter’s Girls’ School\n\nSt Peter’s Girls’ has been a client of Jayline Distributors for the past year. The school loves the environmentally safe products and the green message works well with their students. They are really happy with Jayline’s service and enjoy the customer relationship they have with us.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/jb-hi-fi-432377", "employer_name": "JB Hi-Fi", "employer_info": "JB Hi-Fi was established in 1974 by Mr. John Barbuto (JB), trading from a single store in East Keilor, Victoria. He had one simple philosophy: to deliver a specialist range of Hi-Fi and recorded music at Australia's lowest prices. JB stores offer the world's leading brands of Computers, Tablets, TVs, Cameras, Hi-Fi, Speakers, Car Sound, Home Theatre, Portable Audio and stacks more. JB Hi-Fi also offers the largest range of games, recorded music, DVD music + Blu-Ray and DVD movies and TV shows, all at cheap prices! Everything you are after is available in one of our stores or online.\n\nSource: this is an extract from the company’s own website."},
{"employer_url": "https://www.seek.com.au/companies/jayco-corporation-436030", "employer_name": "Jayco Corporation", "employer_info": "Australia’s most recognised brand for quality and affordable recreational vehicles, Jayco is a great success story of Australian manufacturing. Employing over 1,000 Australians, Jayco continues as a locally owned family business.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/jay-jays-432938", "employer_name": "Jay Jays", "employer_info": "At Jay Jays we're all about having a good time and not taking life too seriously. We turn the music up loud and live life in your favourite tees, tanks and sweats, paired back with denim and essentials that every wardrobe needs.\n\nWhether you're on a road trip to the beach, huddled around a campfire, headed to a festival or just chillin' with friends, save your pennies on an outfit because we've got you sorted with the best ever range of denim, the raddest print tees, the cutest dresses, basics to throw on and the perfect accessories!\n\nYou will find new styles dropping all the time in 200+ locations across Australia and New Zealand, as well as online 24/7.\n\nTo get involved, use #JayJays on\n\nFacebook: /jayjays;\nInstagram: @jayjays;\nTwitter: @jayjays_au; and\nJoin us on e-mail to hear all about our sweet offers and receive 10% off next time you’re in-store!\n\nRemember to have fun and #ownit!\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/java-dale-815039", "employer_name": "Java Dale", "employer_info": "Java Dale owns both  Anzac Lodge Nursing Home and Bethel Aged Care.  \n Established in 2009, Bethel Aged Care is a 121 bed residential aged care facility offering a various levels of care as well as the option for extra services. Bethel Aged Care is in a league of its own, rivaling many upmarket hotels in terms of finishings and class whilst retaining the feeling of home. \n\nBethel Aged Care is operated by a team of professionals from diverse backgrounds, such as nursing and medical, all of whom have an active interest in the daily running of the facility. The proprietors have over 20 years of aged care management experience between them and take a very hands.  \nFirst established in 1997, with several extensions and renovations later, Anzac Lodge now offers 120 residential aged care beds. Anzac Lodge is all about recreating the feeling of home. The cosy and friendly atmosphere is the standout remark most often made by visitors. Whilst we are a multi cultural facility, we have a large percentage of residents for from an Italian background. Accordingly, we have recruited several staff who speak Italian and also run Italian classes for many of our staff.   \nOur aim is to set the standard in the region for aged care in providing the best possible level of care to our residents in a homely and supportive environment. We believe that a holistic approach towards aged care is essential and to be culturally appropriate in delivering this care.  \nSource: this is an extract from the company’s own website."},
{"employer_url": "https://www.seek.com.au/companies/jasper-hotel-801759", "employer_name": "Jasper Hotel", "employer_info": "WELCOME TO JASPER HOTEL IN THE MELBOURNE CBD\nPerfectly located on Elizabeth Street in Melbourne's thriving Market Precinct, the vibrant, newly refurbished Jasper Hotel is a full-service boutique hotel offering 90 contemporary rooms and suites with free Wi-Fi, casual dining options at Jasper Kitchen and extensive conference and meeting facilities.\nIn the heart of the Melbourne CBD and part of the Free Tram Zone, our 4-star hotel offers unmatched access to city transport options, shopping destinations, sporting and cultural facilities. Nearby landmarks include Queen Victoria Market, Royal Children’s and Women’s Hospitals, Melbourne University and RMIT.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/jason-windows-436427", "employer_name": "Jason Windows", "employer_info": "Jason Windows has been supplying quality products to the WA building industry for over fifty years.  The company pioneered the introduction of aluminium windows and doors in WA in the early sixties and has continued to be the benchmark in product design, strength and service ever since. WAs leading builders specify Jason Windows in their homes with many of them entrusting their window and door supply, installation and service exclusively to Jason for decades.\n\n \nOur residential product range caters to all markets and budgets from first home buyers through to premium homes.  We understand a new home reflects an owners dreams and are committed to providing the best possible solution to make these dreams an affordable reality. With the widest range of products and colours in the market, your choices will only be limited by your imagination. \n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/jax-tyres-436728", "employer_name": "JAX Tyres", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/jasper-coffee-814019", "employer_name": "Jasper Coffee", "employer_info": "Jasper Coffee is an Australian family owned Specialty Coffee Roaster established in 1989, led by Directors Merilyn Parker and Wells Trenfield.\n\nWith deep roots in the art world, coffee has become our palette. We are dedicated to re-humanizing the coffee supply chain, and have formed strong friendships across the Coffee world in our exploration and adventure into the unknown.\n\nWe hold in stock Australia’s largest selection of Single Origin beans, Blends, Fairtrade, Organic & Specialty Coffees. We accept into our repertoire only those beans with distinctions of flavour, body, and aroma that satisfy our palate.\n\nWe continually strive to better partner with our coffee growers, through initiatives such as Fairtrade, the Cafe Femenino Project, and helping farmers with the Yirgacheffe Kochore Project in Ethiopia, in partnership with World Vision Australia.\n\nSustainability has always shaped how we do business. We keep this in mind through all decisions we make. This has manifested in our Certifications for Organic, Fairtrade and Carbon Neutral, along with our search for Shade Grown coffees, the cleaning products we use, the cars we drive, the compostable packaging, and the economic and social benefits we direct to producers.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/jasol-753216", "employer_name": "Jasol", "employer_info": "Established in 1934, Jasol is a respected market leader in the Cleaning & Hygiene Solutions industry, spanning more than 80 years of experience in chemical manufacture in Australasia.\n\nJasol support and serve a wide range of sectors from Hospitality to Healthcare, Dairy, Food & Beverage, Water Treatment, Retail Food, Government/Institutional and Industrial & Mining, with offices across Australia, New Zealand and Thailand.\n\nAs a team, we make it our business to know your business, with a collaborative passionate approach, and an unbridled commitment to deliver exceptional service combined with the right chemical offering, highlighting the importance of hygiene safety in all that we do.\n\nGiven the depth and breadth of our knowledge, resulting from our heritage, we’re passionate to develop innovative new cleaning & hygiene solutions as well as create new technologies for any situation. Combined with the most comprehensive product range (saving time and money) for the best possible outcome for our customers.\n\nSource: This is an extract from the company's own website"},
{"employer_url": "https://www.seek.com.au/companies/jat-refrigerated-road-services-861100", "employer_name": "JAT Refrigerated Road Services", "employer_info": "Integrity and customer service have been the cornerstone of our success and a key part of the customer focused culture that is instilled in all of our staff today. JAT has established a close working relationship with national food companies and food service providers Australia wide. We deliver freight for our clients directly and compliment this relationship by being the preferred transport choice for a large percentage of their national free into store clients. \n\nWith a modern fleet of 45 trucks and over 70 trailers JAT provides its customers with a fast, efficient cost effective transport and storage solution. All our trailers are satellite linked enabling us to track and monitor the cold chain compliance of all the freight we ship and data loggers enable us to download the individual history of each trailer movement. \nSource: this is an extract from the company’s own website."},
{"employer_url": "https://www.seek.com.au/companies/jasco-consulting-813681", "employer_name": "Jasco Consulting", "employer_info": "JASCO Consulting is a leading network solutions provider to Australian industry and government with a commitment to enterprise-class principles and innovative thinking.\n\nJASCO as Telstra Business Partner of the Year 2015 and a multi award winning Microsoft Gold partner, has for 17 years has been delivering results for its customers of all sizes. With a broad range of experience and customer engagements Jasco has the capabilities to deliver the highest quality service for your business.   \n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/jarvisfield-state-school-820406", "employer_name": "Jarvisfield State School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/jarvis-814440", "employer_name": "Jarvis", "employer_info": "Jarvis is a people driven company, focused on providing an environment which creates loyal, satisfied customer and staff\n\nTo find out more about Jarvis, visit:  jarviscars.com.au/employment/"},
{"employer_url": "https://www.seek.com.au/companies/jarvie-engineering-801755", "employer_name": "Jarvie Engineering", "employer_info": "Jarvie Engineering Pty Ltd is a member of the Swanson Industries group of companies, founded in Newcastle in 1952 by Bruce Jarvie.\n\nThe company was originally a general repetition engineering workshop.\n\nOver the years staff levels have increased to over 135 people, staff skills have been upgraded, and new technologies have been adopted in response to customers' changing engineering needs both in Australia and overseas. \n\nAs an established leader in hydraulic and pneumatic cylinder manufacturing and repairing, Swanson Industries Jarvie Engineering has an enviable track record in servicing underground and open-cut coal mining clients.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/japara-healthcare-995238", "employer_name": "Japara Healthcare", "employer_info": "Japara Healthcare is one of Australia’s largest private sector enterprises in the aged care and retirement industry and is listed on the Australian Securities Exchange.\n\nOur core objective is to provide the best available quality of life for the elderly population of Australia.\n\nAn overview of our Group follows:\n\nWe own and operate 43 residential aged care facilities and 5 retirement complexes throughout Victoria, Queensland, South Australia, NSW and Tasmania\nWe help maintain the independence and dignity of our residents and provide the best possible lifestyle and service options to them\nWe care for around 4,000 residents, offering a variety of living arrangements, amenities, services, meal plans, social activities and care options\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/jardine-lloyd-thompson-434274", "employer_name": "Jardine Lloyd Thompson", "employer_info": "Jardine Lloyd Thompson (JLT) is a leading global provider of insurance, reinsurance and employee benefits related advice, brokerage and associated services.\n\nJLT’s client proposition is built upon its deep specialist knowledge, client advocacy, tailored advice and service excellence. Together, we place our clients first, champion innovative thinking and expect to be judged based on our results.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/jantex-industries-815069", "employer_name": "Jantex Industries", "employer_info": "\"Our ultimate goal is to supply customers with great products that last and provide real value for money\"\n\nJantex is an innovative company that supplies specialized, high quality products to businesses that are small, medium, or large.\n\n\n\nWe supply two dinstinctive product ranges. one being printer/fax/copier consumables, and the other being commercial cleaning products.\n\nOur products are specifically designed and manufactured to be of the highest quality and most cost effective on the market today.\n\nWe understand what businesses need and our ultimate goal is to supply customers with great products that last and provide real value for money.\n\nWe deliver Australia wide in a prompt and efficient manner.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/jarrahdale-primary-school-871032", "employer_name": "Jarrahdale Primary School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/janssen-pharmaceuticals-753255", "employer_name": "Janssen Pharmaceuticals", "employer_info": "Our ultimate goal is to help people live healthy lives. We have produced and marketed many first-in-class prescription medications and are poised to serve the broad needs of the healthcare market – from patients to practitioners, from clinics to hospitals. \nJanssen Pharmaceuticals, Inc., offers challenging opportunities for those interested in pursuing a career within one of the world’s leading healthcare corporations, Johnson & Johnson. Positions often are available in a number of disciplines, such as Medical Affairs, Marketing, Sales, and Business Analytics. \nWe believe our first responsibility is to the doctors, nurses and patients, to mothers and fathers and all others who use our products and services. In meeting their needs everything we do must be of high quality. We must constantly strive to reduce our costs in order to maintain reasonable prices. \nSource: This is an extract from the company's own website"},
{"employer_url": "https://www.seek.com.au/companies/jani-king-435000", "employer_name": "Jani King", "employer_info": "WELCOME TO JANI-KING\n\nThe most trusted team in commercial cleaning\n\nFor the past two decades, there has only been one name to turn to for quality and value in commercial cleaning services; Jani-King, The King of Clean.\nThe largest and most successful commercial cleaning franchise in Australia and New Zealand, Jani-King is always striving for excellence.\nOur committed team looks after the specific needs of thousands of organisations. From Perth through to Sydney, Christchurch to Auckland Jani-King has become synonymous with quality, professionalism and satisfaction.\nLearn why more businesses are making the move to Jani-King by contacting one of our friendly representatives to discuss all your cleaning needs.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/janison-925717", "employer_name": "Janison", "employer_info": "We pride ourselves on working in close partnership with our clients. We provide the most innovative, leading-edge solutions and world-class content to help you deliver engaging and enjoyable learning experiences for your learners, bottom-line business benefits for your organisation, and measurable improvements to the delivery of your learning and assessment strategies. \nYou will have peace of mind that our Learning Management and Online Assessment systems are built upon the most robust and secure technologies available and that our Software-as-a-Service (SaaS) model will provide you with the ultimate flexibility and cost-effective deployment. And because we own all of the Intellectual Property, we have complete control over system developments to ensure your system design is tailored to your unique needs.\n\nOur clients tell us that we provide unparalleled service and support. That’s because we are a dedicated team, passionate about improving the delivery of learning and we care. We invest in delivering best-in-class solutions, together with total commitment to meeting your needs and those of your learners.\n\nWe will go the extra mile. Every time. For Janison, it’s personal. Our relationships with our Clients and Partners are what drives our business. Your success is our success. \nSource: This is an extract from the company's own website"},
{"employer_url": "https://www.seek.com.au/companies/jands-861239", "employer_name": "Jands", "employer_info": "Jands is an Australian owned company founded in 1970. The company manufactures and distributes the world’s most recognised brands of Audio, Lighting and Staging products primarily for the entertainment and exhibition industry. With headquarters and manufacturing facilities in Sydney, a factory in Melbourne and offices in Brisbane and Perth, Jands employs over 120 people across Australia. \nJands branded lighting dimmers and control consoles are exported worldwide, are found in some of the most prestigious international venues and are used by a large number of high profile international touring artists.\n\nJands Staging division designs and manufactures complete solutions for modern theatres and presentation spaces.\n\nJands distribution arm represents the best of professional audio and lighting products selected from the world’s most renowned suppliers\nSource: this is an extract from the company’s own website."},
{"employer_url": "https://www.seek.com.au/companies/jandowae-hospital-821497", "employer_name": "Jandowae Hospital", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/jandakot-primary-school-871029", "employer_name": "Jandakot Primary School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/jandowae-prep-10-state-school-820530", "employer_name": "Jandowae Prep-10 State School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/jan-de-nul-435679", "employer_name": "Jan de Nul", "employer_info": "People and global expertise. These are the corner stones of Jan De Nul Group’s success. Thanks to its skilled employees and the world’s most modern fleet, Jan De Nul Group is a leading expert in dredging and marine construction activities, as well as in specialized services for the offshore industry of oil, gas and renewable energy. These core marine activities are further enhanced by Jan De Nul Group's in-house civil and environmental capabilities offering clients a complete package solution.\n\nOur professional and innovative solutions are trusted across the industry. Whether it concerns the construction of the new locks in the Panama Canal or a new port complex in Western Australia, together with our customers, we build for further economic development.\n\nSource: this is an extract from the company’s own website"},
{"employer_url": "https://www.seek.com.au/companies/jamies-italian-436292", "employer_name": "Jamie's Italian", "employer_info": "Jamie’s Italian was founded in Oxford in 2008. Since then it has grown to more than 40 restaurants worldwide, and there are already plans for even more in towns, counties and countries around the world. But that’s not even half the story... \nJamie’s Italian is inspired by Jamie’s passion for the Italian way of life:\n\n“Since I was a teenager I’ve been totally besotted by the love, passion and verve for food, family and life itself that just about all Italian people have, no matter where they’re from or how rich or poor they might be. And that’s what I’m passionate about – good food for everyone, no matter what… But the thing I love most about the Italians is that somehow, although they have some of the best fashion designers and cars in the world, they’ve managed to retain a unique sense of tradition and village spirit”.\nSource: This is an extract from the company's own website"},
{"employer_url": "https://www.seek.com.au/companies/james-pascoe-group-753008", "employer_name": "James Pascoe Group", "employer_info": "Established in 1906 by James Pascoe, a fully qualified jeweller, Pascoes the Jewellers has gradually expanded from one store in Auckland to 38 stores nationwide.\n\nContinually looking at opportunities for expansion, the Australian owned Prouds jewellery chain was purchased in 1996. Now with over 230 stores, Prouds The Jewellers is recognised as one of the leading national jewellery brands in the Australian market.\n\nPascoes the Jewellers stock the largest range of jewellery and watches in New Zealand and together with over a hundred years of jewellery experience and dedicated excellence to customer service, Pascoes the Jewellers continues to be the leading name in jewellery in New Zealand.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/james-nash-state-high-school-819902", "employer_name": "James Nash State High School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/jettys-restaurant-800146", "employer_name": "Jetty's Restaurant", "employer_info": "Come try one of our famous pizzas which are famous all over the state for quality and freshness – we also love to pile on the toppings! \nSome facts about Jetty’s products –\n\nWe only used 100% chicken breast on all our pizzas.\n\nAs of November, our chicken schnitzels are 100% chicken breast, prepared in house.\n\nWe use Prawns, not shrimp – expect big prawns on all our pizza’s\n\nGluten Free Pizza bases available\n\n34 Pizzas to choose from and the list is growing\n\nPremium products across the board – we emphasis quality\n\nJetty’s is now under new – or should we say, old – management, with Bahaa and Sam now operating the store once again, with the aim of bringing it back to the same standard as when Sam was the operator some six years ago.\n\nWhether you are after coffee, meals, ice cream, pizza’s, take away, delivery or dine in, Jetty’s is the place to bring your family!  \nJetty’s Restaurant is a beach side restaurant located just 150 meters from Rosebud Jetty, in the beautiful setting of the Mornington Peninsula.\n We specialise in Italian cuisine and are famous for pizzas and our made to order meals.\n Jetty’s Restaurant is a family owned business and we are proud to support local organisations. \nSource: This is an extract from the company's own website"},
{"employer_url": "https://www.seek.com.au/companies/james-frizelles-automotive-813375", "employer_name": "James Frizelles Automotive", "employer_info": "Few people know that James Frizelle, the founder of James Frizelles Automotive Group, started his working life as a mechanic in Sydney. Over 30 years later, the family owned business is still driven by James and his son Brett.\nJames Frizelles Automotive Group was first established in 1985 and today is proud to be one of the largest and most trustworthy Motor Dealers in Queensland, with over 650 staff across six locations and selling over 15,000 new and used vehicles each year.\nWhile there have been many changes in the motor industry over the past few decades, the values at James Frizelles Automotive Group havent changed.\nSince the Group was first established, we have focused on retaining our dedication to industry leading customer service, whilst continuing and growing our commitment to support the local community in a large capacity. Located in Southport, Nerang, Robina, Tweed Heads South, Lismore and Springwood; James Frizelles commitment to preserve friendly Old fashioned Service has underpinned our position as a Dealer of Choice since 1985.\n\nSource: This is an extract from the company’s own website."},
{"employer_url": "https://www.seek.com.au/companies/james-hardie-435121", "employer_name": "James Hardie", "employer_info": "James Hardie® building products provide a complete solution for creating well-designed homes. They are available in numerous profiles and finishes for a range of interior and exterior building applications. The products work well on their own or in unison with one another, so you can incorporate single or multiple products in a design.\n\nThe products are used extensively in new residential construction, manufactured housing, repair and remodelling, as well as a variety of commercial and industrial applications. \n\nThe product range suits a wide palette of architectural styles, from classic and traditional to ultra-modern and contemporary designs. The  cladding products also look great in combination with many traditional building materials such as stone, wood and brick making design potential boundless!\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/james-milson-village-925616", "employer_name": "James Milson Village", "employer_info": "Welcome to James Milson Village\nThe James Milson Retirement Village is located at 4 Clark Road, North Sydney (corner of High Street and Clark Road). The harbour breeze, proximity to all forms of public transport and an easy stroll to local shops, banks, cafes and parks all make the location of the Village ideal for retirement years.\n\nOur Motto\nProviding commitment, respect, care & support\n\nMission\nJames Milson Village provides a caring ministry for the ageing in our local community. We offer quality care and support for each person as an individual with integrity, commitment and respect.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/james-cook-university-432669", "employer_name": "James Cook University", "employer_info": "One of the world's leading institutions focusing on the tropics, Australia's James Cook University is surrounded by the spectacular ecosystems of the rainforests of the Wet tropics, the dry savannahs, and the iconic Great Barrier Reef. The organisation's unique location enables students from Australia and overseas to study in a diverse physical environment unparalleled by any university in the world. Ranked in the top four percent of the world's tertiary institutions by the respected Academic Ranking of World Universities produced by the Shanghai Jiao Tong University, James Cook University is dedicated to creating a brighter future for life in the tropics world-wide, through graduates and discoveries that make a difference.                                                     Source: this is an extract from the company's own website"},
{"employer_url": "https://www.seek.com.au/companies/jamboree-heights-state-school-819374", "employer_name": "Jamboree Heights State School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/james-an-coaching-college-806522", "employer_name": "James An Coaching College", "employer_info": "James An College provides the opportunity for talented students to achieve their personal best in academic excellence. \nOver the past twenty years, James An College has acquired a strong reputation for producing outstanding results in Selective High School Placement Tests, Scholarship Exams, O.C. Tests, the School Certificate and the HSC. \nJames An College's success rate has been the result of consistent development of educational materials and teaching methods.\n\nToday there are over 40 James An College branches in Australia, with 27 in Sydney alone.\nJames An College is rapidly expanding throughout Australia and plans to further expand globally.\n\nJames An College provides the best HSC Tuition, NSW Year 6 Selective High School Placement Test Tuition, Year 4 Opportunity Class (O. C.) Test Tuition, VCE Tuition, QCS Tuition, Secondary School Tuition, Primary School Tuition and Scholarship Test Tuition in Australia.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/jambin-state-school-819759", "employer_name": "Jambin State School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/jamberoo-resort-925551", "employer_name": "Jamberoo Resort", "employer_info": "Jamberoo Resort is your new private escape for conferences, events, weddings & family fun\nThe resort was fully renovated in 2014 and now offers top quality accommodation and impressive facilities for leisure travellers along with extensive and flexible space for private weddings and corporate events.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/jam-prospects-434972", "employer_name": "Jam Prospects", "employer_info": "Jam Prospects is an energetic and thriving Sports Marketing Company, which was established in 1994 in Melbourne, Australia, created to promote awareness and showcase the numerous acclaimed and branded sporting clients, it works on behalf of.\nJam Prospects has demonstrated capability and specialty\nin customer acquisition.\n\nWe are market leaders and innovators of face-to-face marketing. We have represented a variety of clients from sporting clubs and Not-for-profit organisations, where we provide a memorable experience that will endure to have a lasting positive impact on our client’s brand.\n\nWATCH THIS SPACE FOR MORE OPPORTUNITIES!\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/jamberoo-action-park-434907", "employer_name": "Jamberoo Action Park", "employer_info": "This approved development will ultimately replace the entire area where our Go Cart tracks were once situated. While the Go Carts were extremely popular over the past 20 years they could only service around 250 people comfortably, the new development, when fully completed, will easily be able to accommodate 4500 to 5000 people.\n\nNot only will the latest in high thrill water based rides and attractions be on offer there will be a huge reduction in queue times and congestion making for an even more enjoyable experience for our guests.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/jalco-group-436197", "employer_name": "Jalco Group", "employer_info": "Jalco Group is Australia’s preeminent FMCG contract manufacturing service provider and first-choice partner when you need a supplier you can trust to deliver every step of the way.\n\nWith 5 business divisions including a dedicated Creative Centre for Research & Development, Home Care, Personal Care, Automotive & Promotional Packaging, we offer a unique combination of scale, stability, resources, knowledge and experience.   \n\nWe are proud to be the supply-chain driving force behind some of the biggest brands in the world today. We don’t own any brands and therefore do not compete with any of the brands we develop, manufacture or distribute.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/jadin-chemist-group-798544", "employer_name": "Jadin Chemist Group", "employer_info": "Since starting in 1994, the Jadin Chemist Group has grown from a single Day and Night Pharmacy in Morayfield, Queensland, to eight independently owned pharmacies, employing 31 Pharmacists and approximately 100 staff.\n\nOur Quality Care Accredited pharmacies are among the most comprehensively stocked and equipped and offer outstanding value for money on all products.\n\nAt a time when healthcare services have become increasingly cold and distant for many people, we pride ourselves on being the community chemist that is doing things differently. Our experienced staff work to provide a fast and efficient service based on our goal to help our customers live longer, happier and healthier lives. That means shorter waits, more personalised advice and great value for money.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/jamaica-blue-432834", "employer_name": "Jamaica Blue", "employer_info": "In Jamaica, there is a saying “wan wan coco ful baskit”.\n\nIt simply means that if you slow down, stop rushing and take your time, you will achieve your goal. At Jamaica Blue, we couldn’t agree more. We believe that everybody should take a little time out of their day to recharge, relax and reflect; to stop for a while and simply enjoy the moment.\nSo, as you sip your superior tasting Jamaica Blue coffee, be sure to take your time and fully embrace this moment: your coffee moment. After all, “wan wan coco, ful baskit”\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/jaguar-land-rover-435024", "employer_name": "Jaguar Land Rover", "employer_info": "Jaguar Land Rover is the UK’s largest automotive manufacturing business, built around two iconic British car brands: Land Rover, the world’s leading manufacturer of premium all-terrain vehicles and Jaguar, one of the world’s premier luxury sports saloon and sports car marques. \n\n\nUnder the ownership of Tata Motors Limited, Jaguar Land Rover is transforming its business to realise the full potential of its brands and deliver profitable results. Driving the business is a world-class team of 32,000 people globally. In addition we support more than 210,000 UK jobs through the supply chain, dealer network and wider economy.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/jade-australia-925481", "employer_name": "Jade Australia", "employer_info": "OUR WEB SITE HELPS YOU CHOOSE THE RIGHT INSTRUMENT, ACCESSORY, AMP OR PA.\n\nALL OF OUR PRODUCTS ARE AVAILABLE THROUGH OUR NETWORK OF RETAIL \nSTORES THROUGHOUT AUSTRALIA. \nCALL FREECALL: 1800 144 120 TO FIND YOUR NEAREST STORE.\n\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/jackson-motor-company-813278", "employer_name": "Jackson Motor Company", "employer_info": "We’re part of your community\n\nJackson Motor Company is an active participant in and supporter of our local communities. By aligning ourselves with organisations that share our values, we develop lasting partnerships for the benefit of Tasmanians. We sponsor sporting, cultural and vocational activities and events, including the Burnie Dockers, Taste of Tasmania and the Royal Yacht Club of Tasmania.\n\nOur support of the community takes many forms – financial, in-kind, and employee participation. This means that when you buy from Jackson Motor Company, you’re helping us to support our community.\n\nIf you are interested in partnering with JMC or seeking our involvement, please email sponsorship@jmc.com.au detailing your proposal.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/jacobs-douwe-egberts-814248", "employer_name": "Jacobs Douwe Egberts", "employer_info": "JACOBS DOUWE EGBERTS\nA global coffee & tea company, serving consumers in more than 100 countries through iconic brands including: Jacobs, Tassimo, Moccona, Senseo, L’OR, Douwe Egberts, Kenco, Pilao & Gevalia\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/jacqui-e-436426", "employer_name": "Jacqui E", "employer_info": "With stores across Australia & New Zealand, Jacqui E has been making women feel beautiful since the 1950s.\n\nAt Jacqui E, we understand that nothing feels as good as looking good, which is why we work so hard to ensure our customers do. We also know that a woman's outfit directly relates to how confident she feels.\n\nDrawing inspiration from global fashion trends our range embodies contemporary style. From smart workwear and versatile casuals to the perfect piece for that special occasion. With an emphasis on flattering styles, quality fabrics and exceptional tailoring Jacqui E continues to make women feel beautiful.\n\nJacqui E is a member of the Just Group. For more information on the Just Group portfolio,\nvisit the Just Group website.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/jackson-mcdonald-436997", "employer_name": "Jackson McDonald", "employer_info": "Jackson McDonald is Western Australia’s largest independent law firm with over 230 staff and 32 partners, offering a full range of commercial legal services.  For the last 90 years, we have played an integral role in shaping the State by providing our clients with clear, concise legal advice that is tailored to their commercial and operational needs.\n\nWe provide specialist legal services to a broad client base, which ranges from multi-national corporations, mining and resources groups, financial institutions and developers to local companies, universities and government agencies.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/jag-435759", "employer_name": "Jag", "employer_info": "JAG was born in 1972 on Chapel Street in Melbourne. Founded by Adele Palmer, her unique vision took denim innovation to the world, labeling JAG as the original Australian denim brand.\n\nFollowing the jeans boom of the 70's, JAG quickly secured a star studded following including style icons like Steve McQueen, Jackie Onassis and Bianca & Mick Jagger. JAG soon became synonymous with designer denim around the world.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/jacobs-433122", "employer_name": "Jacobs", "employer_info": "Being a valuable partner to our clients means having the resources to handle a variety of challenging projects. When they need us, we answer the call. From feasibility studies and environmental compliance to design, construction management and operations and maintenance, we bring together the talent and expertise necessary to deliver success. Time and time again.\n\nSource: this is an extract from the company’s own website"},
{"employer_url": "https://www.seek.com.au/companies/jabiru-area-school-988185", "employer_name": "Jabiru Area School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/jacana-energy-816743", "employer_name": "Jacana Energy", "employer_info": "Who we are\n\nAt Jacana Energy we’re committed to delivering superior customer experience to our customers. We’re a startup business and excited about our journey to deliver customer focused and forward thinking energy solutions for our 80,000+ customers across the Northern Territory.\n\nAs the NT’s largest electricity retailer, we provide electricity retail services for residential, small and large commercial customers throughout the urban, rural and remote areas. We’re owned by the NT Government and we were created as part of the structural separation of Power & Water Corporation.\n\nRead our fact sheet to find out more.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/jacksons-drawing-supplies-925431", "employer_name": "Jacksons Drawing Supplies", "employer_info": "We welcome you to our website and thank you for supporting a 100% Western Australia family owned business.\n\nOur Products\nWe offer a huge range of products on a retail or wholesale basis. We specialise in Fine Art, Drawing Supplies, Technical Drawing Materials, Ceramics and Craft Supplies. Our merchandise is of the highest quality and sourced from the four corners of the world.\n\nTo see our products, stop in at one of our 12 Stores, or browse through the online catalogue at the Jacksons Online Store.\nHistory\nJacksons Drawing Supplies commenced trading on January 1, 1955. Prior to that date Jacksons traded as 'Jordan & Jackson' from Kalgoorlie Western Australia.\n\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/j1-led-860977", "employer_name": "J1 LED", "employer_info": "Brisbane based manufacturer of LED Systems & Solutions\n\nJ1-LED\n\nAfter 16 years in a challenging and dynamic industry J1-LED continues to set the standard for LED Display Systems & Solutions excellence.  The collective experience gained and maintained during these years truly enables J1-LED to provide end-to-end LED display Systems and Solutions.  The in-house engineering team provides design, development, manufacturing and system testing through to installation & commissioning with after-sales support. Concept through to completion across:\n•Intelligent Transportation Systems\n•Portable LED Advertising & Traffic Control Signs\n•LED Advertising Displays\n•LED Lights (Industrial Applications) and\n•Support Services\nSource: this is an extract from the company’s own website."},
{"employer_url": "https://www.seek.com.au/companies/jands-engineering-801721", "employer_name": "J&S Engineering", "employer_info": "J and S Engineering & Maintenance is a family owned company operating out of Maitland in the Hunter Valley, NSW, Australia.\n\nWe value our people and the many longterm customer relationships we have built over the past 25 years.\n\nOur areas of specialty are:\n\nSupply and reclamation of a full range of Drill Consumables for Blasthole Drills\n•Complete Rebuild service for Under Carriage Components for Heavy Earthmoving and Mining Equipment\n•Overhauling Dragline and Shovel Buckets, also large Excavator and Loader Buckets\n•Extensive CNC/Manual Machine shop\n•Major Fabricating Weld Reclamation Facility and Machinery\n•Blasting Services\n\n\nSource: this is an extract from the company’s own website."},
{"employer_url": "https://www.seek.com.au/companies/j-g-king-building-group-995235", "employer_name": "J G King Building Group", "employer_info": "WHY WE'VE BEEN BUILDING WITH STEEL FRAMES SINCE 1985 \n\n \nStill Undecided? \nOnce you discover all the advantages of a BlueScope Steel frame, you’ll see that there really is no choice if you want the best frame that money can buy. From straighter walls, to a frame that has a higher resistance to termites, fire and anything else nature can throw at it. It’s the same reason we don’t build bridges or ships with timber anymore. So get all of the style, and all of the substance, with a JG King Home.\n\nIn 1985 a decision for the future was made. JG King Homes set the industry benchmark by exclusively building steel framed homes. \n \nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/jcs-quality-foods-801765", "employer_name": "J.C.'s Quality Foods", "employer_info": "Managing Director and Founder Joseph Cannatelli started J.C.’s Quality Foods in 1994. Born into a family who have been fruit merchants for generations, Joseph understands the fruit nut and fresh produce business better than most.\n \nSince the very early days J.C.'s Quality Foods have enjoyed strong growth, as more and more customers realise the value of a company who understand their business. With a life long passion for fresh, quality products like freshly roasted cashews, natural almonds and health mixes, JC's have a strong and loyal customer base.\n \nRecently moving into new and improved warehouse and distribution facilities have helped JC's supply their customers the highest standard of service in record time, with the freshest possible nuts, dried fruit, snacks and confectionery.\n \nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/ja-martin-electrical-877862", "employer_name": "JA Martin Electrical", "employer_info": "JA Martin Electrical Pty Ltd has been in operation providing quality focused service for over 50 years. Our success has been built on long standing relationships with clientele that are perpetuated through the offering of an outstanding level of service.\n\nCurrently employing 150 personnel, with over 100 vehicles on the road we are a leading provider of electrical services to all areas of Australia.\n\nISO9001 accredited and AS4801 WHS certified, our competencies include electrical engineering, switchboard manufacture, CCTV, data cabling, service and maintenance and project management to the industrial sector from premises located in the Tomago (Newcastle), Mt Thorley (Hunter Valley) and Gunnedah (Liverpool Plains) areas.\n\nOur capabilities provide for an electrical project to be taken from inception, through design, engineering, project management, manufacture and installation phases to closure without reliance on third parties.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/j2-global-834852", "employer_name": "j2 Global", "employer_info": "Founded in 1995, j2 Global, Inc. (NASDAQ: JCOM) is the result of a marriage of a revolutionary patented suite of services and a financially strong and disciplined organization.\n\nThis success benefits:\n•Our over 3,000,000 customers who are looking for a billion dollar service provider for their advanced messaging needs; \n•Our shareholders, who look for increasing financial growth and value; and \n•Our over 1600 employees in 14 countries, who work in a creative and positive environment.\n\nj2 Global provides Internet services through two segments: Business Cloud Services and Digital Media.\nThe Business Cloud Services Division includes j2 Cloud Connect which offers Internet fax, virtual phone and unified communications solutions and j2 Cloud Services™ which offers hosted email and spam and virus blocking, email marketing, CRM solutions, online backup, and web hosting. j2 Cloud Connect markets its services principally under the brand names eFax®, eVoice® and Onebox®, and operates a messaging network spanning over 50 countries on six continents. j2 Cloud Services markets its services principally under the brand names FuseMail®, Campaigner®, KeepItSafe®, and Web24©.\n\nThe Digital Media Division offers technology, gaming and lifestyle content through its digital properties, which include IGN, PCMag, AskMen, Everyday Health, Offers.com, Speedtest, ExtremeTech, Geek, Toolbox, TechBargains, Ziff Davis B2B and emedia.\nSource: This is an extract from the company's own website"},
{"employer_url": "https://www.seek.com.au/companies/jag-traffic-438738", "employer_name": "Jag Traffic", "employer_info": "JAG Traffic is a key provider of traffic management in Western Australia. Our internal expectation of service ensures that our clients’ safety is our number one priority, so that everyone can return home safely at the end of the day. \n\n\n JAG Traffic guarantees that all our worksites comply with requirements set out by Mainroads WA, local governments and any stakeholder involved with our projects.\n\n\n All of our crews go to the road with either site specific or detailed approved generic Traffic Management Plans.\n\n\n JAG Traffic provides the following services:\n\n \n\n• Statewide traffic management service – 24 hours/365 days a year\n• Traffic management planning – basic and intricate\n• Hazard analysis and JSA’s undertaken on all worksites\n• Stakeholder applications for permits to work\n• 24/7 emergency response – 365 days a year\n• Aftercare temporary sign hire and maintenance\n• Flashing arrowboard hire\n• Variable message board hire\n• Crash barrier hire\n• Mobile speed detector hire\nSource: this is an extract from the company’s own website."}
]