[
{"employer_url": "https://www.seek.com.au/companies/yandr-group-813472", "employer_name": "Y&R Group", "employer_info": "o be our clients' most important partner, we begin with a mission...\nOur job is to Resist the Usual.\n\nRaymond Rubicam said that more than 85 years ago.\n\nYet resisting the usual has never had as much meaning and resonance as it does today.\n\nToday, the competitive edge belongs to those brave enough to Resist the Usual — those who have the expertise to ask why and the credibility to say no, the passion to drive business and the ideas that will have an impact on people, markets, technology and the future.  \n\nResist the Usual means understanding the new realities about consumers all around the world — a Generation World that doesn’t behave according to traditional segmentation, that can’t be defined by age, nationality or income.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/dulux-group-796894?child=796958", "employer_name": "Yates", "employer_info": "DuluxGroup is a manufacturer and marketer of products that protect, maintain and enhance the spaces and places in which we live and work.\n\nFrom household rooms transformed by the latest designer colours, to the ripe tomatoes in the garden, to the latest in garage door design and technology, to the industrial coatings that protect landmark infrastructure such as bridges and the construction chemicals that reinforce them; DuluxGroup products are at work. Our brands have been woven into the fabric of the communities where we operate, helping consumers to live better and more comfortable lives.\n\nDuluxGroup employs approximately 4,000 people in Australia, New Zealand, Papua New Guinea, South-East Asia and China.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/yellow-brick-road-436753", "employer_name": "Yellow Brick Road", "employer_info": "Yellow Brick Road helps Australians on the road to their hopes and dreams. How? We are a full service wealth management company that offers products and services for home loans, financial planning, insurance, superannuation, and investments. We offer competitive rates, an all-encompassing portfolio of services and a network of trusted local wealth managers all over Australia.\n\nOur local wealth managers (mortgage brokers and financial advisers) are small business owners with a vested interest in their local community. They understand the hopes and dreams of the people who live in their patch, and how to achieve them.\n\nBut, no matter where we are based, we all believe that traditional banking and financial institutions need a good shake up. So, we're here to provide meaningful financial services, from the purchase of your first home right up until retirement, and we'll never take you for granted.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/yb12-813295", "employer_name": "YB12", "employer_info": "YB12 Coach is fast becoming the place to go for aspiring companies.\n\n\n\nThe reason for that is the psychology based pedigree of our programs.\n\nWe have a long and successful 25-year history with more than 200,000 people having already attended our workshops, introductory seminars or our one-on-one coaching sessions.\n\nWe are different because we offer programs from our bite sized 2–3 hour events right through to our comprehensive 12-month Results Program.\nOur Classic Coaches Work With Individuals or Small Groups\n\nWorking in the business and corporate world is not for everyone. Our YB12 Classic Coach program is for those who are passionate about personal development and feel more comfortable working with people on a one-to-one basis or in small groups.\nBe a YB12 Business Advisor\n\n\n\nNow You Can Use Your Own Experience to Help Other Business Owners Succeed\n\nYour skills and experience combined with our proven approach can make a real difference to small businesses. Almost every business can benefit from a quality Business Advisor who is armed with a program of substance. \nSource: This is an extract from the company's own website"},
{"employer_url": "https://www.seek.com.au/companies/yealering-primary-school-874638", "employer_name": "Yealering Primary School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/yd-433818", "employer_name": "Yd", "employer_info": "yd. isn’t just a store, it’s a lifestyle. And now with our yd. Online Store that lifestyle is available to you wherever and whenever you want it.\n\nWe live for the night, we care about our style, and we know that a little charisma and cheek go a long way. \n\nWhether you want to pick up, fit in with your mates, or stand out from the crowd, we’ll keep you up to the minute and on trend, so you know you’re looking good from head to toe.\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/yass-valley-council-802645", "employer_name": "Yass Valley Council", "employer_info": "On 1 July 2010 new right to information legislation came into effect, the Government Information (Public Access) Act 2009 (NSW) (GIPA), repealing and replacing the Freedom of Information Act 1989 (NSW) (FOI Act).\n\nAs part of this reform, the GIPA Act:\n\nupholds rights to information that are designed to meet community expectations of more open and transparent government;\nmaintains there is a presumption in favour of the disclosure of government information unless there is an overriding public interest against disclosure;\nauthorises and encourages government agencies to proactively release government information;\nmakes it possible for government agencies to release information informally, without the need to submit a formal access application;\nrequires that a government agency must release information unless there is an overriding public interest against disclosure;\nprovides applicants with review rights around information access decisions.\nRelease of information by Council under the GIPA Act will be determined by the public interest test. As provided by section 13 of the Act, there is an overriding public interest against disclosure of information if (and only if) there are public interest considerations against disclosure and, on balance, those considerations outweigh the public interest considerations in favour of disclosure.\n\nYou can find out more about right to information, the public interest test and the ways to access government information under the GIPA Act on the NSW Information and Privacy Commission (IPC) website at www.ipc.nsw.gov.au (link is external). The IPC is an independent statutory authority responsible for overseeing the provisions of the GIPA Act. Please note the IPC does not and is unable to provide legal advice to stakeholders.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/yarwun-state-school-820295", "employer_name": "Yarwun State School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/yelarbon-state-school-819447", "employer_name": "Yelarbon State School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/yb-12-813705", "employer_name": "YB 12", "employer_info": "YB12 Coach is fast becoming the place to go for aspiring companies.\n\nThe reason for that is the psychology based pedigree of our programs.\n\nWe have a long and successful 25-year history with more than 200,000 people having already attended our workshops, introductory seminars or our one-on-one coaching sessions.\n\nWe are different because we offer programs from our bite sized 2–3 hour events right through to our comprehensive 12-month Results Program.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/yarrilee-state-school-819687", "employer_name": "Yarrilee State School", "employer_info": "Yarrilee State School is a community of learners who feel a strong bond with each other\n\nThe school has a warm and welcoming atmosphere where difference is accepted and making a difference is expected.\n\nOur values and beliefs are obvious in our interaction with peers and with others.\n\nHere, the students and staff see themselves not only as Hervey Bay, Queensland and Australian citizens but, more importantly, as world citizens.\n\nMany display leadership qualities from a young age.\n\nThere is a sense of purpose evident in the classrooms where challenging tasks are undertaken in a supportive and nurturing learning environment.\n\nYou often hear students being praised for their efforts.\n\nInformation and communication technology is used as a tool to enhance learning outcomes.\n\nStudents have an appreciation for the skills and attributes necessary to survive and prosper in modern times.\n\nOur whole school community promotes the notion that 'Learning is our future'.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/yarrawonga-mulwala-golf-club-resort-802643", "employer_name": "Yarrawonga Mulwala Golf Club Resort", "employer_info": "Yarrawonga Mulwala Golf Club Resort is recognised as the pick of resorts along the Murray River, Australia’s number one golfing destination. Situated three hours drive from Melbourne and hour from Albury it is the ideal location for your next individual or group golfing experience, wedding & reception, conference, dining experience, short stay accommodation or a long relaxing holiday.\n\nAs Australia’s largest public access golf resort boasting 45 holes, Yarrawonga Mulwala Golf Club Resort is more than a golfer’s paradise. Long stay or short, guests can explore the spectacular surrounds, tempt their tastebuds with quality dining, workout in the gym, catch the latest blockbuster in our luxury movie theatre, have a hit of tennis, take a dip in the solar-heated pool, relax with a massage, unwind with a book or a quiet stroll along the banks of the Murray River or shores of Lake Mulwala.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/yarraman-state-school-820246", "employer_name": "Yarraman State School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/ywca-434885", "employer_name": "YWCA", "employer_info": "YWCA Australia is the national association of YWCAs in Australia and is part of the world YWCA movement. We are a women-led organisation that achieves positive change by providing advocacy, programs and services for women, families and communities.\n\nYWCAs undertake advocacy and deliver programs and services that develop the leadership and collective power of women and girls; support individuals, their families and communities at critical times; and promote gender equality and community strengthening.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/yungaburra-state-school-820120", "employer_name": "Yungaburra State School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/yarralumla-preschool-villa-874621", "employer_name": "Yarralumla Preschool Villa", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/yusen-logistics-436222", "employer_name": "Yusen Logistics", "employer_info": "Yusen Logistics Australia is a leading provider of supply chain and transport solutions with over 25 years of service in Australia and located with coverage in every major  city – Sydney, Melbourne, Brisbane, Adelaide and Perth.\nWith the 1 March 2016 acquisition of Hitech Asia Pacific this now includes Canberra and extended coverage of Auckland, New Zealand.\n \nThe Yusen Logistics Australian head office is located in Sydney and with Hitech has an even greater supply chain office coverage of 19 locations throughout Australia with a total of 460 people covering international freight forwarding, in-house customs clearance and contract logistics (warehousing and distribution) services and sensitive freight solutions.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/yarralumla-montessori-villa-school-874620", "employer_name": "Yarralumla Montessori Villa School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/yarralumla-primary-874622", "employer_name": "Yarralumla Primary", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/yuna-primary-school-874669", "employer_name": "Yuna Primary School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/yuluma-primary-school-874668", "employer_name": "Yuluma Primary School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/yum-restaurants-australia-434833", "employer_name": "Yum! Restaurants Australia", "employer_info": "Yum! Brands, Inc., (NYSE: YUM), based in Louisville, Kentucky, is one of the world’s largest restaurant companies with nearly 43,000 restaurants in almost 140 countries and territories. Yum! Brands is ranked #218 on the FORTUNE 500 list with revenues of more than $13 billion and in 2014 was named one of the Aon Hewitt Top Companies for Leaders in North America. Our restaurant brands – KFC®, Pizza Hut® and Taco Bell® – are the global leaders of the chicken, pizza and Mexican-style food categories.\n\nSince our spin-off from PepsiCo in 1997, Yum! Brands has become a truly global company going from approximately 20 percent of profits coming from outside the U.S. to almost 65 percent in 2015. We’re a leader in global retail development, opening on average over six new restaurants per day worldwide.\n\nWe’re proud to be the worldwide leader in emerging markets with nearly 16,500 restaurants, nearly twice as many as the nearest competition. With about 2.5 restaurants per million people in the top 10 emerging markets, compared to 57 restaurants per million in the U.S., we are on the ground floor of global growth.\n\nSource: This is an extract from the company's own website"},
{"employer_url": "https://www.seek.com.au/companies/yulara-school-988332", "employer_name": "Yulara School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/yulga-jinna-remote-community-school-874667", "employer_name": "Yulga Jinna Remote Community School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/yugumbir-state-school-819681", "employer_name": "Yugumbir State School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/yuendumu-school-988331", "employer_name": "Yuendumu School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/yowah-state-school-820169", "employer_name": "Yowah State School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/yuleba-state-school-819614", "employer_name": "Yuleba State School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/youth-support-and-advocacy-service-861360", "employer_name": "Youth Support and Advocacy Service", "employer_info": "Youth Support + Advocacy Service (YSAS) is a leading youth health not-for-profit agency that enables young people experiencing serious disadvantage to access the resources and support they require to lead healthy and fulfilling lives.   At YSAS, we engage, support and strengthen highly vulnerable and high-risk young Victorians affected by, or at risk of being affected by, alcohol, drugs, mental health issues and social disconnection.  We do this by developing non-judgemental, caring and respectful relationships with young people and their families and communities. With more than 330 skilled staff, YSAS provides a range of integrated services across 12 sites in metropolitan and regional Victoria.  \n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/youth-nt-867945", "employer_name": "Youth NT", "employer_info": "Welcome to the Office of Youth Affairs Website. The Office of Youth Affairs (OYA) website includes information about programs coordinated by this office and how young Territorians can get involved in activities across the Northern Territory.\nOYA helps young Territorians keep informed and actively involved in making things happen in their community.\nOYA's key programs are Youth Engagement Grants, the Northern Territory Youth Round Table (Round Table), National Youth Week (NYW), Youth Policy and Regional Youth Services.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/youth-off-the-streets-813363", "employer_name": "Youth Off The Streets", "employer_info": "Youth Off The Streets is a non-denominational community organisation working for disadvantaged young people who may be homeless, drug dependent and/or recovering from abuse. Youth Off The Streets supports these young people as they work to turn their lives around and overcome immense personal trauma such as neglect, physical, psychological and/or emotional abuse.\n\nIt is our goal that these young people will leave our care drug free, with a high school education, living skills and a full-time or part time job in hand.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/youth-justice-court-services-874664", "employer_name": "Youth Justice Court Services", "employer_info": "The Youth Justice Court Advice Service (YJCAS) was established as a statewide service in February 2001. It is a specialised youth focused service provided by the Department of Human Services, Youth Services and Youth Justice Branch, in both the children’s and adult court jurisdictions. \n\nIn the adult court system, young people aged 18 to 20 years of age who are appearing for criminal matters in the Magistrates, County and Supreme Courts may use this service.  The primary focus of the service is the diversion of young offenders from the adult criminal justice system.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/youth-lifestyle-options-814097", "employer_name": "Youth Lifestyle Options", "employer_info": "YLO (Counselling & Intervention Services) provides support and intervention to children, young people and families. Services include assessment, therapeutic intervention, planning support and workplace assistance for youth services.\nYLO (Youth Support Services) provides support to children and young people under the care and protection of the Department of Communities, Child Safety and Disability Services within South East Queensland.\nYLO (Residential Care Services) provides therapeutic residential care programs to children and young people under the care and protection of the Department of Communities, Child Safety and Disability Services within South East Queensland.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/youth-focus-814211", "employer_name": "Youth Focus", "employer_info": "Who are we?\n\nYouth Focus is an independent West Australian not-for-profit working to stop youth suicide. Youth Focus works with young people aged 12-25 to help them overcome issues associated with depression, anxiety, self-harm and suicidal thoughts through the provision of free, unlimited and professional face-to-face individual and family counselling and other mental health services.\n\nThe demand for our services is ever-increasing and with only a small percentage of our operating funding sourced from the Government, we rely heavily on the goodwill and support of the corporate and community sectors.\n\nWhat do we do?\n\nEach year, about 2,500 young people aged 12-25 will visit one of our eight offices or 40 school locations statewide to get help. The average length of counselling engagement is about six months. We estimate that in 2015, about 15,000 people took part in our preventative and educational programs.\n\nIn the 2015-16 period, our expert staff provided more than 1,000 counselling sessions to families. We believe that the family has a fundamental role in the health and social engagement of young people and that the inclusion of the family from the very beginning of counselling leads to a more rapid and more sustainable improvement in the young person and better long-term outcomes than individual therapy. Aside from youth and family counselling our other core services and offerings include workplace training, youth mental health training, peer support programs and mentoring programs.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/your-source-436093", "employer_name": "Your Source", "employer_info": "Simply put - Your Source are experts in gathering data and delivering it to your specifications. \n\n\nAs such - we have everything you'd expect from a field company; great capacity and great facilities. This is where any similarity to other Field & Tab companies ends. We think differently. We form partnerships with our clients and put operational imperatives front and centre. \n\n At Your Source we will not make promises we can't live up to, and will guide you towards an operational approach that will lead to low pricing and timely outcomes. We'll consult too - with around 50% of a project's budget going to field – the operational approach has to be proactive. Your prop will be lean and solidly based on operational reality, so we won't let you down - and you won't let your clients down. \nSource: This is an extract from the company's own website"},
{"employer_url": "https://www.seek.com.au/companies/yourtown-433120", "employer_name": "yourtown", "employer_info": "\"yourtown is a charity with services young people can access to find jobs, learn skills, become great parents and live safer, happier lives.\n\nWe believe every young person has the right to a brighter future.\n\nSince 1961, we've been tackling the issues impacting young people in Australia - like mental health and unemployment, and taking on issues like family and domestic violence. We aim to be part of the solution by delivering services that get results, and we offer these at a local and national level. They include Kids Helpline, training and employment services for young people, parent education and family refuges.\n\nWith our work predominately funded by the community, it's together and by association that we give young people choices.\"\n\nTracy Adams, CEO\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/your-chemist-shop-802602", "employer_name": "Your Chemist Shop", "employer_info": "Your Chemist Shop is one of Australia’s leading online pharmacies. We are located at 806-812 Anzac Pde, Maroubra NSW 2035. If you're ever in the area drop in and say hello!\n\nYour Chemist Shop is 100% Australian Owned.\n\nWe don’t just sell discount pharmaceuticals, we offer personal and professional healthcare advice. So you get the help you need, at a price you can afford.\n\nOur Promise to You\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/youngtown-primary-school-874662", "employer_name": "Youngtown Primary School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/youi-pty-ltd-433715", "employer_name": "Youi Pty Ltd.", "employer_info": "Youi Pty Ltd is a registered general insurance company which underwrites its own policies. Our products currently include Vehicle (Car, Motorcycle, Caravan and Trailer), Home (Buildings and Contents), Watercraft and Business Liability. Youi stands for You.Insured. We get you by offering you tailor-made insurance which is a smarter way of doing it. We’re passionate about service and our people make it all happen. You’re looking for the right place to work and we’re looking for the right people. We get you. We’re a team and our people determine our success. Our values drive our culture, we’re passionate, dynamic, fast, honest and human, and above all, we strive to deliver awesome service. Our business is growing, and so are the opportunities to develop within our team. This is where you need to be."},
{"employer_url": "https://www.seek.com.au/companies/young-academics-815139", "employer_name": "Young Academics", "employer_info": "Welcome to Young Academics\n\nWe’re a group of early learning centres dedicated to caring for children aged 6 weeks to 6 years. In these early years, the attention and interaction children receive is crucial – both to their immediate happiness, and their future development. So at Young Academics, we make it our mission to give each and every child the best possible support.\n\nWe understand that every child is unique, and we provide care that’s shaped around each individual. They are encouraged to explore, learn and develop at their own pace. And while education underpins everything we do, our play-based approach means that little ones are always allowed to be little ones.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/young-shire-council-802659", "employer_name": "Young Shire Council", "employer_info": "A Vision for the Community\n\nIn establishing a statement of vision for the community we are trying to establish what it is the community wants to see, what is in your minds eye. Perhaps another way of explaining the vision statement is that it is a statement of what our community would wish to be like in the future.\n\n\"Our community shall enjoy a quality of life and services second to no other country town in Australia.\"\n\nCouncil’s Mission – Our Purpose\n\nThe mission statement is a statement of what the organisation will do, for whom, and to what standard.\n\n\"Our mission is to plan and deliver quality services, and encourage responsible development, for the community in an equitable manner.\"\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/yorkeys-knob-state-school-819771", "employer_name": "Yorkeys Knob State School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/york-civil-433785", "employer_name": "York Civil", "employer_info": "\n\n"},
{"employer_url": "https://www.seek.com.au/companies/yolla-district-high-school-874651", "employer_name": "Yolla District High School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/yooralla-433266", "employer_name": "Yooralla", "employer_info": "Established in 1918, Yooralla is one of Australia's largest and most proactive organisations working to support people with disability to live independent and fulfilling lives. Yooralla values the right of every person, irrespective of age, gender, financial circumstance or level of disability, to access high-quality services that will allow them to achieve their goals. Yooralla's services are developed in partnership with people with disability and in many cases, their families and carers. Yooralla provides essential services for people of all ages and disability, regardless of whether a person is born with or acquires a disability as the result of accident, ill health or age. \nSource: this is an extract from the company's own website"},
{"employer_url": "https://www.seek.com.au/companies/yogurtland-436054", "employer_name": "Yogurtland", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/yokogawa-435259", "employer_name": "Yokogawa", "employer_info": "\n\n"},
{"employer_url": "https://www.seek.com.au/companies/yirrkala-school-988330", "employer_name": "Yirrkala School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/yirrkala-homeland-school-988329", "employer_name": "Yirrkala Homeland School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/yule-brook-college-874666", "employer_name": "Yule Brook College", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/yha-815017", "employer_name": "YHA", "employer_info": "YHA Australia is part of the world's largest backpacker accommodation network, Hostelling International (HI), providing more than 4,000 YHA hostels in 90 countries around the world. The YHA group in Australia includes YHA Ltd, Hostelling International Australia Inc (trading as YHA Australia) as well as YHA WA Inc and Youth Hostels Association of Tasmania Inc.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/young-guns-container-crew-436754", "employer_name": "Young Guns Container Crew", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/yfs-816918", "employer_name": "YFS", "employer_info": "YFS is a not-for-profit organisation that delivers a range of services to the people of Logan and surrounds. We cater to people who are disadvantaged, vulnerable or want to improve their circumstance. YFS also champions social enterprise, with four of varying size and purpose.\nOur vision\n\nOur vision is building independence and participation. Our purpose is to deliver services designed to promote independence and citizenship. We champion rights and responsibilities and clients taking up social, cultural and economic opportunities.\nOur values guide the work we do\n\nExcellence – delivering quality services and having high expectations. Integrity – acting honestly and openly. Optimism – thinking and acting with confidence about people and the future. Steadfastness – persisting to overcome barriers and adversity with our clients.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/yokine-primary-school-874650", "employer_name": "Yokine Primary School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/yetimo-marketing-802651", "employer_name": "Yetimo Marketing", "employer_info": "Yetimo is the preferred promotional activations agency for the community of leading lifestyle brands across the asia pacific. Created in 2000 to answer a need among corporate clients and below-the-line agencies for full-service bespoke merchandising. Yetimo, is specialist creative competency across promotional merchandise, apparel, POS display, and a diversity of customised high-end|low-end promotional product lines.\nIn today's crowded business market, companies - whether big or small - are competing more than ever to deliver their message. As companies launch all kinds of advertising and marketing campaigns to attract consumers, it becomes more difficult for one message to stand out.\n\nAt Yetimo we specialise in the customization of responses to each individual brief and brand and every unique client. Because we understand our clients marketing and sales objectives, nothing gets in the way of the vital collision between what you need and what we bring. \nSource: this is an extract from the company’s own website."},
{"employer_url": "https://www.seek.com.au/companies/ymca-432416", "employer_name": "YMCA", "employer_info": "In Australia, the YMCA is made up of 24 Member Associations supporting over 741 communities in the areas of Healthy Living, Empowering Young People and Social Impact. Wherever the Y is, we strive to make a positive difference by providing each and every person opportunity to be healthy, happy and connected.\n\nThe YMCAs of Australia work together from a base of Christian values to provide opportunities for all people to grow in body, mind and spirit.\nFrom over 741 locations across Australia the YMCA provides expertise, programs and services in the following areas, to enable healthier, happier communities; Accommodation, Aquatics, Camping and Outdoor Education, Children's Services, Health and Wellness, Sport & Community Recreation and Youth Services.\n\nSource: this is an extract from the company’s own website"},
{"employer_url": "https://www.seek.com.au/companies/yes-insurance-group-978132", "employer_name": "Yes Insurance Group", "employer_info": "If you’re insuring a business or making complex risks, it’s essential to have access to an insurance expert who can spend time getting to know you and your business.\n\nWith over 42 years of collective insurance, we know our clients - we’re experts when it comes to insuring your truck, trailer or fleet. In fact, we are experts in all transport operations. Whether your business is a newly formed enterprise or an existing small, medium or large business, we cover a wide range of transport industry occupations.\n\nOur clients are our business. We’re an Australian-owned company, running largely on client referral and have established a loyal client base in the transport industry. We’re being recognised for our expertise and individualised service. In 2014, we were awarded Fastest Growing Broker under the NAS Group.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/optus-432323?child=432960", "employer_name": "Yes Optus", "employer_info": "Optus is a wholly owned subsidiary of Singtel, Asia’s leading communications group. The Singtel Group is Asia’s leading communications group with operations in more than 20 countries worldwide. With over 130 years operating experience, Singtel drives the Group’s efforts to lead in communication services throughout Asia and Africa as well as to front the local digital and enterprise markets. As the Australian arm of Singtel, Optus services over ten million customers each day. It provides a broad range of communications services including mobile, telephony, business network services, internet and satellite services and subscription television.\n\nSource: this is an extract from the company’s own website."},
{"employer_url": "https://www.seek.com.au/companies/yeronga-state-school-819688", "employer_name": "Yeronga State School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/york-district-high-school-874653", "employer_name": "York District High School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/yeronga-state-high-school-819470", "employer_name": "Yeronga State High School", "employer_info": "Our school vision is simplistic yet powerful and is predicated on high standards, solid foundations, innovative practices, strong traditions and the agreed Values of: \n\n\n•Quality\n\n\n\n\n•Harmony and\n\n\n\n\n•Sustainability.​\n\nYeronga State High School provides opportunities for all students, irrespective of background and ability to access a broad range of knowledge skills and competencies. Yeronga SHS provides learning pathways to a socially, economically and environmentally balanced future. These are accompanied by the promotion of values and attitudes that enable the student to become more resilient and ready for the dynamic world of post secondary options and directions both within Australia and overseas.\n\n\n\nOur students will have the power and enabling skills to change our world to be a better place, through tolerance of diversity, being able to work with other people to promote the breaking down of barriers and by working harmoniously together as citizens of the world.​\nSource: This is an extract from the company's own website"},
{"employer_url": "https://www.seek.com.au/companies/yerecoin-primary-school-874644", "employer_name": "Yerecoin Primary School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/yeppoon-state-school-820039", "employer_name": "Yeppoon State School", "employer_info": "Welcome to Yeppoon State School\nWelcome and thank you for visiting the website of Yeppoon State School. We hope you enjoy your visit.\n\nWe are incredibly proud of our school, our students, our staff and our parent community. Our school has a strong community culture and our goal is to make a positive difference for all students.\n\nAs you browse through the website you will find countless examples of how the school community works together to provide a safe, disciplined, supportive, rich and happy learning environment for our students.​\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/york-health-service-874654", "employer_name": "York Health Service", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/yellowfin-978081", "employer_name": "Yellowfin", "employer_info": "Why we are here\nWe love data. We live for developing the world's best BI and analytics platform that helps our clients increase their business performance. We connect people and their data.\n\nThanks to quality coffee, donut days and end of week craft beers, our developers are able to stay focused and code till their fingers bleed - handcrafting great analytic software just for you.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/yeppoon-state-high-school-819473", "employer_name": "Yeppoon State High School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/yellow-goat-design-978083", "employer_name": "Yellow Goat Design", "employer_info": "Welcome to Yellow Goat Design\nCustom & Modern Luxury Lighting Design\n\nWe excel in the design and construction of sculptural lighting and custom lighting installations for the following sectors:\n\n\n\nHospitality\nHotels, Resorts, Restaurants, Events Centers, Casinos\n \n\n\n\nCommercial and Residential\nOffices, Multi-Residential and Mixed-Use Retail\n \n\n\n\nInstitutional\nEducation, Healthcare, Aviation\n \nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/yarrabee-coal-802642", "employer_name": "Yarrabee Coal", "employer_info": "Yancoal is one of Australia's largest and leading coal miners.\n\nYancoal Australia Ltd (Yancoal) produces approximately 15.5 million tonnes of saleable (equity basis) thermal and metallurgical coal per annum for export into international markets.\n\nOperating four sites and managing five others across New South Wales, Queensland and Western Australia, Yancoal employs approximately 2,000 people, sourcing the majority of our people from the local communities in which we operate.\n\nYancoal’s New South Wales region includes the mines of Moolarben and Stratford Duralie, with the Queensland region comprising Yarrabee and the Middlemount Joint Venture.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/yarralin-school-988328", "employer_name": "Yarralin School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/yarra-yarra-golf-club-978033", "employer_name": "Yarra Yarra Golf Club", "employer_info": "Located in a picturesque setting, Yarra Yarra’s impressive iconic Mediterranean-inspired Clubhouse blends the architectural charm of a bygone era with contemporary interior design, creating a warm and welcoming ambience for your function.\n\nThe Clubhouse features superb amenities and elegant function rooms which can accommodate events ranging from special celebrations, corporate events, Christmas parties to wedding receptions. This combined with our world-class service and cuisine create the perfect atmosphere for an experience you won’t find anywhere else.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/yarrabah-state-school-820601", "employer_name": "Yarrabah State School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/yarra-valley-snack-foods-802641", "employer_name": "Yarra Valley Snack Foods", "employer_info": "We are committed to producing nourishing foods that embody the wholesome goodness of a bygone era.\n We believe in providing natural foods to our valued customers, foods that we would be proud to serve at our own dinner table.\n\nYarra Valley Snack Foods uses produce sourced predominantly from the fertile plains of Australia’s eastern seaboard to create its wide range of snacks at its facility, situated in Victoria’s pre-eminent lush, fresh food heartland.\n\nFor superior health and premium taste try Australia’s leading producer of organic and gluten free snack foods in Australia.\nSource: This is an extract from the company's own website"},
{"employer_url": "https://www.seek.com.au/companies/yarra-valley-motor-group-978011", "employer_name": "Yarra Valley Motor Group", "employer_info": "For more nearly 40 years the friendly staff at Yarra Valley Motor Group have been selling and servicing New and Used vehicles in Croydon, Ringwood, Lillydale and the surrounding area.\n\nOur state of the art modern showroom and large display areas allow customers to casually browse the great range of Vehicles.\n\nOur friendly staff are specialists who are proud of their association with Nissan, Renault & Suzuki, and look forward to assisting you when searching for your new or used Passenger vehicles.\n\nWe enhance your buying experience by providing expert after sales service with courtesy pick-up and drop-off convenience, knowing your car is being treated with the care and professionalism you would expect in our large and modern workshop service area.\n\nOur team are dedicated to providing you with the best of care at all times, so whether you are buying, selling or leasing come and experience the difference at Yarra Valley Motor Group.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/yarra-valley-lodge-978009", "employer_name": "Yarra Valley Lodge", "employer_info": "Set in the stunning Yarra Valley, our hotel offers not only luxury accommdation, dining and conference facilities, but also the perfect location for weddings. From intimate and boutique, to large scale cocktail weddings, we have an array of wedding packages to suit any requirement \nThe hotel also features the dining delights of its own Bella Restaurant and the Lodge Bar, which is ideal for pre and post dinner drinks, and extensive conference and event facilities.\n\nLeisure pursuits are not forgotten at Yarra Valley Lodge with access to The Heritage Golf & Country Club’s two 18 hole championship golf courses – the Jack Nicklaus-designed St John course and the Tony Cashmore designed Henley course.  The Heritage Yarra Valley Day Spa is your key to restoration, inspiration, comfort and invigoration.  Nurture your soul and awaken your senses with a range of performance facials, body and water therapies, massages plus hand and foot therapies.\n\n\nYour conferencing needs are also well catered for with the flexibility of 11 variable function rooms catering for up to 400 guests that can be tailored to suit every style of event with the feature of natural light in all of the meeting rooms. Facilities are complemented by stylish surroundings, state-of-the-art audio visual services and a unique range of onsite team building, group activities and entertainment services.\n\nWith so much to do and see in the stunning and picturesque Yarra Valley, we offer tours and transport options with the local and knowledgable Wild Wombat Winery Tours team to help make your stay easy and accessible to all our region has to offer.\nSource: This is an extract from the company's own website"},
{"employer_url": "https://www.seek.com.au/companies/yarra-valley-grammar-814950", "employer_name": "Yarra Valley Grammar", "employer_info": "Yarra Valley Grammar's inclusive, welcoming community is one our families genuinely love and a place where our students feel inspired to achieve their very best.\n\nSet on a single 29-hectare campus, the School offers a coeducational learning experience for students from Early Learning through to Year 12.\n\nOur students are supported by talented and dedicated teachers who love what they do and know how to bring out the best in each individual. They understand the value of boys and girls working together to develop teamwork and self-confidence and, with around 1200 students, our School is large enough to offer a diverse program, but small enough that each student is known by their teachers and peers.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/yarra-trams-434378", "employer_name": "Yarra Trams", "employer_info": "Nicolas is a seasoned leader in the transportation industry, having held senior positions in rail passenger and freight organisations for over 20 years. He has consistently delivered results in managerial leadership, operation, and customer experience.\n\nAs Chief Executive Officer of Yarra Trams, Nicolas is accountable for ensuring the ongoing sustainability of Melbourne's tram network and building a service that will continue to meet the growing needs of the most liveable city in the world.  \n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/yong-real-estate-802596", "employer_name": "Yong Real Estate", "employer_info": "YONG Corporate Office - Pacific Centre\nYONG Real Estate relocated from the small shopping complex where the office had first opened to the new Pacific Centre building across the road. YONG established its Corporate Office in the new building and the Super Office concept that Peter Huang had envisioned was realised.\n\nThe Opening Ceremony was held to introduce both the new building and YONG Real Estate's Corporate Office to the local community. The centre was opened by Kevin Bianchi on behalf of Lord Mayor Jim Soorly, together with Gary Hardgrave, Federal Minister for Multicultural Affairs, Judy Spence, Minister for Family, Craig Emerson, Graham Quirk, and Michael Caltabiano. Since the buildings completion, the Pacific Center has won two awards including the QMBA's Award for Brisbane Region and the Award for Queensland.\n\nSource: This is an extract from the company’s own website."},
{"employer_url": "https://www.seek.com.au/companies/yarra-ranges-council-436710", "employer_name": "Yarra Ranges Council", "employer_info": "Located on metropolitan Melbourne's eastern fringe it is home to a population of 145,000. Yarra Ranges covers approximately 2,500 square kilometres and stretches from the densely populated outer suburbs up into the surrounding foothills, agricultural valleys and forested areas of the Great Dividing Ranges. It is one of Victoria's largest, most varied and scenic municipalities. It is also the largest area of any metropolitan council. There are more than 55 suburbs, townships, small communities and rural areas in the Yarra Ranges.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/yarra-community-housing-834853", "employer_name": "Yarra Community Housing", "employer_info": "Established in 1996, Yarra Community Housing Ltd (YCH) is the largest provider of community housing in Victoria. YCH is an independent, non-profit organisation that develops and manages affordable rental housing options for people on low income including families. YCH has a particular focus on providing support to people who have been homeless and experience high levels of disadvantage. \n\n \n\nIn November 2015, YCH merged with Urban Communities Limited (UCL). Until 2017, the two organisations will continue to operate as separate entities under the control of YCH. This will provide the time to work out the best way in which to combine the two operations in a way that maximises the strengths of both.\n\n \n\nIncorporating the activities of UCL, YCH has a team over 130 staff, manages approximately 2,600 tenancies, has an annual operating revenue of over $25 million, owns $300 million in affordable housing properties and has a loan portfolio of $40 million. YCH also support over 20,000 people each year that are homeless or at risk of homelessness. \n\n \n\nYCH provides housing services across Victoria as well as in Adelaide. These services include: Initial Planning & Assessment, Crisis Housing, Transitional Housing, Long term Affordable Housing and Specialist housing models – including Supportive Housing and Youth Foyers.\nSource: this is an extract from the company’s own website."},
{"employer_url": "https://www.seek.com.au/companies/yarra-city-council-802637", "employer_name": "Yarra City Council", "employer_info": "The City of Yarra is an inner metropolitan municipality which is home to a diverse community of about 80,600 people.\n\nYarra's 19.5 square kilometres include the suburbs of Abbotsford, Burnley, Clifton Hill, Collingwood, Cremorne, Fitzroy, North Carlton, North Fitzroy, Princes Hill and Richmond. Parts of Alphington and Fairfield - south of Heidelberg Road - are also included in Yarra.\n\nResidents and businesses in Yarra are represented by nine Councillors. The municipality is broken up into three geographic wards  - Langridge Ward, Melba Ward and Nicholls Ward - each of which is represented by three Councillors. \n\nYarra Council has a total capital and operating budget of $162.5 million, which is used to deliver a wide range of community services and maintain essential community infrastructure. \n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/yara-pilbara-fertilisers-813351", "employer_name": "Yara Pilbara Fertilisers", "employer_info": "Construction of the Yara Pilbara Fertilisers Pty Ltd (YPFPL) AUD$-700 million liquid ammonia plant on the Burrup Peninsula, near Karratha in western Australia, began in 2003. Production started in April 2006, and the first export shipment was made from the Port of Dampier in June 2006.\n\nThe YPFPL liquid ammonia plant was the first industrial development to be established on the Burrup Peninsula following the State Government's $200m infrastructure investment, and represents one of the largest ammonia production facilities in the world.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/yangebup-primary-school-874608", "employer_name": "Yangebup Primary School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/yandina-state-school-819434", "employer_name": "Yandina State School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/yangebup-youth-justice-service-875548", "employer_name": "Yangebup Youth Justice Service", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/yarloop-primary-school-874610", "employer_name": "Yarloop Primary School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/yangan-state-school-820497", "employer_name": "Yangan State School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/yandeyarra-remote-community-school-874606", "employer_name": "Yandeyarra Remote Community School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/yellow-cabs-434314", "employer_name": "Yellow Cabs", "employer_info": "The 50th anniversary of the founding of Yellow Cab Company was marked on March 2. Since incorporation in 1915 it has grown to become the largest, as well as the oldest taxicab firm in existence today.\n\nIt all started back in 1905 when Walden W Shaw and John Hertz became partners in an auto agency. A year later the Walden W Shaw company was incorporated and in 1907 it purchased a number of small Thomas taxicabs equipped with meters. The shaw Livery Company , a combination of several cab and livery firms, came into existence in 1910. It operated Keaton Thomas Flyers, and of all things Cadillacs as Taxicabs.\n\nNone of these met the requirements of taxi business, so a decision was made to design a special purpose car strictly for taxi use. New Year’s Eve 1914 saw the completion of the design work on the Yellow Cab Mfg. Co. Cab. The first one (Model J) hit the streets in August 1915. Prior to this the Shaw and yellow had used some 12 different makes of cars.\n\nWith the new Yellow, the company went all-out for volume business. Fares in 1915-16 were at one point reduced to 25c for the first one-half mile and 10c for each succeeding mile. Rates of the course have fluctuated through the years dependant largely upon the nations economy. In the 20’s the average one-mile ride cost ranged between 30c to 45c. At the height of the depression in 1933 the same ride charge dipped to 20c.\n\nFrom the first Yellow Cab Co. assumed the role of \"pioneer of the taxi industry\". The first major change was adoption of a distinctive colour – one that would always be recognised as meaning \"taxicab\". Yellow was selected as the result of a survey by well-known research institute. Interestingly in those years ownership of an automobile meant status. Anyone riding in an pre-yellow coloured cab might have been thought to own a car with chauffeur. But to ride in a common taxicab was not dignified at all. It took some doing , but the picture changed so that riding in a Yellow meant that – here was someone who could afford the comfort and carefree ease of a taxicab ride!\n\nAnother big Yellow first was the development and use of balloon tyres on taxicabs. The company was also the first to use automatic windshield wipers, ultrahigh frequency two-way radios and in recent years it was the first large fleet to use transistorised UHF radio, and passenger seat belts.\n\nYellow Cabs is still at the cutting edge. Recently with the introduction of a completely computerised job management and distribution system, Global Positioning System (GPS) in all cabs, Cabcall phone ordering, realtime Internet Taxi Booking System, IVR phone technology, and EFTPOS in all vehicles means that Yellow Cabs will be sure to maintain their position as market leaders."},
{"employer_url": "https://www.seek.com.au/companies/yancoal-814987", "employer_name": "Yancoal", "employer_info": "\n\n"},
{"employer_url": "https://www.seek.com.au/companies/yandaran-state-school-820564", "employer_name": "Yandaran State School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/yamatji-marlpa-aboriginal-corporation-977936", "employer_name": "Yamatji Marlpa Aboriginal Corporation", "employer_info": "As the native title representative body for the Yamatji and Pilbara regions of WA, YMAC is a not-for-profit Aboriginal corporation. We are run by an Aboriginal Board of Directors, with Regional Committees chosen by our members. Membership is open to all adult Yamatji and Marlpa people.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/yanchep-beach-primary-school-874601", "employer_name": "Yanchep Beach Primary School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/yalumba-wines-802633", "employer_name": "Yalumba Wines", "employer_info": "Yalumba. One Family, Many Stories.\n\nOur history and passion for creating great wines provides fertile territory for us to tell the many unique stories that have helped to shape Yalumba for the past 167 years.\n\nOur new communication campaign brings these stories to life within our premium portfolio of wines. “Every bottle has a story to tell” is based on the premise that behind every Yalumba wine are many great stories. You’re not only drinking a great wine, you’re also experiencing the heritage, passion and personal stories that helped to create it.\n\nThe Cooperage\n\n\nYalumba is one of only four wineries around the world to have its own cooperage, highlighting our family’s dedication to the craft of winemaking: from nursery, to oak, to bottle, to glass.\n\nSustainability\n\n\nWhen you’ve been operating in a rural environment for more than 167 years, you learn a few things about the importance of sustainability.\nSource: this is an extract from the company’s own website."},
{"employer_url": "https://www.seek.com.au/companies/yalgoo-primary-school-874598", "employer_name": "Yalgoo Primary School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/yamaha-music-australia-868257", "employer_name": "Yamaha Music Australia", "employer_info": "Yamaha Music Australia is a subsidiary of Yamaha Corporation, which was established in Japan in 1887. From its early base as a manufacturer of reed organs and pianos, Yamaha Music has grown into a multinational organisation manufacturing a broad range of sound related products.\n\n At every level from novice to professional musician the company focuses on superior quality, craftsmanship, innovative designs and value for money.\n\nYamaha produced its first amplifier for home use in 1955. Since then Yamaha has continued to expand, producing a quality range of home entertainment products that combine the latest technology and design principles.\n\nYamaha products first appeared in Australia in 1961 imported by a family-run business known as Rose Music. In 1986, Yamaha Corporation purchased Australian distribution rights for Yamaha products from Rose Music, and Yamaha Music Australia was born.\n\nToday, Yamaha Music Australia is a wholesaler of music instruments, music related equipment and home entertainment products, and a provider of music education, through the Yamaha Music Education Centre. The company places great importance on developing young musicians, and popularising music worldwide.\n\nIn the consumer electronics industry, Yamaha is synonymous with high performance and easily integrated components, providing a solution for every home entertainment system.\n\n\n\nYamaha inspires you to play, create and feel.\nSource: This is an extract from the company's own website"},
{"employer_url": "https://www.seek.com.au/companies/yale-primary-school-874596", "employer_name": "Yale Primary School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/yalgoo-health-service-874597", "employer_name": "Yalgoo Health Service", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/yale-property-solutions-813591", "employer_name": "Yale Property Solutions", "employer_info": "Yale Property Solutions is an entirely membership-based organisation dedicated to helping its members achieve their full financial potential at every opportunity.\n\nVia the assistance of our carefully selected external affiliates, we are a one stop shop for the entire property investment process.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/yakult-814213", "employer_name": "Yakult", "employer_info": "Yakult Australia Pty Ltd commenced production on the 22nd of January 1994. Australia was the first English speaking country to launch Yakult, chosen due to its close proximity to Asia. In 2004, Yakult was introduced into New Zealand. Since then, Yakult has enjoyed phenomenal market penetration and success in Australia and New Zealand. Yakult's greatest goal is to bring smiles to faces everywhere.\n\nSource: This is an extract from the company’s own website."},
{"employer_url": "https://www.seek.com.au/companies/yakima-australia-867955", "employer_name": "Yakima Australia", "employer_info": "Yakima is dedicated to creating intuitive outdoor products that harness the spirit of adventure.  Yakima is a world leader in designing and manufacturing automotive gear management and storage solutions.  \nHaving our business based in Australasia we have a unique advantage in being connected with the true spirit of our products.  Our living environment is all about beauty, outdoor enjoyment, and adventure which is reflected in our products and is our design back yard.\nAt Yakima, all employees share a strong sense of pride in the brand and a passion for creating products that get people and gear outdoors to enjoy a healthy active lifestyle.  With a strong heritage in the outdoor and automotive industries, employees appreciate the outdoor lifestyle whether they hike, bike, walk, kayak, ski, camp or garden on the weekends.  This appreciation and understanding of the end-consumer facilitate a spirit of innovation that incorporates useful consumer insights."},
{"employer_url": "https://www.seek.com.au/companies/yahoo7-434646", "employer_name": "Yahoo!7", "employer_info": "Yahoo7’s mission is to make the world’s daily habits inspiring and entertaining. By creating highly personalised experiences for our users, we keep people connected to what matters most to them, anywhere, anytime and across any device. \n\nA 50-50 partnership between the Seven West Media Group (ASX: SWM) and Yahoo Inc. (NASDAQ: YHOO), Yahoo7 combines the strengths of Yahoo’s global network with Seven West Media’s TV, magazine and newspaper brands. \n\nIn turn, Yahoo7 creates value for advertisers and partners by connecting them with the audiences that build their businesses. \n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/yaffa-media-977909", "employer_name": "Yaffa Media", "employer_info": "Yaffa Media is one of Australia’s largest independent media companies and has remained an independent operation despite significant growth and diversification over the past 85 years.\n\nYaffa consists of 28 consumer and business-to-business media brands, that are each fully integrated and collectively provide access to more than 3,000,000 obsessed readers.\n\nThese brands are made up of 28 specialist magazines spanning a dynamic and broad range of industries including fashion, advertising, healthcare, photography and natural health, market-leading websites and e-newsletters, interactive digital apps and highly engaged social media outlets. Many brands also extend to a range of industry and consumer events and exhibitions.\n\nEach title at Yaffa Media is led by a team of experts in their respective field that are dedicated to providing quality products designed to inform, entertain and inspire.\nSource: This is an extract from the company's own website"},
{"employer_url": "https://www.seek.com.au/companies/yakamia-primary-school-874593", "employer_name": "Yakamia Primary School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/yanchep-district-high-school-874602", "employer_name": "Yanchep District High School", "employer_info": null}
]