[
{"employer_url": "https://www.seek.com.au/companies/zagame-automotive-group-815043", "employer_name": "Zagame Automotive Group", "employer_info": "The Zagame brand continues to grow its passion for things that move. With some of the world’s premium marques and vehicles, the Zagame portfolio provides Melbourne with a world class automotive experience. We are dedicated to automotive excellence, constantly striving to provide superior customer service, the old hospitality way\nWith a vast selection there is no doubt that Zagame Automotive has something to suit anyone's lifestyle. It is the essence of fine motoring that makes Zagame Automotive your next shopping destination.\nZagame Automotive provides a variety of fantastic career opportunities across the business from sales staff to management. Excellent opportunities also exist for students, graduates and apprentices.\n\nWe employ, train and develop the best people to fulfill their potential and feel proud to be part of a professional team that works together to execute and deliver results within a high performance culture.\n\nOur dealership prides itself on the tenure of its employees, and strives to continually support and encourage staff development throughout their career.\nSource: This is an extract from the company's own website"},
{"employer_url": "https://www.seek.com.au/companies/zoo-advertising-802686", "employer_name": "ZOO Advertising", "employer_info": "A growing network of creative agencies owned by the people that run them.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/zomato-796734", "employer_name": "Zomato", "employer_info": "We do this by\n\nHelping people discover great places around them.\nOur team gathers information from every restaurant on a regular basis to ensure our data is fresh. Our vast community of food lovers share their reviews and photos, so you have all that you need to make an informed choice.\n\nBuilding amazing experiences around dining.\nStarting with information for over 1 million restaurants (and counting) globally, we're making dining smoother and more enjoyable with services like online ordering and table reservations.\n\nEnabling restaurants to create amazing experiences.\nWith dedicated engagement and management tools, we're enabling restaurants to spend more time focusing on food itself, which translates directly to better dining experiences.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/zouki-cafe-802685", "employer_name": "Zouki Cafe", "employer_info": "Zouki operates cafes, convenience stores and retail precincts in over 20 major hospitals across Victoria, Tasmania, the ACT and NSW.  We are widely respected for aiding the healthcare process by providing first-class cafe and retail destinations in this traditionally-sterile and stressful environment.  Serving over 40,000 customers on a daily basis, Zouki has proven the value in developing retail retreats for staff, students, visitors and patients to unwind and recharge.\n\nWe pride ourselves on providing the highest calibre of service and ambience whilst serving only the healthiest and most appetising array of international dishes. On any given day at each of Zouki’s anchor cafes, we offer over 30 varieties of hot food, plus salads, sushi, freshly-made sandwiches and focaccias, home-made soups, savoury pastries, fruit-topped yoghurts, a mouth- watering array of gateaux, sweet slices, an ever-growing range of cookies and shortbreads, ice creams, milkshakes, health smoothies, fresh juices, and enough coffee to keep an entire suburb awake for a week!\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/zodiac-group-australia-436896", "employer_name": "Zodiac Group Australia", "employer_info": "Zodiac Group Australia is the leading supplier of pool equipment and products in the nation.\n\nYou can trust our reputation for quality and reliability. Zodiac has over 25 years’ experience providing innovative and user-friendly products and service to enrich your lifestyle. You’ll have complete peace of mind with our efficiency guarantee and the most extensive technical and after-sales care available.\n\nYou know you’re getting quality advice from trained experts when you purchase from authorised Zodiac professionals.\n\nZodiac Group Australia is a proud long term sponsor of Swim Australia, the leading peak authority for learn to swim centres in Australia.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/zoos-victoria-436620", "employer_name": "Zoos Victoria", "employer_info": "Vision\n\nOur vision is to be the world’s leading zoo-based conservation organisation.\n\nMission\n\nOur mission is to galvanise communities to commit to the conservation of wildlife and wild places. We will achieve this by connecting people and wildlife in the following ways:\n\nOpening the door by providing exceptional wildlife encounters that reach beyond the boundaries of our campuses\nLeading the way by communicating and demonstrating the role of conservation and research in all we do\nCatalysing action through inspiring experiences that motivate participation, leading to conservation and sustainability outcomes\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/zte-434690", "employer_name": "ZTE", "employer_info": "ZTE Corporation is a globally-leading provider of telecommunications equipment and network solutions. With operations in 160 countries, the company is a leader in technology innovation, delivering superior products and business solutions to clients all over the world. Founded in 1985, ZTE is listed on both the Hong Kong and Shenzhen Stock Exchanges and is China’s largest listed telecoms equipment company.\n\nZTE has the most complete telecommunications product line in the world, covering every vertical sector of wireless networks, core networks, access & bearer networks, services and terminals markets. \n \nWith its independent and creative R&D capability and customer-oriented and market-driven strategy, ZTE is capable of developing and producing market-leading, first-class technologies in wireless, switching, access, optical transmission, data, handsets and telecommunications software. ZTE uses this expertise to provide end-to-end solutions tailored to the specific needs of customers around the world. \n\nSource: this is an extract from the company’s own website"},
{"employer_url": "https://www.seek.com.au/companies/zircodata-433542", "employer_name": "ZircoDATA", "employer_info": "ZircoDATA is recognised as a leading provider of information management solutions to the Australian market. With a range of services covering records management, document management, vital records archive storage, data protection services and document destruction in Australia, the ZircoDATA team of experienced industry leaders has a vision to transform and elevate the information management industry, allowing you to harness the power of your information. Source: this is an extract from the company’s own website."},
{"employer_url": "https://www.seek.com.au/companies/zippy-cleaning-and-maintenance-861329", "employer_name": "Zippy Cleaning and maintenance", "employer_info": "About Us\nOur History & Culture\nEstablished and founded in 1985 by the John and Olga Chiabrera, Zippy Cleaning & Maintenance Services has grown from a family home-based business into a Company of significant size with a known reputation for providing outstanding services in the commerical cleaning sector.\n\nNow operating with a significant team base, Zippy Cleaning & Maintenance is certain that our experience and expertise can benefit your business to achieve peace of mind cleanlines.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/zip-industries-834728", "employer_name": "Zip Industries", "employer_info": "Aussie through and through\n\nZip Industries is a privately owned, proudly Australian business that has been manufacturing and marketing Australian designed and made instant water systems since 1947.\n\nHeadquartered in Sydney, Zip has offices in Canberra, Melbourne, Brisbane, Adelaide, Perth, Darwin and Townsville. A network of more than 300 trained service technicians provides installation, maintenance and service nationwide.\n\nIt all started in 1962\n\nMichael Crouch AO acquired a small Sydney manufacturer of kitchen and bathroom heaters called Zip heaters in 1962. He saw potential in the small company and set about innovating and expanding operations.\nBoiling water. Refreshed.\n\nDuring the 1960s Zip expanded its range of over-sink boiling water heaters catering to canteen, restaurant, factory and office kitchens. This didn’t just change the way we all do business, it changed the way we drink water. No more sitting by the kettle, no more waiting for a coffee.\n\nConnected by water\n\nBefore long, Zip over-sink boiling water heaters were sold in more than 70 countries around the world.\n\nZip continued to evolve, innovate and refresh how we drink water.\n\nThe world’s first boiling water tap\n\nIn 1970, Zip installed the world’s first boiling water faucet. This provided instant boiling water from an under-sink pressurized cylinder.\nOn wall instant water heaters\n\n \n\nIn 1975, Zip introduced the first on-wall instant boiling water heaters with enhanced energy efficiency and an increased capacity.\n\n \n\nThe Zip Miniboil \nZip developed the innovative Zip Miniboil. The first truly small on-wall instant boiling water heater, it was a practical, space-saving addition to smaller homes and offices.\n\nThe Zip Tea Tap\n\n The Zip Tea Tap is an under-sink, non-pressurized instant boiling water system that delivers water within one degree of boiling point at the touch of a button.\n\n By 1985 the revolutionary Zip Tea Tap was so well accepted in Australia that it was specified for all of the kitchens and Members’ offices in the new Parliament House in Canberra.\nThe Zip HydroTap®\nZip introduced air-cooled Zip HydroTap under-bench filtered instant boiling water systems in 1996.  These dispensed filtered chilled drinking water from a single touch-button electronic tap.\n\nThe Zip HydroTap All-In-One\n\n In 2012, Zip launched the amazing Zip HydroTap All-In-One, which dispenses boiling, chilled and sparkling filtered water plus hot and cold water, from a single outlet.\n\n\nAnd they still do today.\nThe Zip HydroTap G4 \n\n The new Zip HydroTap G4 features amazing Zip 0.2 micron filtration and delivers boiling, chilled and sparkling water instantly. The Zip HydroTap G4 All-in-One model even dispenses regular hot and cold water from the same outlet.\nThe Zip Design Range \n\n The beautiful new Zip HydroTap Design Range boasts three contemporary designs to suit even the most modern décor; available in Arc, Cube and Elite styles. The HydroTap Celsius range also features a mixer tap, dispensing hot and cold water from the one elegant Arc or Cube tap.\n\n\nExperience The Zip Effect.\n\n\n\n\nIt’s Water. Refreshed.\n\n \n\nZip Industries\n\n Zip distributors have been appointed in Singapore, Taiwan, the Philippines and Thailand to cover South-East Asia. A wholly owned subsidiary was established to handle UK distribution and a distributor for Europe was appointed in 2002. A Zip subsidiary to handle distribution in New Zealand was established in 1996. A joint venture partner in South Africa handles African distribution.\n\n In the United Kingdom, Zip has customer service offices in London, Birmingham, Manchester and at Dereham, Norfolk, plus warehousing at Dereham and manufacturing facilities at Southport, Merseyside. In New Zealand, Zip trades as Zenith Heaters, with a customer service office in Auckland. Zip distributors are located in Europe (Germany), South Africa, mainland China, Hong Kong, Singapore, Philippines, Cyprus, Papua New Guinea, Taiwan and Thailand.\n\n In December 2013, Quadrant PE acquired a majority share holding in Zip Industries. Quadrant will partner with the existing management team and the founder Michael Crouch will retain a minority shareholding.\nSource: this is an extract from the company’s own website."},
{"employer_url": "https://www.seek.com.au/companies/zingaras-kitchen-813934", "employer_name": "Zingara's Kitchen", "employer_info": "Zingara's Kitchen is a new mediterranean style casual dining restaurant with multiple locations throughout Brisbane, the Gold Coast and Victoria.\n\nZingara's Kitchen is an oasis of contemporary mediterranean cuisine. The region's rich diversity of cultures has influenced the melting pot of flavours and tastes that has inspired our menu. At Zingara's Kitchen we believe that sharing and enjoying a meal with family and friends in a warm, inviting atmosphere is a celebration of both food and life itself. \n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/zinfra-434465", "employer_name": "Zinfra", "employer_info": "Zinfra is a leading service provider to the utility infrastructure, transport, defence and renewable energy sectors.  We deliver a comprehensive range of engineering, operations, maintenance and construction services nationally. Our services include engineering and design, project management, construction, civil, maintenance and asset operations.  We employ approximately 1,500 people, have a strong national footprint and are backed by the vast strength and resources of our parent company. Source: this is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/zimmer-814276", "employer_name": "Zimmer", "employer_info": "Zimmer is a worldwide leader in musculoskeletal health care and has been since our founding more than 80 years ago.\n\nToday, our global team of more than 8,500 employees works to provide effective, creative solutions that support orthopaedic surgeons and clinicians to restore mobility and treat arthritis and traumatic injuries. Our joint replacement technologies and a wide range of related products and services make us valuable partners to health care providers in more than 100 countries.\n\nWe're building on a strong history of success to enhance the value we provide to our partners in musculoskeletal health care. Zimmer maintains world-class scientific facilities and resources and collaborates with leading clinicians and researchers around the world. We share a commitment with health care providers to find the best technologies, treatments and solutions to deliver high quality, cost-effective orthopaedic care.\n\nThose who join our team find a stimulating work environment focused on being the best - designing and building the best possible systems and delivering the most robust package of value-added services to our customers. They also become part of a company with a heritage of leadership, a focus on the future and a global presence in an exciting and rewarding medical field.\n\nWe hope you'll spend a few minutes exploring our website and getting to know the Company. Thanks again for your interest in Zimmer.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/zimmermann-813260", "employer_name": "Zimmermann", "employer_info": "ZIMMERMANN Headquarters are located in Sydney, while we also operate offices and showrooms in New York, Los Angeles, London and Paris. We are always looking for talented and creative people from around the world to join our teams in Australia, the USA and elsewhere. At ZIMMERMANN we have a vision to create high performing teams, and rewarding their achievement and creativity. Source: this is an extract from the company’s own website."},
{"employer_url": "https://www.seek.com.au/companies/zumtobel-group-815011", "employer_name": "Zumtobel Group", "employer_info": "About us\nThe Zumtobel Group is an international lighting group and a leading player in the field of innovative lighting solutions and components. With its three internationally established brands, Thorn, Tridonic and Zumtobel, and its two smaller brands, acdc and Reiss, the Group offers its customers around the world a comprehensive range of products and services. In the lighting business the Group with its Thorn, Zumtobel and acdc brands is the European market leader. The Reiss brand supplies OEMs with luminaires with a higher degree of protection. Through its lighting components brand, Tridonic, the Group plays a leading role worldwide in the manufacture of hardware and software for lighting systems (LED light sources and LED drivers, sensors and lighting management).\n\nSource: This is an extract from the company’s own website."},
{"employer_url": "https://www.seek.com.au/companies/zillmere-state-school-819737", "employer_name": "Zillmere State School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/zepel-fabrics-815093", "employer_name": "Zepel Fabrics", "employer_info": "Since our humble beginnings in 1978 as a family company, we have grown to become one of Australia’s leading fabric wholesalers. Once labelled \"the king of velvets\" we have evolved considerably, but the old fashioned values underpinning our success remain today.\n\nWe are now led now by the family’s second generation and we have always been passionate about solving fabric challenges.  What enable us to do this is our boutique offer, highly personalised service, an extensive range and an uncompromising eye for quality.\n\nArchitects and designers, decorators, manufacturers and homemakers, you’re bound to find the fabric you’re looking for here. With one of the largest collections available in Australia, our A to Z range covers a gamut of colours, patterns and textures in high quality velvets, jacquard fabrics, printed jacquards, sheers and upholstery fabrics for both residential and commercial applications.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/zeus-street-greek-814788", "employer_name": "Zeus Street Greek", "employer_info": "Socrates… Plato… Aristotle… These are a few of our forefathers. When we look back at their ancient wisdom we donʼt see the past, we see the future. A place where strangers are loved with a generosity of spirit, and where kindness is served up for all to share. \nSo welcome to our home.\nWelcome to ʻthe philosophy of foodʼ\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/zervos-lawyers-802679", "employer_name": "Zervos Lawyers", "employer_info": "Intellectual Property and Trade Marks\n\nOur clients are encouraged to recognise the importance of trade marks to their business as valuable assets that enable consumers to distinguish their goods and services from their competitors.\n\nThe most effective way to protect your trade mark is to register it wuth IP Australia or with the appropriate international trade marks office. \n\nZervos Lawyers acts for a variety of business of all different sizes in various markets under this area of law. Our clients include providers of goods and services such as restaurants and home ware manufacturers and retailers.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/zensar-technologies-434109", "employer_name": "Zensar Technologies", "employer_info": "\n\n"},
{"employer_url": "https://www.seek.com.au/companies/zenithoptimedia-814390", "employer_name": "ZenithOptimedia", "employer_info": "We’re ‘The ROI Agency’\n\nWe were the first agency to apply a rigorous and objective approach to improving the effectiveness of marketing spend.\n\nWe did this because we knew it was our clients’ number one priority, and we called it ‘Return on Investment’ or ‘ROI’.\n\nOur pioneering expertise in this area has driven our success, and underpinned our growth. As the world continues to change, the approach to marketing has to change too. Digital and online media have dramatically increased the ways consumers can see, touch and buy brands, and opened up thousands of new opportunities – and risks – for the owners of those brands.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/zinc-group-995333", "employer_name": "Zinc Group", "employer_info": "We’re ALL in\nHalf measures? Never heard of them.\nWe’re passionate, proactive and pumped about delivering for clients, \nhelping out a team mate or rolling up our sleeves to make a difference.\nWe believe success should be shared and team work is the answer.\nAre you in?\n\nWe’ll have some \nSERIOUS fun!\nWe love what we do and do what we love!\nWe’re the same people at work as we are on the weekend.\nWe work just as hard at having good times as we do at doing a great job.\nWe live for the \nWHO? WHAT? WHY? WOW\nWe’re a curious lot. We’ve learned that great answers come from asking the right questions.\nThat unearthing knowledge is a challenge not a chore.\nThat interrogation leads to innovation.\nAnd that to stand apart, you’ve got to shake things up a little.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/zendesk-814757", "employer_name": "Zendesk", "employer_info": "In the beginning\n\nZendesk was started in a Copenhagen loft by three friends who used an old kitchen door as a desk. They wanted to bring a bit of zen to the chaotic world of customer support. And they wanted to do it with software that was nice to look at and easy to use.\nToday we're different, but still the same\nSince then, the company has grown. The software is now built all over the world, by a growing group of talented, charming people. The offices are bigger and we have real desks, but we’ve held on to the spirit with which we began: be genuine, listen to customers, and keep it beautifully simple.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/zeehan-primary-school-874672", "employer_name": "Zeehan Primary School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/zenith-pacific-868237", "employer_name": "Zenith Pacific", "employer_info": "​​Zenith Energy is one of Australia’s leading Independent Power Producers, specializing in delivering reliable, cost-effective power generation solutions primarily in remote areas in Australia and South East Asia.\nOver the past 30 years, the company’s principals have played leading roles in the design, installation and management of more than 60 off-grid power generation plants, primarily – but not exclusively – for clients in the Australasian resource sector.\n \n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/zucci-hairdressing-977864", "employer_name": "Zucci Hairdressing", "employer_info": "We live in a weirdly wonderful age of updating statuses and scrolling through tweets, where people are almost always sharing some version of themselves. Whether through signs, symbols, looks or language, it’s gloriously inescapable.\n\nAt Zucci, we understand the importance of communication. More importantly, we get that when you express yourself, you want to express exactly that. We know the way you look impacts upon the way you feel – that perfect colouring can make everything rosy, that great cut can grow confidence.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/zilzie-wines-437976", "employer_name": "Zilzie Wines", "employer_info": "As a family we appreciate the simple things in life, and it's all about good times, but we take our winemaking very seriously.\nAlong with our dedicated team, we are passionate about crafting great wines at prices that won't break the bank, offering our consumers wines that constantly surprise and delight.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/zara-432660", "employer_name": "Zara", "employer_info": "Zara is one of the largest international fashion companies. It belongs to Inditex, one of the world’s largest distribution groups.\nThe customer is at the heart of our unique business model, which includes design, production, distribution and sales through our extensive retail network.\nFor more information, please visit the Inditex Group website: www.inditex.com\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/zurich-financial-services-435108", "employer_name": "Zurich Financial Services", "employer_info": "\n\n"},
{"employer_url": "https://www.seek.com.au/companies/zaparas-lawyers-802670", "employer_name": "Zaparas Lawyers", "employer_info": "We’re here for you\nZaparas Lawyers are personal injury experts in WorkCover, TAC, Public Liability, Superannuation and Asbestos related claims. We believe in a society where all individuals have appropriate redress when they suffer an injury.\nAll people should feel comfortable and confident when engaging legal representation, and through intensive application of the law and a service based on accessibility, caring and transparency, we aim to ensure that this is the case.\nBy providing the best advice, we will achieve the best results, doing everything possible to maximise fair and just compensation for our clients.\nWe take time to ascertain and understand the emotional and financial circumstances of each individual we represent, and proceed in a manner that is attentive, respectful and considerate of their wellbeing.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/zap-fitness-438176", "employer_name": "Zap Fitness", "employer_info": "We’re Australian\nWe’re a home-grown concept and Australia’s fastest growing, fully-owned 24 hour gym chain… so our members get all the benefits: no joining fees; no lock-in contracts, cancel any time; low prices; world class Precor and Life Fitness equipment and functional fitness zones; lifetime price guarantee while you remain a member; an exclusive security and access system; and use all our gyms free of charge. Just Zap into your own fitness world day or night.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/zanui-437249", "employer_name": "Zanui", "employer_info": "Zanui is Australia's online destination for furniture and homewares. We provide consumers with stylish new products for home, inspiration and ideas for home decoration and unmatched customer service.\n\nAt Zanui, we are committed to offering the highest quality products, the widest product range in Australia and a formidable selection of brands that will transform your home.\n\nDecorating your home should be fun and, at Zanui, we know that your shopping experience should be, too! With our seamless and user friendly online shop and our world class customer service team, we ensure that your home decorating experience is easy, enjoyable and inspiring.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/zarraffas-coffee-433970", "employer_name": "Zarraffas Coffee", "employer_info": "Zarraffa’s Coffee was founded in 1996 by Kenton and Rachel Campbell. The company is proudly 100% Australian owned with its head office based on the Gold Coast.\n\nZarraffa’s (pronounced Za-raff-as) comes from the Arabic word ‘Zarafa‘ which means ‘Giraffe’ and the Masai Giraffe typically inhabits the savannahs of Kenya and Ethiopia, the origin of coffee.\n\nFrom a single store in Southport on the Gold Coast, the Zarraffa’s Coffee business has evolved into an award-winning enterprise, now serving customers in close to 70 locations across Queensland, Western Australia and New South Wales.\n\nLeading the way in retail coffee innovation Zarraffa’s Coffee developed its popular drive thru store concept in 2010, providing customers with quality coffee and added convenience.\n\nThe company’s expansion to the West Coast in 2012 enabled Zarraffa’s to introduce its unique blend of coffee to a whole new region of coffee lovers.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/zamels-434048", "employer_name": "Zamels", "employer_info": "Because Zamel’s is owned by an international diamond company, we have access to an incredible range of diamonds and diamond jewellery.\n\nIn fact, we have one of Australia’s largest range of solitaire diamonds at different price points.\n\nAnd, because there’s no middle man, you can enjoy quality diamond jewellery for less than you might expect.\n\nThis goes beyond just our diamond jewellery, to all of our collections.\n\nWhether it’s gold or silver, gemstones or timepieces, when you shop with Zamel's you will discover the benefits are brilliant.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/zagames-436619", "employer_name": "Zagames", "employer_info": "The Zagame name is synonymous in Australia with family dining and entertainment and more recently with the ultimate in family holiday experiences. Beginning in 1971, when Victor Zagame opened the first Zagame’s Hotel and reinvented the family dining and entertainment experience in Australia, the Zagame family has built an unrivalled reputation for high quality menus and great service in top notch family environments.\n\nWhat started out over 40 years ago as Victor’s dream to serve quality food at a good price and in elegant family-friendly surrounds, has grown into a fully-fledged family, hospitality dynasty – the Zagame Corporation.\n\nToday Zagame’s has grown to include a number of restaurants, bars, hotels and family friendly bistros, primarily in Victoria, The Grand Hotel and Casino in Vanuatu. Led by Victor’s sons – Victor Jnr and Robert - the company also has a dynamic property arm which continues to look for investment and development opportunities in the property market both here and overseas. Robert Zagame has branched out into fashion with the launch of his own fashion label – Robb and Lulu – while Victor Jnr has found his passion racing Porsches on the professional circuit.\n\nSource: This is an extract from the company’s own website."},
{"employer_url": "https://www.seek.com.au/companies/zarb-road-transport-977641", "employer_name": "Zarb Road Transport", "employer_info": "Zarb Road Transport Pty Ltd (ZRT) is a friendly family owned business which has been operating in the Mackay district since 1966. The company has strong ties with the local sugar industry and strives to continually strengthen that relationship. The local sugar industry has been established in the Mackay region for in excess of 100 years. The sugar industry has received our support since 1966 just as the sugar industry has supported ZRT since 1966. We aim to share this support for many more years to come. Our operations are all within the local district from Sarina to Wagoora and we guarantee that employees will see their families every day. The strength of the sugar industry offers a good job security for employees.\n\nSource: This is an extract from the company's own website."}
]