[
{"employer_url": "https://www.seek.com.au/companies/v-com-834365", "employer_name": "V Com", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/ventura-home-group-813686", "employer_name": "Ventura Home Group", "employer_info": "Ventura Home Group is a proudly Western Australian owned family home building company. Since our founding in 1993, we’ve grown significantly, building on our widely recognised reputation for excellence in home design, construction and customer service. As of January 2014, we remain the second highest volume builder in Western Australia.\nWith five specialist divisions, VHG provides residential building solutions across the largest of Western Australia’s market segments. Each year our team builds over 1,000 homes for customers from all over Western Australia; from first homes, two-storey family homes to multi-site developments.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/ventura-bus-lines-814394", "employer_name": "Ventura Bus Lines", "employer_info": "\n\n"},
{"employer_url": "https://www.seek.com.au/companies/vemco-group-436451", "employer_name": "Vemco Group", "employer_info": "We provide solutions for key industry issues, successfully fulfilling many\nlarge and small contracts for Australia’s largest utility and infrastructure\ncompanies, across every state and territory.\n\n\nWe provide a diverse range of services to power utilities, infrastructure contractors, land developers, clean energy and co-generation development companies, councils, road, rail, water, gas, mining, electrical asset owners, and telecommunications companies.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/veda-433872", "employer_name": "Veda", "employer_info": "Veda is a data analytics business. As the leading provider of credit information and analysis in Australia and New Zealand, we act as the conduit between the data that we accumulate, and the insights that this data provides for our customers. The result of this process is empowerment. Our goal is to empower every one of our customers to make proactive, responsible and informed decisions, based on the insights we can provide.\n\nOur core product offering includes the provision of credit reports in relation to individuals and businesses. From our core credit bureau business, Veda has expanded to deliver a suite of credit and other analytical products targeted to specific industry segment needs. Veda's data includes credit information on around 20 million individuals and 5.7 million commercial entities in Australia and New Zealand."},
{"employer_url": "https://www.seek.com.au/companies/vemag-australia-983911", "employer_name": "Vemag Australia", "employer_info": "We sell, service and support a wide range of food processing and packaging machinery across Australia.\n\n​ \n\nWith our selection of exclusive machinery partnerships we have the ability to offer your company an equipment solution, whether it be a standalone processing option or a complete production line from processing to packaging. \n\n​\n\nServicing all of Australia, we also offer you a high level of customer service and maintenance. \n\n \n\n​\n\nTo see the wide range of products we offer please visit our Equipment Range. Catering from the largest to the smallest companies, Vemag Australia can provide your company with timely and cost-effective business solutions. \nVemag sales and maintenance is performed by highly trained technicians and is available to all locations Australia wide and New Zealand.\n\n\n\nYou will be provided with technical support by food industry specialists, with the backing of servicing and spare parts to obtain minimum production down time.\n\n\n\nOur technicians regularly attend specialized training courses provided by our suppliers to ensure they are kept up to date and in the forefront of the latest technology.\nSource: This is an extract from the company's own website"},
{"employer_url": "https://www.seek.com.au/companies/velrada-814062", "employer_name": "Velrada", "employer_info": "We're here to make a difference.\nOur vision is to be the region's leading transformational consulting company where clients come to drive immense value from system, organisation, and process change. Since commencing operation in 2009 we've established a strong track record of delivery across a range of industries and programs of work, growing to more than 80 consultants and servicing clients around Australia and the region.\n\nWe're here to make a difference – to our clients, our people and our company.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/veeam-software-874710", "employer_name": "Veeam Software", "employer_info": "This transformation is enabled by Veeam Availability Platform for the Hybrid Cloud delivering the next generation of Availability for the Always-On Enterprise™, and providing businesses and enterprises of all sizes with the means to ensure Availability for virtual, physical, and cloud-based workloads through the following capabilities: \n◾Enterprise Continuity: Recovery Service Level Objectives of less than 15 minutes for ALL applications and data; automated Disaster \nRecovery (DR) orchestration\n◾Workload Mobility: Availability for workloads across any cloud or location, to maximize IT investments and increase flexibility\n◾Compliance & Visibility: Proactive monitoring, reporting, testing and documentation to ensure business and regulatory requirements are met\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nSource: This is an extract from the company's own website"},
{"employer_url": "https://www.seek.com.au/companies/vege-rama-983831", "employer_name": "Vege Rama", "employer_info": "HEALTHY CHOICE EXPERIENCE\nFood is the centre of everything. Food reflects care, love and honesty. It brings warmth and happiness. It builds connections and strengthens bonds. We believe in practicing food-centred mindfulness that extends beyond the plate.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/vectra-corporation-983806", "employer_name": "Vectra Corporation", "employer_info": "Vectra is a Cyber Security solutions and services provider that helps business fight cyber crime, protect data and reduce security risk. We understand the challenges faced by businesses to reduce risks in the face of ongoing cyber security threats.\n\nOrganisations are questioning their cyber security posture. Are we secure? What are our risks? What would we do if we were breached? How resilient are we in the event of an attack?\n\nVectra takes a business-focused approach identifying the risks that threaten an organisation by implementing strategies and solutions to combat cyber security threats.\n\nVectra’s cloud based offerings, professional security services and integrated technologies help organisations manage compliance, protect data and reduce security risks. By engaging our team of security professionals your organisation will fortify its cyber defences, improving your ability to detect and respond to emerging threats.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/vuly-860979", "employer_name": "Vuly", "employer_info": "Our Mission\n\nContribute to the world by making healthy play both safe and fun - encouraging a better lifestyle for humanity.\n\n\nEnergetic and forward-thinking: that's Vuly and those who work here too!\n\nVuly's sophisticated Warehouse and Distribution Centres dispense the magic of Vuly across Australia. Our racking system boasts several thousand pallet locations in Brisbane alone. \nFounded in 2008 by Joe Andon – and based in Brisbane, Australia – Vuly has been at the forefront of global developments in trampolining.Source: this is an extract from the company’s own website."},
{"employer_url": "https://www.seek.com.au/companies/vaughan-constructions-801855", "employer_name": "Vaughan Constructions", "employer_info": "For more than six decades, Vaughan Constructions has been influencing the landscape of Australian architecture and building history. Renowned as one of Australia’s most respected industrial and commercial builders, Vaughan’s approach is to focus on building customers for life. Two of every three projects we develop in fact are from returning clients; this success rate validating our approach to what we do.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/vault-protective-security-services-801856", "employer_name": "Vault Protective Security Services", "employer_info": "Vault Protective Security Services objective is commitment to customer service and satisfaction. This is achieved through a combination of identifying and understanding the needs of the customer and a commitment to exceed those needs by surpassing the customers’ expectations using innovative security strategies.\n\n\nVault Protective Security Services prides itself on supplying professionally trained and licensed people. We also understand that in the competitive market place a high quality security service at a reasonable cost must still reflect the need to provide well trained, highly motivated personnel and reliable equipment, if the customers’ security needs are to be met.\n\nOur personnel understand that they act as ambassadors for the customer and that their conduct reflects accordingly. We believe that continuous improvement assessed by key performance indicators and service analysis is essential in establishing a long term and successful partnership.\n\nAs Vault Protective Security Services continues to establish itself in the industry as the leading provider of tailored quality security services to its clients, we believe our contribution to the reputation of our venues will assist your establishment’s growth.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/vecci-435461", "employer_name": "VECCI", "employer_info": "The Victorian Chamber of Commerce and Industry is the peak body for business in Victoria, informing and servicing more than 15,000 members, customers and clients around the State.\n\nOur focus is on leading business into the future. We are committed to being the voice for business, representing and championing our members in a difficult regulatory environment.\n\nOur success over more than 160 years is built on consistently providing leadership, information, representation and networking opportunities to businesses across the State.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/vdm-group-434006", "employer_name": "VDM Group", "employer_info": "VDM is an operationally diverse company operating in a range of sectors across the globe. VDM is named for Van der Meer, the surname of the company’s founder, who established the original business in 1978.\nThe company grew steadily before a period of rapid expansion beginning in 2004, during which time VDM acquired two Western Australian construction companies. These were the first of a number of strategic acquisitions designed to enhance the company’s capabilities in order to meet the needs of the rapidly expanding mining, oil and gas industries. In 2006 VDM Group listed on the Australian Stock Exchange, enabling the injection of additional capital towards company expansion. VDM acquired several WA and Queensland-based engineering consultancies, bolstering the company’s presence in key resources markets.\n\nSource: This is an extract from the company's own website"},
{"employer_url": "https://www.seek.com.au/companies/vector-arena-435844", "employer_name": "Vector Arena", "employer_info": "Vector Arena is located in Mahuhu Crescent on the edge of the CBD. It is both accessible and highly visible from Beach Road and Quay Street and within easy reach of public transport, hotels, and restaurants. \nNo two events are the same, and as Vector Arena is the most flexible indoor venue in New Zealand, capable of being reconfigured into numerous modes to suit the needs and capacities of different events. \nWe have several versatile spaces which can be adapted to your specific needs. They are tastefully decorated in their own right but we welcome your own themes and branding requests, and we're happy to help you arrange this as required.  \nSource: This is an extract from the company's own website"},
{"employer_url": "https://www.seek.com.au/companies/vulcan-mining-801919", "employer_name": "Vulcan Mining", "employer_info": "Vulcan is the world’s premier 3D mining software solution. Vulcan users can validate and transform raw mining data into dynamic 3D models, accurate mine designs and operating plans.\nBundle packages are available for each specific mining scenario and can be customised with different modules for all stages of the mine’s life cycle, creating the total solution for mining companies worldwide.\n\nSource: This is an extract from the company’s own website."},
{"employer_url": "https://www.seek.com.au/companies/vulcan-engineering-801918", "employer_name": "Vulcan Engineering", "employer_info": "OUR COMPANY\nFounded in 1983 as a steel fabrication company, Vulcan Engineering has become a highly experienced and diversified construction company specialising in three main disciplines:\n\nCranes & Heavy Haulage\nWorkshop Fabrication\nSite Construction\nWith a strong background in the construction industry, Vulcan Engineering’s management team combine the above three disciplines to provide clients with a one-stop shop facility, eliminating the interfacing that causes expensive down time periods on projects.\n\nAlternatively, these departments are willing to carry out project works within their own departments. Therefore Vulcan Engineering will take on fabrication only packages or erection only packages.\n\nThe three department profiles and previous project experience is detailed on the link pages.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/voyages-indigenous-tourism-australia-437144", "employer_name": "Voyages Indigenous Tourism Australia", "employer_info": "Voyages Indigenous Tourism Australia is owned by the Indigenous Land Corporation (ILC). Find out about our strong commitment to social responsibility in Our Vision and the projects funded by our Mutitjulu Foundation.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/vue-group-985307", "employer_name": "Vue Group", "employer_info": "Vue Group is an international production company based in Western Australia’s South West and Melbourne. Founded in 1989 by Alan Lindsay and Helen Clucas, the company creates feature films, television and Internet drama, animation, documentary and large format themed 4D cinema.\n\nChina is a special focus for us. Our mission is to be valuable strategic collaborators with China’s innovative producers building strong brands and international recognition. Our production facility is strategically positioned in Australia’s South West within the same timezone as China. Managing Director Alan Lindsay is in Shanghai and Beijing every few weeks engaged in projects with our established joint ventures and building new relationships with private companies and government agencies who appreciate our experience, access to funding and our respect for the China industry and its creativity. Engagement with China has earned Vue Group Western Australia’s top Creative Industries Export Award.\n\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/vue-de-monde-436360", "employer_name": "Vue de Monde", "employer_info": "Originally housed in a quirky terrace building in Drummond Street Carlton, Vue de monde relocated in 2005 to the historic Normanby Chambers in Melbourne’s central business district. Evolving from a classical French style restaurant with a niche following, the move signified a shift in direction, with a focus on the theatrical and the dedication to dining as an experience. Vue de monde was lauded in its original location, including chef/owner Shannon Bennett being awarded the Australian Gourmet Traveller's inaugural 'Best New Talent' Award in 2003. It was the move to the new premises that Vue de monde achieved widespread critical acclaim and international recognition, including a then unprecedented 19/20 from The Age Good Food Guide.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/vault-systems-983773", "employer_name": "Vault Systems", "employer_info": "Vault Systems (Vault) is an Australian-owned and operated company that is dedicated to providing cloud services to the Australian Government and its partners with an emphasis on security. \nVault Systems is an Australian company that delivers fully compliant, risk assessed, ASD and IRAP certified Government Community Cloud to Australian federal, state and local government agencies and their partners. \nVault’s full-service offering has everything you need to get to the cloud securely and reliably. Whatever your specific requirements, we can tailor an appropriate solution. \n\n\nVault Systems is an Australian owned and operated company that offers a virtual private hosting service with an emphasis on security.\n\nVault Systems have designed, built and deployed an OpenStack Certified Government Community Cloud that is IRAP assessed and compliant to the classification level of Protected (ASD Certified Cloud Services).\n\n\n\nVault delivers a flexible, secure and scalable platform, without the costs and risks associated with traditional infrastructure.\n\nVault values our environment; our data centres have Leadership in Energy and Environmental Design (LEED) Gold Rating as a minimum.\n\nOur rapidly expanding team is always on the lookout for new talent, get in contact\nSource: This is an extract from the company's own website"},
{"employer_url": "https://www.seek.com.au/companies/voyages-hotels-and-resorts-806624", "employer_name": "Voyages Hotels & Resorts", "employer_info": "Voyages Indigenous Tourism Australia is owned by the Indigenous Land Corporation (ILC) and manages tourism and resorts in the Northern Territory (Ayers Rock Resort), Western Australia and Tropical North Queensland on their behalf.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/vopak-australia-861334", "employer_name": "Vopak Australia", "employer_info": "Strategically located tank terminals and state-of-the-art technologies are important assets, but it is our people who make the true difference. We continuously invest in the training and development of our employees, to improve their career possibilities and their dedication to Vopak’s strategic goals. All over the world our customers can count on the talent and commitment to service of dedicated professionals.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/voyager-travel-799524", "employer_name": "Voyager Travel", "employer_info": "ATPI Voyager\nATPI Voyager is part of a multinational corporate travel management company. Our business clients range from oil companies to major retailers, construction to technology and sports to finance. We offer you state of the art booking systems, a high quality personal service and superb buying power ensuring your travel dollar goes that much further. Find out more about our our products and solutions.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/voodoo-creative-985240", "employer_name": "Voodoo Creative", "employer_info": "Strategy, executed brilliantly\n\nOur tagline is what we live by. We pride ourselves on understanding the problem you have, what you’re striving to achieve and the intended user or audience. This understanding allows us to take a strategic approach to the development of effective creative and technical solutions.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/volvo-group-australia-434366", "employer_name": "Volvo Group Australia", "employer_info": "Volvo Group Australia is a leading provider of heavy transportation equipment services, suppling the Australian, New Zealand and  Pacific Island markets. With our head office and manufacturing facility in Brisbane, and several locations across Australia, our business represents Volvo, Mack, UD and Renault trucks as well as Volvo Penta, Volvo Construction Equipment, Volvo Bus and Volvo Financial Services. Our vision is to be the most desired and successful transport solution provider in the world. We also aspire to be the most admired employer in our industry and we are committed to providing a challenging and dynamic work environment with extensive opportunities for our people, both  here and overseas. At Volvo Group, our customers are at the center of everything we do, we aim to drive prosperity and to deliver on our commitments. We have trust in each other and the courage to act, and we continually seek new opportunities to stay ahead. Diversity strengthens us and our expertise, passion and intuition ensure our ongoing success."},
{"employer_url": "https://www.seek.com.au/companies/volunteer-task-force-816906", "employer_name": "Volunteer Task Force", "employer_info": "Volunteer Task Force (VTF) has been serving the community since 1970. Our mission is to deliver services that support independence, enhance safety and amenity of people, and to build community through volunteering.\nOur services are aimed at supporting those who have difficulty with everyday tasks due to frailty or disability. We take an enablement approach with a focus on providing services “with” a person and not “for” or “to” a person.\nWe  work in partnership with people and their carers to increase independence and physical and social wellbeing.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/volkswagen-financial-services-834386", "employer_name": "Volkswagen Financial Services", "employer_info": "Volkswagen Financial Services Australia is a wholly-owned subsidiary of Volkswagen Financial Services AG, headquartered in Braunschweig, Germany. \n\nThe primary objective of Volkswagen Financial Services Australia is to offer competitive Finance and Insurance products to over 700 retailers. Representing automotive brands, within the Volkswagen Group, including Volkswagen Passenger and Commercial Vehicles, Audi, ŠKODA, Bentley and Lamborghini. We've financed over 1.9 million new and used cars.\n\nSource: this is an extract from the company’s own website."},
{"employer_url": "https://www.seek.com.au/companies/volkswagen-group-australia-434645", "employer_name": "Volkswagen Group Australia", "employer_info": "Volkswagen hit the road in Australia in 1953 with the arrival of the very first Beetle. Since then we’ve clocked up a lot of Ks and passed many milestones - from the Passat winning Wheels Magazine car of the year way back in 1974, through launching the new look Beetle in 2000 and on to selling more than 600,000 vehicles right across the country. We’re far from reaching the end of the road though. Volkswagen is proud of its history in Australia and is focused on developing new models, services and technologies to help Australians enjoy their driving experience.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/volgren-434446", "employer_name": "Volgren", "employer_info": "Volgren Australia is the country’s leading bus bodybuilder with manufacturing plants in Victoria, Queensland and Western Australia. Established in 1977, the company has grown rapidly in recent years thanks to its focus on safety, reliability and high environmental standards.\n\nVolgren’s aluminium technology is unparalleled and is used in alliance with Hess in Europe and Gillig in the United States. This global alliance provides us with access to proven, world-leading technology and enables us to undertake aluminium bus body manufacture to the highest standard.\nAs we have a strong alliance with industry-leading bus companies, we are able to use the latest technologies such as the GM-Allison drive system used in our Hybrid Bus. This vehicle saves fuel and reduces carbon dioxide emissions, and has attracted strong customer interest.\n\nSource: this is an extract from the company’s own website"},
{"employer_url": "https://www.seek.com.au/companies/volona-and-associates-for-hair-813954", "employer_name": "Volona & Associates For Hair", "employer_info": "Volona and Associates is about what is happening in hair today. The latest in colouring, waving, styling and treating.\n\nWith 20 locations, we are Western Australia’s largest group of hair salons, and employ over 200 hair stylists.\n\nOur stylists are experienced, talented and passionate about hairdressing. They stay on trend by continually updating their skills and knowledge at the WA Academy training facilities. From small changes to complete makeovers, our stylists are dedicated to meeting your hairdressing needs.\n\nFeel free to drop into your local Volona and Associates salon for a free consultation.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/volkswagen-dealership-1001203", "employer_name": "Volkswagen Dealership", "employer_info": "Volkswagen hit the road in Australia in 1953 with the arrival of the very first Beetle. Since then we’ve clocked up a lot of Ks and passed many milestones - from the Passat winning Wheels Magazine car of the year way back in 1974, through launching the new look Beetle in 2000 and on to selling more than 600,000 vehicles right across the country. We’re far from reaching the end of the road though. Volkswagen is proud of its history in Australia and is focused on developing new models, services and technologies to help Australians enjoy their driving experience. \n\n"},
{"employer_url": "https://www.seek.com.au/companies/vok-beverages-801913", "employer_name": "Vok Beverages", "employer_info": "Vok Beverages was established in 2002 as an independently owned and operated alcohol company and has consistently been one of Australia’s fastest growing beverage companies. As a sister company to Bickford's Australia, established in 1874, Vok Beverages shares the driving passion for producing outstanding quality beverages.\n\nToday Vok Beverages owns an impressive, highly awarded portfolio of brands across wine, cider, spirits and ready to drink. Our key assets include the 5,000 tonne crush Step Rd Winery in Langhorne Creek, South Australia, Beresford Estate and tasting room set amongst 31 hectares of super-premium vineyards in the picturesque McLaren Vale, the Beenleigh Distillery in Queensland, the first registered Rum distillery in Australia, established in 1884 and the Black Bottle Distillery in the Renmark, South Australia which is being refurbished for opening in 2015.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/vodafone-432355", "employer_name": "Vodafone", "employer_info": "Vodafone Group Plc. is one of the world's leading mobile telecommunications companies, with a significant presence in Europe, the Middle East, Africa, Asia Pacific and the United States through the company's subsidiary undertakings, joint ventures, associated undertakings and investments. There are approximately 5.4 million Vodafone customers in Australia.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/vogue-logistics-801912", "employer_name": "Vogue Logistics", "employer_info": "WORLDWIDE INTEGRATED SUPPLY CHAIN NETWORK\n\nEstablished in 1982 as an Australian owned company, Vogue Retail Logistics provide supply chain logistics for retail importers and distributors with X dock facilities in all major capital cities in Australia and worldwide including, United states of America, United Kingdom and Europe.\n\nAdditionally with offices and warehousing facilities located in Shanghai, Shenzhen and Hong Kong China, Vogue Retail Logistics has your supply chain logistics covered.\n\nVogue Retail Logistics provide clients a personalised service, with an accredited A class licence in China and an on ground management team using the latest electronic pick and pack service available making your delivery from factory to store a reality.\n\nVogue Retail Logistics also understand the needs of the retail fashion industry, supplying ratio pack picking in china for catalogue releases, new season releases, sale stock deadlines and stock returns. We also store replenishment stock at destination cities , awaiting your EDI store orders for scan pick & pack processing\n\nVogue Retail Logistics is your complete goods logistic management partner. Consolidating ordering, picking, packing, stocking and delivering… DIRECTLY to Store or your warehouse!\nThrough our policy of continual improvement we offer our clients a complete supply chain network unified with WMS & forwarding solutions worldwide.\nSource: this is an extract from the company’s own website."},
{"employer_url": "https://www.seek.com.au/companies/vodafone-business-centre-753174", "employer_name": "Vodafone Business Centre", "employer_info": "A Ready Business has the power to thrive today and prepare for tomorrow - by being more agile, better connected to your people and engaging your customers more effectively. Whether you're starting out or building your business, our plans and solutions are designed to help you stay connected and competitive in the ever-changing world of business.Our  Ready Business Indicator lets you see how prepared your business is for the future and compare it with other businesses like yours. It’s a simple online assessment that can help you gauge your business’ strengths and weaknesses, and unlock your full potential. Our apps take the hassle out of admin and let you focus on what you love. Right now, you can get a free 2 month subscription to Dropbox Business and Norton Small Business.Our plans are designed to grow with your business. Business Flex lets you decide on the Add-ons that suit your team, to minimise wastage. Choose plans with a phone or bring your own devices. Talk to a Vodafone Business Specialist to tailor a plan to suit your needs. \nSource: This is an extract from the company's own website"},
{"employer_url": "https://www.seek.com.au/companies/vocation-816905", "employer_name": "Vocation", "employer_info": "In the simplest terms, “vocation” means a “call.” So, in general terms your vocation is what God calls you to do with your life.\n\nEverybody is called by God to know, love and serve him. The difference is how each one does this.\n\nIndividual vocations vary between being single, married, consecrated, religious or a priest. However, we usually use “Vocation” to mean a call to the consecrated, religious or priestly life. That is what we do on this website, but the principles and much of the advice are also applicable to the married and the single life. .\n\nIn the one life God gave you to live, you have one overriding purpose, to fulfill the will of God, because this is the key to your true destiny, eternal happiness.\n\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/vmware-434235", "employer_name": "VMware", "employer_info": "Digital business transformation is creating new opportunities and risks in every industry. VMware helps IT become Brave New IT with our One Cloud, Any Application, Any Device architecture. By unifying private, managed and public clouds into one hybrid cloud, our customers accelerate innovation, engage customers with new mobile-cloud applications, and govern risk. \n\nSource: this is an extract from the company's own website"},
{"employer_url": "https://www.seek.com.au/companies/vmtech-868050", "employer_name": "VMtech", "employer_info": "\n\n\n\n"},
{"employer_url": "https://www.seek.com.au/companies/vmg-global-813290", "employer_name": "VMG Global", "employer_info": "VMG Global will make you visible.\n \nWe transform image and grow market share with innovative marketing solutions. As a market leader in brand image development, we represent numerous national and multinational companies, including some of the biggest names in the finance, telecommunications, and sports industries.\n \nGet visible with VMG Global:\n \nAdvertising & Promotions -  Build brand awareness and public image through targeted advertising campaigns and promotions.\n \nBusiness to Business – Corporate sponsorships and executive endorsements grow market share.\n \nEvent Based Marketing – Growing market share by reaching businesses and consumers via industry relevant events.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/vocam-867980", "employer_name": "Vocam", "employer_info": "Specialising in high quality dramatic impact video based training, Vocam has made a name for itself for delivering engaging learning that staff actually want to view \nCapture your brand, capture your people, showcase your values in a modern, innovative visual E- learning strategy that changes the world, one training session at a time. \nWe produce world class Health, Safety and HR, multimedia video elearning courses.\n\nVocam is the world leader in providing high impact, high quality video elearning training products designed for all industries. Vocam products are used by industry leading businesses, training organizations, insurance agencies, government and educational institutions. Vocam specialises in video based training that recreates real work place accidents, showing real people in real workplaces, that is based on the local legislation and local practices. Vocam has training solutions for any size business, whether you need training for thousands of employees or a safety video for a small business induction. No matter if your employees are office staff, mining staff, warehouse staff, retail staff, or any combination, Vocam has a training solution for you. Through our Safety-TV platform you can fully customise our training courses to suit your workplace or build your own. You can write your own questions, answers, videos, pictures, text, audio or modify ours. Through our TrainNow platform you can take your video training anywhere you can bring your laptop, without needing to be connected to the internet!\nSource: This is an extract from the company's own website"},
{"employer_url": "https://www.seek.com.au/companies/vizeum-861551", "employer_name": "Vizeum", "employer_info": "Vizeum was created for the new era of media: A convergent world where consumers and content come together, in real time, on platforms and devices; a global world massively impacted by digital technology which is totally reshaping the environment that brands and people live in. Vizeum embraces every dimension, linking social, mobile, offline and online, generating emotions and trust, and building powerful connections between brands and people at speed and scale. \nBecause today is all about being connected, interconnections and interdependence, Vizeum embraces these global opportunities to create “Connections that Count”:\nSustainable consumer relationships, long-lasting connections, based on trust, loyalty and transparency, is what we believe will ultimately deliver brand growth for our clients.\n\nVizeum: Connections that Count\nSource: this is an extract from the company’s own website."},
{"employer_url": "https://www.seek.com.au/companies/vivid-advertising-801909", "employer_name": "Vivid Advertising", "employer_info": "Vivid Advertising Solutions provides a full range of promotional and marketing solutions that pivot on proven modern advertising innovations which deliver far higher returns than conventional radio ads and direct mail. Our personal approach to expanding the market reach of our clients bridges the gap in order to generate a much higher conversion rate for every dollar spent. As a result, our advertising experts deliver unmatched growth without putting a company’s financials at risk. Our consistent results have made us the premier provider of experiential marketing solutions in the region.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/viva-energy-813745", "employer_name": "Viva Energy", "employer_info": "One Mission\n\nViva Energy Australia is the exclusive licensee of Shell products in Australia. Our mission is to keep local industry moving, with Shell fuels, lubricants, chemicals, marine products and bitumen. \n\nWe also provide expertise. Our people are highly skilled and trained to deliver a service that is reliable and adds value. Indeed, Viva Energy is driven by people.\n\nTwo Parents\n\nForged from two of the world’s foremost energy companies, Shell and Vitol, Viva Energy is a brand new company with the benefit of 110 years local Australian experience.\n\nVitol \nThe world’s largest independent energy trading company and the primary shareholder of Viva Energy Australia. With more than 200 ships at sea at any given time and over 5 million barrels of crude oil and products traded every day, Vitol has the scale and capability to meet Australia’s growing demand for energy.\n\nShell \nOne of the world’s most recognised and respected brands. Shell’s reputation for quality and technical innovation is reflected in products that combine performance, efficiency and reliability. Future advancements will come from Shell’s annual global investment of more than $1.3 billion in research and development.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/vix-technology-436527", "employer_name": "Vix Technology", "employer_info": "Vix designs, builds, delivers, operates and maintains some of the world's leading transit schemes. With deep sector expertise, leading technology and a proven track record in secure, reliable, high volume transactions processing, our offer includes:\n\nClosed-loop systems – smartcards / ePurse\nOpen-loop systems and payments (EMV contactless)\nAccount based solutions\nMobile payments, top ups, apps and ticketing\nClearing and settling for large multi participant fare collection schemes\nReal time passenger information systems\nIntelligent transport systems\nData and analytics for operations and user engagement\nManagement, service and maintenance\nCustomized, integrated or offered as a service.\n\n\nSource: This is an extract from the company's own website"},
{"employer_url": "https://www.seek.com.au/companies/viva-college-799518", "employer_name": "Viva College", "employer_info": "In 2005 the College became a Registered Training Organisation (RTO) in the State of Queensland.\n\nThe College has quickly developed a reputation for quality, being accredited by Australia’s strictest regulating bodies including ACPET, NEAS and ASQA.\n\nToday, Viva College has over 700 students from all over the world and delivers a range of ELICOS and VET Certificate and Diploma face to face and online training programs.\nWe cater for International and Domestic students who are seeking a personal level of service in a mid-sized College, with a friendly, relaxed atmosphere and professional, caring staff who will help you meet your goals. Join the Viva family and find out why our motto is 'Excellence in learning to help you fulfil your dreams!' \nSource: This is an extract from the company's own website"},
{"employer_url": "https://www.seek.com.au/companies/vittoria-food-and-beverage-995326", "employer_name": "Vittoria Food and Beverage", "employer_info": "As Cantarella Bros continues to grow and evolve, so does our corporate identity.\n\nWith our flagship brand Vittoria Coffee holding the position of Australia's Number 1 Pure Coffee Brand*, we recognised that it was important to link our total business to that of which it is best known. Which is why Cantarella Bros is now trading under the new business name of 'Vittoria Food & Beverage'.\n\nRest assured our commitment to excellence remains unchanged, as does our heritage, with Vittoria Food & Beverage remaining a proud third-generation family business where our expertise has been passed down from one generation to the next.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/vitil-human-resources-834711", "employer_name": "Vitil Human Resources", "employer_info": "Vitil is a firm of human resource advisors and recruitment consultants. Established in Perth in 2008, we provide recruitment and human resources services to SMEs to create successful, high performing sustainable teams – with continuous improvement its core focus. \nAt Vitil we concentrate on developing your core vision and values and improving the continuous human resources cycle.  \nNo two businesses are alike so we tailor our service to your unique requirements – the right solution within your budget.\n\nFor many clients this involves providing a HR manager service to undertake all HR activities including recruitment, inductions, team reviews, process improvements, employment agreements, cultural assessments and developing team retention strategies. \nVitil consultants have experience in many industries including mining, steel, education and training, earth moving, aviation, financial and pharmaceutical.\n\nThey offer expertise in recruitment and human resources services, emotional intelligence, performance management training, job profiling, psychometrics, recognition and non-financial rewards.\nSource: this is an extract from the company’s own website."},
{"employer_url": "https://www.seek.com.au/companies/vita-group-433476", "employer_name": "Vita Group", "employer_info": "Vita Group is an ASX-listed provider of communications, consumer electronics and information technology products and services and is a leading channel partner to Telstra and Apple in the Australian market. The group operates in the retail channel under the Telstra, Fone Zone, Next Byte and One Zero brands and in the business segment under the Telstra Business and Vita Enterprise Solutions brands. Founder and CEO Maxine Horne has transformed the company from a single telecommunications store in 1995 into a multi-brand, multi-channel publicly listed company. Vita’s key competitive advantage is its vibrant and entrepreneurial culture and proven systems and processes for getting, growing and keeping the right people. It focus is people first, with an emphasis on leadership, sales capability and the delivery of an exceptional customer experience.\n\nSource: this is an extract from the company’s own website"},
{"employer_url": "https://www.seek.com.au/companies/visual-security-801906", "employer_name": "Visual Security", "employer_info": "Visual Security has 13 years experience in the security industry and is currently operating with approximately 30 staff both male and female in a number of locations across the top of Australia.\n\nThe company has been built from scratch with experienced staff and enjoys an excellent reputation amongst its clients. We pride ourselves on the range of services that we offer and the quality of the services that we provide. Staff are supplied with on-the-job training, smart uniforms and excellent working conditions.\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/vitality-works-834380", "employer_name": "Vitality Works", "employer_info": "Vitality Works is a Sanitarium company, passionate about health at work. We are a leading provider of Workplace Health Services across Australia and New Zealand. From health assessments to engaging wellbeing programs, and from the corporate office to the mining site, our world class programs demonstrate real returns.\n\nOur approach of transformation focuses on the individual as well as the business. We work to resource and inspire happy, healthy people. At the same time, we help cultivate a thriving business, or in short:\nVibrant People\n\nVitality Works people love what they do. They are highly trained, vibrant leaders in the field of workplace health.\nMeasurable Results\n\nWe’re geared to develop tailored wellness strategies that have a measurable impact on performance, engagement and morale. \nDepth and Breath\n\nWe are a Trans-Tasman organisation with a responsive, national infrastructure and the backing of a trusted health and wellbeing brand: Sanitarium.\nMulti-industry\n\nBlue collar or white – our programs change lives.\n Our tailored approach to wellness generates results in any industry.\nFull-spectrum Approach\n\nOur core business is offering workplace solutions to ASSESS health, PREVENT ill-health and injuries and to help employees THRIVE. This is the foundation of wellness that works\nResearch-based Innovation\n\nOur solutions are award-winning and research based. We have a dedicated innovation team who focus on ground-breaking programs that get people thriving\nSource: this is an extract from the company’s own website."},
{"employer_url": "https://www.seek.com.au/companies/vistaprint-436751", "employer_name": "Vistaprint", "employer_info": "Vistaprint, a Cimpress company, empowers millions of business owners worldwide to market themselves professionally. Our wide range of quality products at affordable prices, along with design tools suited to every skill level and need, mean everyone can create the customised materials they need to get their message across.\n\nIt all started with the vision of our founder, Robert Keane. He wanted to give small business owners access to the same high-quality, custom-printed products that bigger companies (with bigger print budgets) enjoyed. Robert and his team developed patented technology that delivers professional-quality printing in small quantities, affordably. Then they took a process that was traditionally only available offline and made it possible for both business owners and individuals to conveniently create and order their custom materials online.\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/vista-windows-801905", "employer_name": "Vista Windows", "employer_info": "Vista Windows are an Australian owned company that has been operating for 15 years. During this time, we have established ourselves as market leader in the supply and manufacture of commercial and domestic aluminium windows and doors, which come in a maintenance-free Powdercoat or Anodised finishes.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/visit-canberra-796107", "employer_name": "Visit Canberra", "employer_info": "Canberra's official and fully accredited tourism information centre is operated by VisitCanberra for the benefit of tourists and locals alike.\n\nProviding tips and assistance so you get the most out of your stay, the centre is centrally located within the Regatta Point precinct and boasts one of Canberra’s best views, overlooking Lake Burley Griffin towards a range of iconic national attractions including Parliament House, the National Gallery of Australia, the National Library of Australia and Questacon – The National Science and Technology Centre.\n\nCome and have a chat to our friendly staff and volunteers. They’re a wealth of local knowledge and will give you the insights you need to get the most out of your visit. Whether it’s a last-minute accommodation deal or tips about cool new restaurants and cafes, you’ll be glad you dropped in. You can also purchase authentic Canberra region produce and it’s a great place to pick up local merchandise or souvenirs for friends and family.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/vision-personal-training-435308", "employer_name": "Vision Personal Training", "employer_info": "\n\n"},
{"employer_url": "https://www.seek.com.au/companies/vision-super-984911", "employer_name": "Vision Super", "employer_info": "Industry strength super\n\nWe’ve been a community super fund since 1947 so we know super inside out. We’re an industry fund, run only to benefit our members, not to make a profit for shareholders. With around 100,000 members and over $8 billion in assets, we have the experience and expertise to look after your super for life.\nIndustry strength super:\n\nIndustry funds keep fees low compared with retail (bank owned) funds, which can mean more in your pocket when you retire. \n\nExceptional service to members:\n\nWe’re proud of our service. When you call us, you talk to a friendly Member Services consultant in our Melbourne office – not an outsourced call centre or a computer.\n\nSuper’s a complex topic, and sometimes it can seem like super funds are actually trying to make it hard to understand! We keep things simple – we’re always here to help you make sense of your super. \n\nInvestment performance:\n\nOur investment strategy is focused on providing our members with solid long-term performance, and the results speak for themselves – we’re one of Australia’s top performing super funds*, and that means more money for your retirement. \nSource: This is an extract from the company's own website"},
{"employer_url": "https://www.seek.com.au/companies/vitaco-health-813330", "employer_name": "Vitaco Health", "employer_info": "When you choose Vitaco, you choose the largest natural health supplement and specialist food and beverage manufacturer in Australasia serving global markets. We are dedicated to your business and proud of our market and manufacturing reputation. You are supported by talented people with over 45 years industry experience delivering customised, full-service product solutions.\n\nWith an impressive portfolio of iconic brands, private label manufacturing contracts and export sales, we have established leadership across a wide range of industry standards; manufacturing some of Australasia's best natural health supplements and sports nutrition operating across grocery, health food and pharmacy, gyms and specialist channels with retailers throughout New Zealand, Australia and global markets.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/vision-eye-institute-435872", "employer_name": "Vision Eye Institute", "employer_info": "Vision Eye Institute is Australia’s leading provider of ophthalmic services. Our experience, knowledge, technical expertise is unrivalled.\n\n \nWe are proud of our outstanding doctor team, which has allowed us to become highly respected throughout the world.\n \nOur team has been at the forefront of technological, from pioneering laser eye surgery in Australia in 1991, to the first clinic in the Southern Hemisphere to perform laser cataract surgery. When medical trials are required, our doctors are inevitably, the default choice in the country.\n \nIn fact, our surgeons who specialise in refractive surgery, cataract surgery and retinal surgery are respected worldwide. We are fortunate to have many doctors who have pioneered a number of the technical advances over the last 20 years. These include:\nthe first to use phacoemulsification during cataract surgery\nthe first to perform CMICS ‘coaxial’ micro-incision cataract surgery\nthe first to perform laser cataract surgery.\nFinally, as the leading provider of ophthalmic services in Australia, our surgeons are in a position to have access to the very latest proven technology and equipment.\n\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/vision-australia-433743", "employer_name": "Vision Australia", "employer_info": "Vision Australia is a leading national provider of blindness and low vision services in Australia. We work in partnership with Australians who are blind or have low vision to help them achieve the possibilities they choose in life. \nSource: this is an extract from the company's own website"},
{"employer_url": "https://www.seek.com.au/companies/vision-2020-australia-984837", "employer_name": "Vision 2020 Australia", "employer_info": "Vision 2020 Australia was established in October 2000. \n\nWe are part of VISION 2020: The Right to Sight, an initiative of the World Health Organisation and the International Agency for the Prevention of Blindness.\n\nVision 2020 Australia's role is to ensure that eye health and vision care remains high on the health, disability and international development agendas of Australian governments. This will ensure that Australia fulfils its commitments under the World Health Assembly resolutions and World Health Organisation's Universal eye health: a global action plan 2014-2019.\n\nWe represent around 50 member organisations involved in:\n\nlocal and global eye care \nhealth promotion\nlow vision support\nvision rehabilitation\neye research\nprofessional assistance\ncommunity support.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/visy-433276", "employer_name": "Visy", "employer_info": "In 1948, Visy started out in Melbourne as a manufacturer of corrugated cardboard boxes. From these modest beginnings, it has since grown to become one of the world's leading packaging, paper and recycling companies. Now, Visy employs over 5,500 staff and operates in over 120 sites across Australia, New Zealand, Thailand and Vietnam and trading offices across Asia, Europe and the USA. Visy also has a 'sister' company, Pratt Industries USA, which employs a further 3,500 staff in North America.  Sustainability is at the heart of everything Visy does. As well as providing packaging to some of the world's best known brands, Visy also offers recycling solutions. It's our goal to meet the needs of our customers, while efficiently using and reusing scarce resources.\n\nSource: this is an extract from the company's own website"},
{"employer_url": "https://www.seek.com.au/companies/viterra-433031", "employer_name": "Viterra", "employer_info": "Viterra's operations consist of grain storage and handling and packing and processing, located across South Australia, Victoria and New South Wales. Viterra's network has a total storage capacity of more than 10 million tonnes and consists of upcountry receival sites and strategically located port terminals. Viterra provides exporters of wheat and other commodities with access to port terminal services, including grain assembly, freight, port storage, throughput and ship loading services. Viterra and Glencore Grain have combined their grain marketing activities and now trade as Glencore Grain. Glencore has a first class trading network and access to the best markets for Australian grain.                                        Source: this is an extract from the company's own website"},
{"employer_url": "https://www.seek.com.au/companies/viscount-plastics-874762", "employer_name": "Viscount Plastics", "employer_info": "Viscount Plastics is a leading innovative packaging, supply chain and logistics solutions provider.\nViscount Plastics services customers across the Asia Pacific region providing packaging, materials handling, water harvesting and industrial product solutions and applications to various end user and consumer markets. Viscount Plastics is a market leader within the Asia Pacific region in rigid plastic containers, food packaging, plastic materials handling and lubricant packaging.\n\nWith a flexible geographic manufacturing footprint spread across Australia, New Zealand and Asia, Viscount Plastics is well equipped to provide customers with global leveraged manufacturing, service and technical support to ensure a full service outcome. By delivering world best practice in plastics manufacturing and product solutions, customers are provided the very highest standards of quality and performance. Our Australian and New Zealand plants are appropriately ISO9001, ISO14001 and HACCP compliant to service our customer requirements\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/visa-834764", "employer_name": "Visa", "employer_info": "You're smart, driven and want to make a difference in the world. You'll fit right in.\nWe connect consumers, businesses, banks and governments in more than 200 countries and territories worldwide. \n\nWe are a global payments technology company working to enable consumers, businesses, banks and governments to use digital currency. \n\n\n\n\n      \n\n\n \n\n\n\n\n\n\n\n \n\n\n\n\n\n\nCorporate responsibility\n\nHelping improve lives and economies around the world. From advancing financial inclusion to helping in times of crisis, we're using our products, know-how and philanthropy to bring about positive change.\nWe believe the trust of investors, cardholders, merchants and financial institution clients needs to be earned. That’s why Visa commits to the highest standards of professional and personal conduct and always seeks to act with openness and transparency. We have implemented a robust governance structure, and we regularly monitor our corporate governance policies and practises to ensure we meet or exceed the requirements of applicable laws, regulations and rules, the NYSE's listing standards and the expectations of our investors.\n\nVisa's corporate governance framework, including our Corporate Governance guidelines exemplifies our commitment to these standards.\n\n \n\nKey components include:\n•Our Board of Directors is comprised entirely of independent directors (other than  our CEO), as are the key committees of the Board (Compensation, Audit and Risk, and Governance);\n•Each director is elected annually by our shareholders\n•Independent directors meet regularly in executive sessions;\n•Committee chairs are generally rotated at least once every 5 years;\n•The Board and each Committee conduct annual self-evaluations and peer reviews, and our Board is actively engaged in succession planning at the Board and management levels\n•The charters of the Board's committees clearly establish the roles and responsibilities of each of the committees\n\n \n\nVisa also has a comprehensive Code of Business Conduct and Ethics the foundation for how we conduct everyday business activities around the world. The Code applies to all directors, officers, employees and contingent staff and covers a wide range of business practises and standards. The Code requires personnel to engage in honest and ethical conduct in performing their duties, details guidelines for how we ethically handle actual or apparent conflicts of interest between personal and professional relationships and provides a mechanism for anyone inside or outside the company to report a suspected violation of the Code\nSource: this is an extract from the company’s own website."},
{"employer_url": "https://www.seek.com.au/companies/visa-global-logistics-806623", "employer_name": "VISA Global Logistics", "employer_info": "VISA Global Logistics delivers a fully integrated solution including forwarding, clearance, warehouse, distribution and value added services.\n\nFounded in 1982, VISA Global Logistics has become one of Australia’s largest privately owned international freight forwarding companies and through our extensive global network we deliver a comprehensive logistics system for all worldwide trade lanes.\n\nSource: This is an extract from the company’s own website."},
{"employer_url": "https://www.seek.com.au/companies/visco-selected-fine-foods-801901", "employer_name": "Visco Selected Fine Foods", "employer_info": "Visco Selected Fine Foods is a family owned and operated business located in Brisbane, Queensland, specialising in the wholesale and manufacture of gourmet foods. We source only the finest ingredients and produce from Europe and around Australia, and are dedicated to delivering quality service to customers. If you are in the catering, restaurant, hotel or delicatessen business, we would be delighted to be of service. We look forward to assisting with any enquiries and wish you success and good times in your kitchen. Un grande salute e buon appetito.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/virtusa-433864", "employer_name": "Virtusa", "employer_info": "Virtusa Corporation (NASDAQ: VRTU) is a global information technology (IT) services company providing IT consulting, technology and outsourcing services.\n\nUsing our enhanced global delivery model, innovative software platforming approach and industry expertise, we provide high-value IT services that enable our clients to enhance business performance, accelerate time-to-market, increase productivity and improve customer service.\n\nSource: this is an extract from the company’s own website"},
{"employer_url": "https://www.seek.com.au/companies/virtual-display-group-816904", "employer_name": "Virtual Display Group", "employer_info": "VDG is an Australian Owned and Operated business with a primary focus on the manufacture, supply and installation of retail fixtures and displays. What sets us apart is our one‐stop shop service, scale, capabilities and that you are dealing direct with the manufacturer and installer. We have the experience and track record of working with Australia's leading department stores, retail chains, shopping centres and brands. We are geared for multiple fit outs, retail fixture rollouts and bespoke projects.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/virtunet-834526", "employer_name": "Virtunet", "employer_info": "Virtunet was founded in 2008 with a vision to Making IT Awesome. We help customers align business processes and information communication and technology systems with the company’s business goals.  \n\n\nVirtunet was established with one goal in mind, to empower organisations and people to unleash their potential through technology. We incorporate this principle into everything we do and continually to be at the forefront of technology so you are always staying ahead of the curve.\n\nWe’re Australia’s premier IT solutions provider delivering the latest technology and technology solutions to increase your business revenue and reduce cost. Whether you are in the education, corporate or government sector, we are a full service solutions provider to meet your needs.\n\n\n\nOUR VISION\n\nMaking IT awesome.\n\nSince our founding, we have been recognised for designing customised solutions that best fit corporate, government or education customers’ needs. In addition to devising fantastic IT solutions, our dedicated support staff provide consistent, timely service to our clients to ensure every query is answered and every need meet as quickly as possible.\n\nSo, why choose Virtunet?\n\n Pre and post sales support\n Rigorously tested, customised IT solutions\n Ensure that your products are compliant and warranties are up-to-date\n Consistent high standard of service & delivery\n Access to a dedicated account manager who understands your business and IT needs\nPRODUCTIVITY\n\nOur experienced team of IT solution architects are constantly working to devise solutions to overcome the hurdles faced by businesses and organisations. Our breakthrough IT solutions have been rigorously tested and have shown a demonstrated ability to deliver outstanding results in a business environment.\n\nOur close partnerships and partner certifications with leading IT vendors and distributors allow us access to Vendor Direct special pricing and high levels of stock which means you’re guaranteed the best prices for all your product purchases with us.\n\nSo, why choose Virtunet?\n\n Tailored solutions to your business\n Guaranteed competitive pricing\n Value added services at no extra cost\n Access to multi-vendor product range\nEFFICIENCY\n\nWe pride ourselves in providing high quality service in a time efficient manner, ensuring our clients don’t have to suffer delays. We understand that a swift turnaround of IT procurement is important for business continuity. That’s why we have created a seamless IT procurement process which avoids unnecessary delivery delays or low stock issues that can slow down deployment of hardware or software and hinder business continuity.\n\nWith our network of warehouses around the country, we are able to deliver consistently fast services and products to satisfy even the most urgent purchase requirement.\n\nSo, why choose Virtunet?\n\n Virtunet is a one stop shop for all your IT needs, saving you time and money\n Reduce time needed to source IT equipment\n Fast and reliable nationwide delivery\n Prompt service delivery for business continuity\n Timely update of your purchases, assets and licensing information\nMISSION STATEMENT\n\nVirtunet empowers organisations and people to unleash their potential through technology.\nSource: this is an extract from the company’s own website."},
{"employer_url": "https://www.seek.com.au/companies/virtus-health-995327", "employer_name": "Virtus Health", "employer_info": "Virtus Health Limited (ASX:VRT) is the market leading Assisted Reproductive Services (ARS) provider in Australia & Ireland, with a growing Asian presence through our clinic in Singapore.\n\nWith over 100 of the world’s leading fertility specialists supported by more than 1100 professional staff, we help more than 5,000 couples and single women each year achieve their aspirations to create a family. \n\nThe first publicly listed fertility business in the world, we have developed one of the most successful medical collaborations internationally bringing together leading clinicians, scientists, researchers and support staff to provide the very best in fertility care and related specialised diagnostics and day hospital services. \n\nOur combined expertise creates a unique and powerful body of knowledge which when combined with the doctor led collegial team approach of our specialists and scientists, means we are able to find new and advanced solutions for achieving success for our patients. \n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/visionstream-432776", "employer_name": "Visionstream", "employer_info": "Visionstream provides telecommunications and ICT services across Australia and New Zealand, focused on design, construction, operations and maintenance for carriers, government, channel partners and enterprise industry segments. Source: this is an extract from the company's own website management. Source: this is an extract from the company's own website"},
{"employer_url": "https://www.seek.com.au/companies/virginia-state-school-820617", "employer_name": "Virginia State School", "employer_info": "Virginia State School has an excellent reputation in the community as a school with outstanding academic results, regional and state sport representatives and an extensive co-curricular program. We have professional, skilled and dedicated staff; a parent community that places great value on a high quality education; and, a teaching and learning program that ensures every student has the opportunity to succeed.\n\nOur community values excellence in teaching and learning; strong relationships between students, staff and parents; and a focus on the future when supporting all our students.\n\nVirginia State School is a school of excellence in music with some 90 students currently enrolled in the instrumental music program from years 4-6. There are approximately 450 students enrolled at our school from prep to year 6. \nSource: This is an extract from the company's own website"},
{"employer_url": "https://www.seek.com.au/companies/viridian-glass-434445", "employer_name": "Viridian Glass", "employer_info": "When you've been making glass for over 75 years, you learn to know and love the material. And that's the way it is for Viridian and glass. We're constantly searching for new and innovative ways to make glass better. So we can help make Australian homes and buildings the best in the world.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/virginia-farm-produce-814404", "employer_name": "Virginia Farm Produce", "employer_info": "Virginia Farm Produce is a proud family business with strong family ethics. Formed in 1956 by Jack Farmer the business is now managed by its third generation and remains focussed on quality, integrity and reliability.\n\nVirginia Farm Produce potatoes, onions and almonds are all grown on its own farms in the pristine conditions of Virginia and in Keith, in the South East of South Australia, ensuring consistent quality supply all year round. Virginia Farm Produce farms more than 55,000 acres of its own land, transports its own potatoes and packs the products within 24 hours of harvest to ensure the highest quality. \n\nWhilst a large scale business, it is still operated with strong family ethics and care. \n\nVirginia Farm Produce is proud of supplying the freshest quality produce to Australia's leading supermarkets, market wholesalers and export markets.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/virgin-mobile-433265", "employer_name": "Virgin Mobile", "employer_info": "Here at Virgin Mobile, we've been putting our customers first for over 10 years. Ever since Richard Branson saw an opportunity to stir up the Aussie telco market in the early noughties, we've been making a splash with our innovative products, cheeky ad campaigns and world-class customer service.\nWe've certainly come a long way from the early days when each new connection meant a little bell rang in the call centre, to proudly having more than 1 million customers in Australia.\nWe think a telco relationship should be rewarding so our customers also receive a host of benefits including Virgin family perks, exclusive discounts and VIP access to gigs and music festivals.\nAnd because we use the Optus network it means that up to 98.5% of the population in Oz can get a clear Virgin Mobile signal.\n\nSource: this is an extract from the company’s own website"},
{"employer_url": "https://www.seek.com.au/companies/vipac-engineers-and-scientists-814226", "employer_name": "Vipac Engineers & Scientists", "employer_info": "Since 1973, Vipac Engineers & Scientists has been delivering engineering solutions worldwide that shape the testing landscape, transform skylines, improve safety and enhance environmental sustainability.\n\nVipac’s in-house laboratories, wind tunnels, acoustic and climatic chambers, solar simulators and vibration equipment enable their engineers to prototype, model and fabricate customised elements. This enables the testing of unusual materials to prove their feasibility to clients and value-add to projects.\n\nFrom a collaboration with NASA on space shuttles, to energy efficiency testing on whitegoods, to structural integrity analysis on Defence vehicles, to advising on the world’s tallest building, Vipac’s service portfolio is as diverse as its workforce.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/virgin-australia-432381", "employer_name": "Virgin Australia", "employer_info": "\n\n"},
{"employer_url": "https://www.seek.com.au/companies/vip-pet-foods-801898", "employer_name": "VIP Pet Foods", "employer_info": "Australia’s No. 1 producer of fresh chilled petfood\n"},
{"employer_url": "https://www.seek.com.au/companies/virgin-active-433951", "employer_name": "Virgin Active", "employer_info": "Have we met? \nWe just might be the club you're looking for\nAt Virgin Active, we help our members to live happily ever active. For us, living active is more than just building muscles, dropping a few pounds or breaking a record. It’s about whatever makes you happy. It’s energy. It’s vitality. It’s that indefinable yet incredible awesome feeling you get from moving your body the way it’s meant to move. \n\nSo much more than a gym\nAny gym can make you sweat, but at Virgin Active we do it in style. Not to brag (ok, maybe a little) but our health clubs are quite simply world class. From swimming pools, spas and saunas, to spacious workout areas and premium, state-of-the art equipment. Every week we offer hundreds of group exercise classes and we’re always first to jump on the latest training trends.\n\nAll our clubs have a fun, non-intimidating atmosphere, with smiley staff there to support and motivate you. Nothing strange really, we simply believe that if you enjoy coming to our clubs, you’ll enjoy working out with us and you’ll achieve your goals sooner; it’s a win-win-win.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/vincentcare-814955", "employer_name": "VincentCare", "employer_info": "Our Mandate\nVincentCare was established to extend the Christian mission of the St Vincent de Paul Society to support and advocate on behalf of the most disadvantaged Victorians.\n\nOur Aspiration\nTo be the leader in providing care, hope and advocacy for those facing disadvantage.\n\nOur Purpose\nTo create opportunities and lasting change for the most marginalised\n\nSupport individuals and their families so that their basic needs are met in terms of food, shelter, safety and security;\nProvide access to programs and pathways that strengthen an individual’s resilience and support them in accessing opportunities within their communities; and\nAdvocate and build capacity in order to redress the structural inequalities in the community that create disadvantage\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/vincent-security-801897", "employer_name": "Vincent Security", "employer_info": "Top quality Security Screens \n\nBrisbane\n\nVincent Security are your Barrier Security Specialists \n\nVincent Security is a Queensland owned and operated business and was first established in 1970 and has been under the same management since 1987 so we have a long history of specialising in Brisbane Security Screens and Doors with great customer service, 68% of our jobs come from Previous Clients or Referrals\n\nAt Vincent Security we are good listeners we aim to work with you and help you to make the correct decision about which products best suit your needs and budget for securing your Home, Business or Commercial project.\n\nOur commitment to ongoing product development combined with our proven track record, places Vincent Security a cut above the rest in the security screen industry. We offer a range of products ranging from Crimsafe to VS Welded Aluminium and security doors, security screens and security grilles, as well as our secure elegant plantation shutters.\n\nOur efficient modern manufacturing plant and powder coat facility allows us to make all the products ourselves so we keep better quality control of our products and can commit to realistic timelines for installation of your job.\n\nWe deliver and install security screens to all areas of Brisbane. For more information about our security screen products. Call us today and see how we can help you protect your family and home.\nSource: this is an extract from the company’s own website."},
{"employer_url": "https://www.seek.com.au/companies/vintage-cellars-433958", "employer_name": "Vintage Cellars", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/vincent-state-school-819584", "employer_name": "Vincent State School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/vincents-chartered-accountants-437479", "employer_name": "Vincents Chartered Accountants", "employer_info": "Vincents is proud of our professional accolades and of the people who’ve chosen to grow their careers with us. Our back-to-back BRW Client Choice Awards are indicative of the professionalism we place on our working environment - and it’s not all accounting and business!\n\nVincents is committed to making sure we keep and grow excellent staff. So whatever your role at Vincents, as an employee you will enjoy:\n\nInteresting and challenging work experiences\nCareer development opportunities\nAn environment where Directors and Managers are easily accessible\nA strong team environment within working groups and across the firm\nIndividually tailored continuing education and training\nOngoing CA, CPA and other post graduate study support\nA range of employee benefits and discounts\nHighly competitive salary packages\nFirm health and wellbeing program\nA culturally diverse, family friendly and social atmosphere\nFlexible working arrangements\nVincents’ staff enjoy a varied social and sports calendar throughout the year and provide opportunities for your health and wellbeing on a weekly basis.\n\nSource: This is an extract from the company's own website"},
{"employer_url": "https://www.seek.com.au/companies/village-roadshow-432973?child=433673", "employer_name": "Village Roadshow Theme Parks", "employer_info": "Founded by the late Mr. Roc Kirby in 1954 in Melbourne, Australia with a drive-in cinema, Village Roadshow has been listed on the Australian Securities Exchange (ASX) since 1988. With the Company's roots still based in Melbourne, few are aware of the breadth or the diversity of Village Roadshow's entertainment and media assets.\n\nToday, Village Roadshow operates core businesses in Theme Parks, Film and DVD Distribution, Cinema Exhibition, Film Production and Marketing Solutions. While creating strong and diverse earnings streams, these businesses are complementary, targeting a similar customer demographic and providing significant cross-promotional opportunities.\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/village-st-984602", "employer_name": "Village St", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/village-motors-group-814155", "employer_name": "Village Motors Group", "employer_info": "Welcome to Village Motors – Brisbane Holden | Brisbane Nissan | Brisbane Renault.\n\nThe Village Motors Group, is your authorised Holden and Nissan Dealer servicing Holden and Nissan cars in Brisbane, Petrie and Redcliffe area on Brisbane’s Northside. Village Motors Group is also family owned Automotive Business. We have Holden New and Used Cars for sale and we only sell top quality New and Used cars, we also service all makes and models. Village Motors Group has been in the car industry for 47 Years providing high quality customer service and we have been selling and servicing New Holden and Used Holden from the beginning. At Village Motors Group, we are all about the customer`s experience and we live and breathe this as part of our culture. With more than forty years experience in the car industry and comprehensive local knowledge and trust, you can have the confidence when buying a new or used car from Village Motors Group.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/village-roadshow-432973", "employer_name": "Village Roadshow", "employer_info": "Founded by the late Mr. Roc Kirby in 1954 in Melbourne, Australia with a drive-in cinema, Village Roadshow has been listed on the Australian Securities Exchange (ASX) since 1988. With the Company's roots still based in Melbourne, few are aware of the breadth or the diversity of Village Roadshow's entertainment and media assets.\n\nToday, Village Roadshow operates core businesses in Theme Parks, Film and DVD Distribution, Cinema Exhibition, Film Production and Marketing Solutions. While creating strong and diverse earnings streams, these businesses are complementary, targeting a similar customer demographic and providing significant cross-promotional opportunities.\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/village-roadshow-432973?child=433009", "employer_name": "Village Cinemas", "employer_info": "Founded by the late Mr. Roc Kirby in 1954 in Melbourne, Australia with a drive-in cinema, Village Roadshow has been listed on the Australian Securities Exchange (ASX) since 1988. With the Company's roots still based in Melbourne, few are aware of the breadth or the diversity of Village Roadshow's entertainment and media assets.\n\nToday, Village Roadshow operates core businesses in Theme Parks, Film and DVD Distribution, Cinema Exhibition, Film Production and Marketing Solutions. While creating strong and diverse earnings streams, these businesses are complementary, targeting a similar customer demographic and providing significant cross-promotional opportunities.\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/village-baxter-796156", "employer_name": "Village Baxter", "employer_info": "The Village Baxter is a multi-tiered retirement community dedicated to the care of older persons. Established in 1974, it is situated on 75 acres of landscaped parkland located in Robinsons Road on the borders of Frankston, Baxter and Langwarrin. We are close to Towerhill and Karingal Shopping Centers which are easily accessible via our Village Bus.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/villa-maison-984611", "employer_name": "Villa Maison", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/villa-maria-catholic-homes-813618", "employer_name": "Villa Maria Catholic Homes", "employer_info": "Villa Maria Catholic Homes is committed to working in partnership with people of all ages and abilities to help them achieve their individual goals and dreams, remain connected to their communities and enjoy their independence.\n\nAs an agency of the Catholic Archdiocese of Melbourne, our values including respect, compassion and inclusion guide us to deliver the highest quality services to individuals of all faiths and backgrounds.\n\nWe are a Catholic, not-for-profit organisation providing residential aged care, affordable housing options, retirement living, senior support, disability, carer and education services to more than 6,500 people across Victoria and southern New South Wales.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/vinidex-434884", "employer_name": "Vinidex", "employer_info": "Vinidex is a member of the Aliaxis Family of Companies, a global leader in the manufacturing and distribution of fluid handling solutions. The Group is active through more than 100 manufacturing and commercial companies, operating in over 45 countries with 16 200 employees. Aliaxis is privately owned and has global headquarters in Brussels, Belgium. Established since 1960, Vinidex is a significant contributor to the Asia Pacific Region and is Australia's foremost environmentally conscious manufacturer and supplier of quality PVC pipe, PE pipe and PP pipe systems and solutions for the transportation of fluid, data and energy. \n"},
{"employer_url": "https://www.seek.com.au/companies/viking-rentals-815122", "employer_name": "Viking Rentals", "employer_info": "Specialists in Portable Toilets & Showers, Temporary Fencing, Temporary Power, Mini Site Offices and More\nOur Focus:\n\nHygiene & Cleanliness\nLatest Plant & Equipment\nTimely, Discrete Service\nWe have a large fleet of trucks, thousands of portable toilets for hire, and kilometres of temporary fencing, and many hundreds of temporary power poles. We also have unique products designed especially for our customers. Examples are our mini site offices – suitable for the inner city builder working on tight sites, and our world first 16 shower block (48 showers in one B-Double trip!). Check out the major events pages for further toilet and shower block specifications.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/virbac-814292", "employer_name": "Virbac", "employer_info": "Welcome to Virbac Virbac Australia\nVirbac (Australia) Pty Ltd is a specialist animal health company with its core business in sheep and cattle products, veterinary pharmaceuticals and vaccines, a wide range of petcare products for dogs and cats, plus a broad range of products for horses.\n\nVirbac Australia 2013 sales turnover was more than A$100 Million. In Australia, Virbac employs around 260 personnel and all are passionate about animal health.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/vienna-woods-state-school-819815", "employer_name": "Vienna Woods State School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/videopro-834508", "employer_name": "Videopro", "employer_info": "Since its inception in 1980, VIDEOPRO has grown to be one of Australia's leading technology companies. With world class industry expertise, VIDEOPRO are your providers of Audio, Visual, Computers, and Solution products. \n\nAustralian owned and operated, we pride ourselves on our ability to diversify as the market changes. Our long serving Board of Directors (including our founder Shane Leaney) have active key roles and are hands on in the daily operations of our successful business.\n\nWe value quality product at competitive pricing and are proud to support a wide variety of some of the world’s leading brands. Our dedicated team of staff are passionate in their field, with award winning experts across our Business and Retail teams. We are proud of our staff longevity, and boast high numbers of our 150 staff achieving 10+ years of loyal service in our business.\n\nOne of our key company core values states ‘We Care’ and it is this value that has seen our business continue to expand. We are proud to boast that a major contributor to the success of Videopro is customer loyalty, with a high percentage of our business derived from repeat and referral customers.\nSource: this is an extract from the company’s own website."},
{"employer_url": "https://www.seek.com.au/companies/video-ezy-432409", "employer_name": "Video Ezy", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/victorian-cytology-service-984330", "employer_name": "Victorian Cytology Service", "employer_info": "Victorian Cytology Service Limited (VCS Ltd.) is a Health Promotion Charity focused on reducing the impact of cancer and sexually transmissible infections through screening and vaccination. We achieve this by providing high quality evidence based laboratory and registry services, education and support and policy relevant research and evaluation.\n\nEstablished in 1964 as a joint venture initiative between the Victorian State Government, the Cancer Council and Prince Henry’s Hospital, the organisation has a proud history in helping to reduce the incidence of cervical cancer. While the cervical screening program remains our primary focus, we have sought to expand our activities in related fields, utilising the significant skills and experiences we have gained to reduce the impact of other cancers as well as sexually transmissible infections.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/victorias-secret-984430", "employer_name": "Victoria's Secret", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/victorian-opera-438680", "employer_name": "Victorian Opera", "employer_info": "Our Story\nIn just ten years, over 300,000 audience members have experienced a performance with Victorian Opera – over 20,000 of those attending regional performances. During our short history, we have created 14 new Australian works and collaborated with some of Australia’s leading companies, venues and learning institutions. We employ hundreds across the theatre industry and recruit some of the finest singers from Australia and around the world. We are committed to the accessibility of opera through tactile tours, audio described and relaxed performances. We have inspired over 500 young singers through our youth opera program and developed over 30 emerging artists.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/victory-curtains-and-blinds-834563", "employer_name": "Victory Curtains and Blinds", "employer_info": "The unified purpose of our company is to create satisfied customers who not only recommend us to others but become loyal friends of Victory and customers again in the future.\n\nWe will achieve this through:\n•Our PEOPLE, who are our foundation and a crucial asset to our ongoing success.\n•Our CUSTOMERS, who we serve with a level of care and integrity beyond all expectations.\n•Our PRODUCTS, which meet and exceed the highest industry standards.\n•Our DEDICATION, to winning the hearts of our internal and external customers by continually improving our productivity and offering the very best in service and products.\n•Our SOCIAL RESPONSIBILITY, to act with the utmost integrity and be good citizens in the community in which we live and work. \nSource: This is an extract from the company's own website"},
{"employer_url": "https://www.seek.com.au/companies/victorian-automobile-chamber-of-commerce-815007", "employer_name": "Victorian Automobile Chamber of Commerce", "employer_info": "VACC is the voice of the Victorian automotive industry.\nVictoria’s rapidly growing retail automotive industry, by 1918, saw 15,150 vehicles and 27,424 licensed drivers in the state.\nIt was during this turbulent time that two car-dealer brothers, Henry and Percy Rickards realised that larger international counterparts could force smaller, local companies out of the marketplace. The brothers called together a group of garage owners to meet at the Bendigo Chamber of Commerce rooms on 20 September 1918 and decided to register a new industry association: the Retail Motor Dealers’ Association of Victoria.\nPresent day issues such as industrial disputes and skilled labour shortages were occurring as far back as 1918. To rectify these complaints the association introduced a number of committees: the foundation of VACC’s current operation.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/victorian-building-authority-609502", "employer_name": "Victorian Building Authority", "employer_info": "The Victorian Building Authority (VBA) regulates building and plumbing practitioners to ensure the achievement of efficient and competitive building and plumbing industries in Victoria.\n\nThe VBA's services include:\n\nresponding to general enquiries from the public about the building and plumbing industries\nregistering, licensing and disciplining plumbers in Victoria\nsupporting the work of the Building Practitioners Board, which is responsible for registering and disciplining building practitioners\nproviding expert technical advice and informed solutions to industry\nundertaking inspections, investigations and audits to enforce compliance with relevant legislation\nworking with other agencies and regulators to ensure building and plumbing practitioners are compliant and that consumers are protected\npublishing data for building and plumbing practitioners\nmonitoring the collection of building permit levies\noverseeing the work of building surveyors and Victoria's building permit system.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/village-kids-childrens-centre-874744", "employer_name": "Village Kids Childrens Centre", "employer_info": "Welcome to Village Kids Childrens Centres\n\nVillage Kids Childrens Centres pride themselves on providing quality education and care for all children. Our centres have special environments designed to be engaging and fun for children of different ages and stages of their development.\n\nChildren are encouraged to explore their natural curiosity and build upon their independence and self-help skills, with the support of our early childhood educators. Our highly qualified team aim to provide a safe and warm, environment for each child to encourage their development and learning.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/victorian-aboriginal-child-care-agency-861436", "employer_name": "Victorian Aboriginal Child Care Agency", "employer_info": "The Victorian Aboriginal Child Care Agency (VACCA) is the lead Aboriginal child and family welfare organisation in Victoria, protecting and promoting the rights of Aboriginal children and young people. We provide programs and services to reinforce Aboriginal culture and encourage best parenting practices, and advise government in relation to child abuse and neglect in the Aboriginal community.\n\nWe are a statewide Aboriginal community controlled organisation advocating for the rights of Aboriginal children, young people and families, and providing them with services premised on human rights, self-determination, cultural respect and safety.\nSource: this is an extract from the company’s own website."},
{"employer_url": "https://www.seek.com.au/companies/victorian-aboriginal-community-controlled-health-814118", "employer_name": "Victorian Aboriginal Community Controlled Health", "employer_info": "The Victorian Aboriginal Community Controlled Health Organisation (VACCHO) was established in 1996. VACCHO is the peak Aboriginal health body representing 100% of Aboriginal Community Controlled Health Organisations (ACCHOs) in Victoria. The role of VACCHO is to build the capacity of its Membership and to advocate for issues on their behalf.\n\nCapacity is built amongst Members through strengthening support networks, increasing workforce development opportunities and through leadership on particular health areas. Advocacy is carried out with a range of private, community and government agencies, at state and national levels, on all issues related to Aboriginal health.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/victoria-university-432394", "employer_name": "Victoria University", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/victoria-station-433873", "employer_name": "Victoria Station", "employer_info": "The right service, knowledge and advice for customers has always been a top priority for Victoria Station. When brothers, Paul and Michael, who dreamed of owning their own business, discovered a lack of service whilst seeking luggage for a trip to Europe in the late 80s, an idea was formed.\n\nIn 1990 they opened their first Victoria Station luggage store at Chadstone Shopping Centre. The name of the business came from when Michael had been living and working in London, travelling to and from Victoria Station each day. The brothers wanted the store to have an 'olde world' train station style to reflect the excitement and romanticism of travel in the 19th century.\n\nIn the first few years, it was just the two of them, working long hours and selling well known brands like Samsonite and Antler, with their main point of difference from competitors being their unbeatable customer service and product knowledge. And as they learnt and grew, so did the business, and it wasn't long before word spread, more stores opened and they started introducing their own brands.\n\nAlong with selling luggage, the business also stocked plenty of other items including handbags, men's and women's wallets and travel accessories, providing a one stop shop for customers on the go. Staying on top of the latest industry and fashion trends as well as keeping up with the newest technologies, ensured products continually incorporated optimum quality and style.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/vision-personal-studio-stanmore-984895", "employer_name": "Vision Personal Studio Stanmore", "employer_info": "Our aim is to transform people’s lives through education, motivation and inspiration\nVision Personal Training was started by leading fitness experts who knew how difficult it was to provide truly personal service at a large commercial gym. Our first studio opened in Caringbah, Sydney in 2001. In 2004 the company franchised its first Vision Personal Training studio and has since grown into the largest Australian owned franchised network of Personal Training studios with 53 locations in Queensland, New South Wales, Victoria and Auckland, New Zealand. In 2010, Vision Personal Training was awarded with \"Fitness Australia's Personal Training Business of the Year\".\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/victoria-point-state-school-820522", "employer_name": "Victoria Point State School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/victoria-park-state-school-819705", "employer_name": "Victoria Park State School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/victoria-teachers-mutual-bank-801881", "employer_name": "Victoria Teachers Mutual Bank", "employer_info": "At Victoria Teachers Mutual Bank, we’re invested in you as a member of the education community, as a customer and as an individual. We are owned by our customers, so our focus is solely on providing a better value banking experience given our understanding of the education community.\n\n\nWe focus on giving our customers value for money on all our products and services.\n\n\nWe focus on delivering an outstanding customer experience to our customers, through our range of access channels.\n\n\nWe understand education and are experienced in the financial needs of those that work within the education community.\nSource: this is an extract from the company’s own website"},
{"employer_url": "https://www.seek.com.au/companies/victoria-park-834329", "employer_name": "Victoria Park", "employer_info": "Situated just two kilometers from Brisbane City, Victoria Park is an inner city sanctuary combining state of the art golf, functions, weddings, events and bistro facilities in one stunning setting. Victoria Park is the home of truly amazing experiences.\nSource: This is an extract from the company's own website"},
{"employer_url": "https://www.seek.com.au/companies/victoria-daly-regional-council-801875", "employer_name": "Victoria Daly Regional Council", "employer_info": "The Big rivers region has an abundance of naturally and culturally significant landscape - attracting many tourists during the dry season. Many small communities and towns including the northern communities of Pine Creek and Nauiyu as well as the southern communities of Timber Creek, Kalkarindji and Yarralin – make up the Victoria Daly Regional Council which forms part of the Big Rivers region covering a total area of 360,873 km2 . It has a complex weather system, with a mean annual temperature of 39.7°c. Towards the end of the cooler dry season the locals prepare for what is known as \"the build up\" : an extreme increase in temperature and humidity,  From the bush to the billabongs - the river catchments within the Victoria Daly Regional Council are the lifeblood of the region. The rivers flow across the region, and carry with them a source of economic, social and environmental wellbeing - central to the Council's character, culture, and sense of place.   Source: this is an extract from the company’s own website."},
{"employer_url": "https://www.seek.com.au/companies/victor-chang-cardiac-research-institute-861117", "employer_name": "Victor Chang Cardiac Research Institute", "employer_info": "The Victor Chang Cardiac Research Institute is an independent, not-for-profit research facility, dedicated to the memory of cardiac surgeon Dr Victor Chang and his passionate belief in the power of discovery.\n\nFounded in 1994, the Institute has grown to become a world-class cardiac research and research training facility.\n\nOur team of over 170 full-time staff work across five main Research Divisions – Cardiac Physiology & Transplantation, Developmental and Stem Cell Biology, Molecular Cardiology & Biophysics, Vascular Biology and Molecular, Structural & Computational Biology.\n\nWe hold ourselves to the highest standards of excellence in our research, research training and efforts to translate each new discovery into practical medical applications\n\nAt the Victor Chang Institute, we are committed to recruiting, training and maintaining researchers, students and support staff of the highest calibre.  As a scientist or student working at “The Chang”, you can expect collaborative areas of research and work environments, along with state of the art facilities. \nSource: this is an extract from the company’s own website."},
{"employer_url": "https://www.seek.com.au/companies/vicsuper-813697", "employer_name": "VicSuper", "employer_info": "At VicSuper, we think we’re a little different to the rest of the pack. We are a $15 billion strong profit to member superannuation fund. As at September 2015, we have over 240,000 members and 21,000 participating employers.\n\nWe’re big enough, but not too big that we lose sight of how important it is to give a personalised experience. We’re local and we’re completely dedicated to delivering benefits for our members and our employers.\n\nVicSuper is open to the public, we’re not tied to one particular industry so anyone in Australia can join. This makes it really easy for our members to stay with us throughout their working lives, and enjoy the many features and benefits that come with VicSuper membership.\n\nOur head office is located in the Melbourne CBD and we have advice centres in Blackburn, Bendigo, Geelong and Traralgon. Members and employers can also make an appointment to visit our serviced offices outside of Melbourne including Bairnsdale, Ballarat, Laverton, Mildura, Mornington, Wangaratta, Warrnambool and Wonthaggi.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/victoria-park-primary-school-874093", "employer_name": "Victoria Park Primary School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/tfe-hotels-435841?child=753406", "employer_name": "Vibe Hotels", "employer_info": "\n\n"},
{"employer_url": "https://www.seek.com.au/companies/vfs-global-437246", "employer_name": "VFS Global", "employer_info": "VFS Global is the world's largest outsourcing and technology services specialist for governments and diplomatic missions worldwide. The company manages administrative and non-judgmental tasks related to visa, passport, identity management and other citizen services for its client governments enabling them to focus entirely on the critical task of assessment. \nWe partner with governments to enable faster and informed decision making in the area of consular and identity management services, by providing technology and administrative solutions and value added services that are secure, innovative and offer value for money. We strive to consistently create a reliable and convenient experience for customers, by having engaged employees, business expertise, global presence and value to stakeholders.\nSource: This is an extract from the company's own website"},
{"employer_url": "https://www.seek.com.au/companies/vetwest-animal-hospitals-984167", "employer_name": "Vetwest Animal Hospitals", "employer_info": "Vetwest has been in Perth for over 20 years. We exist today because thousands of WA pet owners have been delighted with the compassion we provide to them and the care we provide to their companions. Our team is made up of people that truly love animals, and have dedicated their working careers to veterinary medicine.\n\nWe have purpose built facilities with an extensive range of diagnostic equipment and are committed to continuous improvement, namely the medical treatment and care of pets, the working conditions of our team, the service we provide to our clients, and promoting responsible pet ownership in the community.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/victoria-racing-club-436050", "employer_name": "Victoria Racing Club", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/viator-828121", "employer_name": "Viator", "employer_info": "Our team of travel insiders is obsessed with finding the best things to do everywhere we travel. From Paris to Phuket to Perth, from traditional tours to once-in-a-lifetime experiences, we have something for every kind of traveler. And we are proud to say that after 17 experience-packed years, we are the world leader. Source: this is an extract from the company's own website"},
{"employer_url": "https://www.seek.com.au/companies/veterinary-specialist-services-984151", "employer_name": "Veterinary Specialist Services", "employer_info": "Veterinary Specialist Services was established in 2000 as an extension of general veterinary practices all over Australia, particularly Queensland, and Northern New South Wales in providing the best possible care for your pets at a specialist level. When your pet requires our expert attention, your primary veterinarian can refer the pet to either our Brisbane or Gold Coast Services via a simple referral process.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/vets4pets-864553", "employer_name": "Vets4Pets", "employer_info": "Large Practice Resources Combined with Personal Veterinary Care.\n\nEvery Vets4Pets local practice offers professional facilities, modern equipment and highly trained people who love animals. We believe in offering the very best in general veterinary care.\n\nA senior vet will oversee the case management and treatment of your pet for as long as you remain our client. Should your pet need a specific service (such as ultrasound, orthopaedic surgery etc), special equipment or even hospitalisation, your case manager draws upon the extensive skills and facilities of the Vets4Pets Group. \nSource: This is an extract from the company's own website"},
{"employer_url": "https://www.seek.com.au/companies/veterinary-practice-partners-984147", "employer_name": "Veterinary Practice Partners", "employer_info": "Veterinary Practice Partners is an Australian organisation providing business support to veterinarians who aspire to own their own veterinary clinic.\n\nAs a team of business professionals and veterinarians, we understand the pressures of running a clinic whilst also trying to provide your clients with excellence in all aspects of veterinary care.\n\nWith this in mind, we have developed partnership relationships with veterinarians, where we assist with the development and growth of the clinic so that our partners can focus on providing their clients and patients the best service possible.\n\nOur partners have access to all the benefits associated with Veterinary Practice Partners including state of the art facilities, on-going business support, professional development and most of all a healthy work life balance. This partnership allows veterinarians to enjoy complete clinical freedom as well as business support, relieving them of the pressures associated with running a successful clinic\nAs your partner we are as committed and dedicated as you to ensuring the success of the clinic.\n\nWe are a team of business professionals and veterinarians, and so we know the industry. We want to work with you to provide communities with excellence in all aspects of veterinary care, from treatments to education.\n\nOur role is to support your professional development. You will have complete clinical freedom, and we will work to relieve you of the stresses and time spent on the business management side of running a successful clinic. We provide professional services that will leverage clinic organisation and development, so that your primary focus can remain on your clients and patients\nSource: This is an extract from the company's own website"},
{"employer_url": "https://www.seek.com.au/companies/vestas-436750", "employer_name": "Vestas", "employer_info": "Company Profile\nVestas is the only global energy company dedicated exclusively to wind energy - improving business case certainty and reducing the cost of energy for our customers.\n\nVestas works in close partnership with customers to offer the most effective solutions towards energy independence. Our core business is the development, manufacturing, sale and maintenance of wind power plants – with competencies that cover every aspect of the value chain from site studies to service and maintenance.\n\nSource: This is an extract from the company's own website"},
{"employer_url": "https://www.seek.com.au/companies/vespa-pizza-799469", "employer_name": "Vespa Pizza", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/vesco-foods-806622", "employer_name": "Vesco Foods", "employer_info": "Welcome to Vesco Foods\nHaving traded for over 35 years under the company name Kailis & France, Vesco Foods is one of Australia’s leading manufacturer of frozen meals and meal components. Using more than 1,500 different ingredients and producing an extensive range of over 300 products, Vesco Foods has built its foundation on traditional philosophies of excellence in quality, service and value. Since 1974, Vesco Foods has evolved into the innovative and progressive manufacturer it is today, supplying prepared frozen lasagne, complete meals, meat casseroles and sauces to many leading national and international brands, retail outlets and food service clients in Australia, Asia and the Middle East. The new brand name Vesco translates from Latin as ‘to feed’ and its vibrant logo takes inspiration from the colours of the Australian environment – blue sky, green farming fields and sunlight.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/very-special-kids-984122", "employer_name": "Very Special Kids", "employer_info": "Very Special Kids cares for children with life-threatening conditions by providing a children’s hospice and professional family support services.\n\nWe are a children’s charity that helps more than 900 families across Victoria who have a child with a life-threatening condition with ongoing support from diagnosis all the way through to recovery or bereavement. Sadly, many of the children we care for will not reach adulthood.\n\nThe free-of-charge family support services include counselling, advocacy, sibling support, bereavement support, networking and peer activities, trained family volunteers and specialist care at Very Special Kids Hospice. Each family is supported in unique and varying ways according to their personal needs.\n\nVery Special Kids Hospice is the only children’s hospice in Victoria and we offer families access to planned and emergency respite, as well as end-of-life care. The hospice provides 24-hour specialist nursing care in a warm and welcoming environment.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/verto-813555", "employer_name": "Verto", "employer_info": "Our Vision is to be the lead provider of services which contribute to the economic health and well-being of the community.\n \nOur Purpose\n\n\nWe are committed to building the community through the provision of training, employment and community services.\n \nWe contribute by providing:\nDiverse services that directly address social and economic disadvantage by removing barriers and providing specialist support for people who are long term unemployed, have disability, have low skills and are geographically isolated\nTargeted assistance for individuals, business and industry\nLifelong learning opportunities that are accessible and relevant to current and future workforces\n \nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/victim-mediation-unit-874084", "employer_name": "Victim Mediation Unit", "employer_info": "The Victim-offender Mediation Unit (VMU) provides a mediation service between victims of crime and offenders.\n\nThis service is available to both adult and juvenile offenders and the respective victims of their crimes.\n\nThe mediation is free, impartial and private and 2 types are offered:\n\nprotective conditions\nreparative mediation.\nOffenders on parole or community-based orders are not permitted to contact their victim(s) under Department of Corrective Service's victim/offender contact policy without Victim-offender Mediation Unit approval.\n\nIf a victim agrees to have contact with the offender, VMU will monitor all contact for as long as necessary.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/vertiv-433648", "employer_name": "Vertiv", "employer_info": "At Vertiv, your vision is our passion. It’s why we design, build and service mission critical technologies that enable vital applications for data centers, communication networks, and commercial and industrial environments. Formerly Emerson Network Power, we support today's growing mobile and cloud computing markets with our portfolio of power, thermal and infrastructure management products, software and solutions, all complemented by our global service network. We help strengthen the world’s most vital applications by bringing together global reach and local knowledge, and our decades-long heritage including brands like ASCO, Chloride, Liebert, NetSure and Trellis. It’s an uncommon combination of resources and expertise and one that allows you to truly realize what’s possible.\n\nSource: this is an extract from the company’s own website"},
{"employer_url": "https://www.seek.com.au/companies/versent-984076", "employer_name": "Versent", "employer_info": "ANYTHING BUT TRADITIONAL\nFrom experience comes knowledge, and the desire to improve the standard model. Based on these principles, the founders of Versent developed a strong methodology that would set them apart from the rest. Our formula of Discipline, Automation, Transformation is applied at each and every step of the way, and our fixed price, fixed outcome approach to IT services provides our customers with the transparency and security that can often be lacking in the IT industry.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/vertex-systems-435696", "employer_name": "Vertex Systems", "employer_info": "Your local Vertex solution provider\n\nIn 2008, Vertex opened a new subsidiary in Cleveland, southeast Queensland, Australia, to serve clients in Australia, New Zealand, China and South East Asia.\n\nEvery market is unique, which is why Vertex BD has been localised for each market. We are continuously developing the market-specific features and libraries with our partnership companies\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/vertech-group-814628", "employer_name": "Vertech Group", "employer_info": "Vertech is an asset integrity management company who provide specialist access, inspection, maintenance and integrity engineering services. Built on a foundation of extensive energy industry experience, we apply world’s best practice to provide intelligent solutions to technically challenging projects.\nA strong client focus is applied to all operations, seeking continuous improvement to maximise project performance.\nAt Vertech out most important value, above all other business objectives, is quality and to care for each other and the environment. Accordingly, the highest standards of health, safety and environmental responsibility are executed throughout the business and in the delivery of our products and services. \n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/versacold-434483", "employer_name": "Versacold", "employer_info": "When choosing a logistics provider, you need a partner that understands information is as critical a component of your supply chain as the physical movement of your product. At VersaCold, our focus on innovation and continuous improvement ensures that we remain on the cutting edge of temperature controlled logistics; today and into the future. \nWe know that knowledge and accuracy are critical components to managing an efficient supply chain. We provide integration of multiple design and operational systems that can be integrated with our customers’ systems. Our team provides 24/7 coverage with internal and external dedicated resources to support our infrastructure.  \nSource: This is an extract from the company's own website"},
{"employer_url": "https://www.seek.com.au/companies/suncorp-432359?child=433579", "employer_name": "Vero Insurance", "employer_info": "\n\n"},
{"employer_url": "https://www.seek.com.au/companies/versace-813257", "employer_name": "Versace", "employer_info": "The Italian fashion house of Versace is one of the leading luxury brands around the world. \n\nA favorite of movie stars, rock stars and VIPs, Versace is known for extraordinary craftsmanship, exquisite details, brilliant color and bold prints. Source: this is an extract from the company’s own website."},
{"employer_url": "https://www.seek.com.au/companies/veronika-maine-753347", "employer_name": "Veronika Maine", "employer_info": "Renowned for technical innovation and high quality finishes, the Veronika Maine brand celebrates the art of fashion. A strong design ethic and innovative energy is combined to create a modern approach to dressing.\n\nTestament to the power of the brand’s contemporary vision and superior quality, Veronika Maine has experienced tremendous growth since its inception in 1998. Veronika Maine is available at Veronika Maine stores, online, David Jones and selected Myer stores.\n\nSeason on season Veronika Maine encourages you to express your creativity with bespoke prints, beautiful fabrics and unmistakable style.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/verizon-433481", "employer_name": "Verizon", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/victoria-plantation-state-school-820076", "employer_name": "Victoria Plantation State School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/verifone-752969", "employer_name": "Verifone", "employer_info": "Headquartered in San Jose, California, Verifone is the leader in providing trusted, secure and innovative payment terminals, global payment as a service, and commerce enablement solutions that create more valuable experiences and rich interactions between consumers and merchants. The company's products and services include mobile, countertop and self-service payment devices, software, and web-based gateways. With 5,300 employees worldwide, and partnerships with local distributors, Verifone is able to deliver innovative payment solutions in 150 countries and across vertical markets. \n\nSource: this is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/veolia-australia-and-new-zealand-432580", "employer_name": "Veolia Australia & New Zealand", "employer_info": "As a global leader in environmental solutions, we work closely with all aspects of local government and some of Australia's largest industrial and commercial companies to help them reach their sustainability goals; providing them with large-scale innovative water, energy and waste solutions. We aim to replicate natural systems to solve man-made problems.\nVeolia is governed by an adherence to the highest levels of safety, no compromises and we work in partnership with our clients to minimise hazards, reduce risk and build a respected and lively safety culture. More so, by speaking our client's language and understanding how their business decisions are guided, Veolia is better placed to deliver the solutions needed across complex issues such as: managing water sources, recovering vital resources from waste and delivering alternative approaches to energy management. \nSource: this is an extract from the company's own website"},
{"employer_url": "https://www.seek.com.au/companies/vermeer-874752", "employer_name": "Vermeer", "employer_info": "When its production per hour that counts, Vermeer's range of Construction, Surface Mining, Environmental and Compact Equipment is the only choice for Australia's contractors and fleet operators.\n\nVermeer Australia, with dealerships strategically located in Queensland, New South Wales, Victoria, South Australia and Indonesia, is positioned to look after your machinery requirements and bring the best that Vermeer Manufacturing Company has to offer to our country.\n\nVermeer has always prided itself on responding to the needs of customers through innovation. From the world’s first commercialised large round hay baler to the laser-guided boring system, Vermeer has delivered many firsts to numerous industries. Every year, Vermeer visits with thousands of customers around the globe to identify their needs. This information is shared with product development teams who continually pursue innovation and refinement in order to better serve our customers - so they can get the job done.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/veresdale-scrub-state-school-819502", "employer_name": "Veresdale Scrub State School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/venues-west-435739", "employer_name": "Venues West", "employer_info": "VenuesWest owns and manages Western Australia’s best sport and entertainment venues on behalf of the State Government. Our portfolio currently consists of 13 venues including Perth Arena and Perth Stadium.\n\nVision and Purpose\n\n“We deliver world class sport and entertainment experiences.”\n\nVenuesWest directly supports high performance sport through the optimisation of our venues. We strive to provide venues with world class competition standards for our targeted sports and provide subsidies to sporting bodies for the use of these facilities. We champion dreams by facilitating pathways for athletes to excel in their chosen sport. Our venues are effectively managed to ensure we deliver world class sporting and entertainment experiences to the people of Western Australia.\n\nStrategic Objectives\n•Deliver outstanding customer experiences\n•Ensure our portfolio of sport and entertainment venues is fit for purpose\n•Engage a workforce that is aligned, highly capable and adaptable\n•Realise commercial success to subsidise high performance sport and enable reinvestment into our venues\n•Secure world class events.\n\n\nThe VenuesWest Way\n\nThe VenuesWest Way guides the way we work and our behaviours. Board members and staff are committed to these principles.\n•We champion dreams\n•We find a way to make it happen\n•Together we win\n•We act like owners\n•We celebrate success – big and small\n\n\n\n\n\n\n\n\n\n\n\nVenue Management Models\n\nVenuesWest uses four management models across its portfolio of state-owned venues. Each model aims to deliver VenuesWest’s vision in the most effective and efficient way.\n•VenuesWest Managed this model is suitable where VenuesWest has the knowledge, experience and capacity to manage venue operations and directly support high performance sport. This model regularly partners with the private sector to deliver services.\n•Partner Managed this model is suitable for use in venues hosting a variety of different events involving multiple hirers. VenuesWest engages an external party through an open tender process to manage the venue operations.\n•Co-managed this model is suitable for use in venues where there is a primary tenant responsible for the majority of usage. This model provides the tenant with priority of use.\n•Lease Agreement this model is suitable for use in single purpose venues with a sole tenant. A lease is provided to the tenant in line with the objectives for that venue.\nSource: this is an extract from the company’s own website."},
{"employer_url": "https://www.seek.com.au/companies/venture-holidays-799457", "employer_name": "Venture Holidays", "employer_info": "About Venture Holidays\n\nVenture Holidays is a wholesale travel company that has been providing high quality, individualised, tailormade holidays to a variety of destinations worldwide since 1979.\n\nTo help plan your holiday, our brochures can be downloaded or can be requested from your local AFTA preferred travel agency.\n\nAfrica & Morocco\nAmerica, Hawaii & Canada\nBali\nUK & Europe\nHong Kong, China & Macau\nSingapore & Malaysia\nThailand\nVietnam, Laos, Cambodia & Myanmar\nDubai, Abu Dhabi & Oman\nFiji\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/vast-interior-874747", "employer_name": "Vast Interior", "employer_info": "Have you ever been looking for that perfect piece of furniture but can’t find anything that is unique and well crafted? We work tirelessly to design & manufacture bespoke pieces of furniture made from sustainable materials, to create unique pieces of furniture that become the centrepieces of the moments in our customers lives.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/vasse-primary-school-874076", "employer_name": "Vasse Primary School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/varley-nursing-post-874075", "employer_name": "Varley Nursing Post", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/vassallo-constructions-801853", "employer_name": "Vassallo Constructions", "employer_info": "Vassallo Constructions Pty Ltd is a Mackay based company with expertise in Earthworks, Roadworks, Concrete works, Pipelaying, Landscaping, Surveying, Environmental Remediation, Residential Developments and Commercial Developments. We have been operating in Mackay and surrounding districts since 1995\n\nour history\n\n\nVassallo Constructions was established in 1995 by a team of four brothers, Victor, Joseph, Peter and Michael Vassallo. This formidable team combine a variety and skills and a wide range of practical experience. Over the years they have bought this local, family run business to the forefront of construction in the Mackay and surrounding regions.\n\n\nour values\n\n\nVassallo Constructions aspires to meet the highest standards of ethics and integrity in all aspects of our work and in relationships with employees, clients and the public. We recognise the expectations of all stakeholders in regards to safety, environmental compliance and quality and continually seek to improve our performance in those areas. As a family based company and significant employer in the local area we understand the needs of the local community, and believe that it is important to employ, purchase and invest locally. We take pride in our work and appreciate the community benefits of long-lasting and low maintenance constructions.\n\n\nour vision\n\n\nVassallo Constructions strives to maintain and consolidate its position at the forefront of quality construction in the local area. Our work is our legacy to community and we take pride in many large and small projects that we have been involved in. We aim to remain the contractor of choice in the local and civil construction industry. Vassallo Constructions Pty Ltd, QBCC Act lic 1131454.\nSource: this is an extract from the company’s own website."},
{"employer_url": "https://www.seek.com.au/companies/varsity-college-799444", "employer_name": "Varsity College", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/varley-group-983705", "employer_name": "Varley Group", "employer_info": "Varley was established in 1886 and is one the Hunter’s oldest and most advanced engineering and manufacturing companies.\n\nThroughout its long history, Varley has steadily grown and diversified to provide a comprehensive range of first class products, service and workmanship to many major industries.\n\nThe Varley Group's ability to transform customer ideas into reality has earned the company a competitive reputation as a provider of innovative turnkey solutions and unsurpassed service, on local, national and international stages.\n\nVarley’s current customer base is wide-ranging across an international stage, from individuals to governments and global corporations. Similarly, the products and services offered by Varley are vastly diverse.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/vasey-rsl-care-814195", "employer_name": "Vasey RSL Care", "employer_info": "Vasey RSL Care provides award-winning aged care to the ex-service community and older Australians\n\nOur nurses and carers feel a great sense of respect for the people in our care and it shows in their empathy and the quality of their work. Across independent living, community and residential aged care, Vasey RSL Care consistently delivers services of high quality.\nFrom a significant history, we have continued a proud tradition of welcoming all who need care. Today, we are a growing and sustainable organisation, re-investing every dollar in our people, equipment and services, and embracing advances in care.\nAt Vasey RSL Care, we salute excellence.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/verifact-434851", "employer_name": "Verifact", "employer_info": "We are a diverse services group of dynamic businesses committed to looking after our employees, our clients and the community within which we work. Internationally we are known as the ‘go-to’ people who can manage people, processes and assets more effectively for our clients across all aspects of a project. Our diversity is one of our greatest strengths.\nFor over 20 years we have sought and delivered valued solutions to a large variety of clients and have in turn established long term mutually beneficial relationships based on excellence of services and trust.\nWe utilise strategies that allow companies to reap the rewards of using a single source provider, significantly lowering their exposure to a diverse range of risks and allowing them to focus on their core business.\nVerifact has a strong reputation in the marketplace for being agile, professional and client focused experts. With lateral thinking and common sense we seek to provide innovative, integrated and cost effective solutions.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/vantage-group-983664", "employer_name": "Vantage Group", "employer_info": "Vantage Hotel Group (Vantage Group) operates across Tasmania through community-based hotels and the 9/11 Bottleshop retail liquor chain, employing over 420 people state-wide.\n\nThe Vantage hotel estate comprises 12 hotels around Tasmania, which provide a combination of bar, gaming, bistro, accommodation and entertainment services to our customers.\n\nThe 9/11 Bottleshop chain operates 19 retail liquor stores across the state, providing great product range and excellent service and product knowledge at convenient locations. \n\nEstablished in 1999, Vantage Group is all about creating good times and our vision is to be the first choice in community pubs and retail liquor. Vantage is a business of the Federal Group.\nThe Vantage hotel estate comprises 12 community-based hotels around Tasmania, which provide a range of bar, gaming, bistro, accommodation and entertainment services to our customers.  \nThe 9/11 Bottleshop chain operates 19 retail liquor stores across the state, providing great product range and service at convenient locations. \nSource: This is an extract from the company's own website"},
{"employer_url": "https://www.seek.com.au/companies/vapiano-436489", "employer_name": "Vapiano", "employer_info": "Funnily enough, there’s nothing more Australian than Italian food. Since Italian migrants first landed in this country we have embraced the tasty deliciousness of pizza, pasta and fresh salads with open arms (and tingling tastebuds). But at Vapiano we’ve gone a step further.\n\nOur Italian restaurants in Brisbane, Garden City, Gold Coast, Melbourne and Sydney take traditional Italian recipes and bring them to life using Aussie know-how and only the best Australian produce (preferably sourced from within 150 kilometres of each restaurant).\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/vantage-automotive-813269", "employer_name": "Vantage Automotive", "employer_info": "welcome\nVantage Automotive Pty Ltd is a major provider of government funded vocational learning and outsourced services to major vehicle manufacturers with an extensive client list across Australia. We supply Australia's leading automotive manufacturers with the best and brightest apprentices.\nFounded in 2001, Vantage Automotive consistently achieves success across the Asia Pacific region by delivering highly valued management consultancy products and services to their clients.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/varley-engineering-801849", "employer_name": "Varley engineering", "employer_info": "Varley was established in 1886 and is one the Hunter’s oldest and most advanced engineering and manufacturing companies.\n\nThroughout its long history, Varley has steadily grown and diversified to provide a comprehensive range of first class products, service and workmanship to many major industries.\n\nThe Varley Group's ability to transform customer ideas into reality has earned the company a competitive reputation as a provider of innovative turnkey solutions and unsurpassed service, on local, national and international stages.\n\nVarley’s current customer base is wide-ranging across an international stage, from individuals to governments and global corporations. Similarly, the products and services offered by Varley are vastly diverse.\n\nCurrent manufacturing projects include custom emergency service, health, education and rescue vehicles, defence ambulances and arms storage facilities, industrial and recreational electric vehicles, power plant restorations and rail maintenance works.\n\nIn addition, services offered include custom engineering and production, made-to-specification manufacturing, electrical and mechanical repairs and repeat vehicle, marine and rail appliance maintenance\nValues\n\nHere at Varley, we strongly believe in these core values:\n\n \n\n   Safety\n\nTo ensure the welfare of our people and visitors.\n\n   Customer Focus\n\nTo offer the best customer service through open and honest relationships.\n\n   High Quality Workmanship\n\nTo ensure high quality products, services and employees.\n\n   Acceptance of Change\n\nTo adapt to changes in customer needs, technology and social demands.\n\n   Success\n\nTo secure continuing financial, technical and market success.\nHistory\n\nVarley Group has a rich history spanning over 130 years. We began as a small plumbing and boiler making business servicing the industrial maintenance and ship repair markets of the Hunter. \n\nVarley have since developed and evolved into a highly successful, diverse and multi-national engineering operation that services multiple sectors. \nSource: this is an extract from the company’s own website."},
{"employer_url": "https://www.seek.com.au/companies/vantage-hotel-group-814514", "employer_name": "Vantage Hotel Group", "employer_info": "Welcome to \nVantage Group\nVantage Hotel Group (Vantage Group) operates across Tasmania through community-based hotels and the 9/11 Bottleshop retail liquor chain, employing over 420 people state-wide.\n\nThe Vantage hotel estate comprises 12 hotels around Tasmania, which provide a combination of bar, gaming, bistro, accommodation and entertainment services to our customers.\n\nThe 9/11 Bottleshop chain operates 18 retail liquor stores across the state, providing great product range and excellent service and product knowledge at convenient locations.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/vanity-group-814328", "employer_name": "Vanity Group", "employer_info": "VANITY GROUP established in 2011, is an Australian owned holding company with an ensemble of luxury retail fashion, skincare and lifestyle brands focusing on the design, development, manufacture and marketing of premium products.\n\nHeadquarters based in Sydney, Australia and with satellite offices in Shanghai, VANITY GROUP comprises of an advanced research and development laboratory, ultra-modern manufacturing facilities, an in-house creative design studio and an extensive warehousing and distribution network.\n\nA pivotal component of our international business includes an extensive global hospitality amenities program through our brands - providing our diverse hotel clientele products of the highest quality, attention to detail and distinctiveness.\n\nVANITY GROUP is here to redefine standards of excellence. Constantly pushing creative boundaries, identifying and integrating trends and generating value in a sustainable manner with a competitive advantage.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/vanderfield-995329", "employer_name": "Vanderfield", "employer_info": "If it’s quality and value you are looking for in agricultural machinery, Vanderfield has the experience, customer focus and product range to meet your needs. The long-standing partnerships we have created with some the nation’s most productive farmers and leading suppliers such as John Deere, HINO, TOYOTA, HORSCH, Fieldquip, Manitou, Howard, Simplicity and many more reflects our strong commitment to meeting the machinery needs of the agricultural and residential market in this country.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/vangoh-shoes-799435", "employer_name": "Vangoh Shoes", "employer_info": "Vangoh is a passionate local and small business in WA, catering to the workforce, local fashionistas + shoe lovers looking for kick-ass service + shoe quality.\\n\\nStarted by a husband and wife team who were frustrated with the options out there for a compromise between 6 inch heels and boring, mass produced flats, Vangoh Shoes is dedicated to providing awesome, high-quality shoes with more stability and support and serious spot-on style!\\n\\nThey are stocked in over 40 boutiques around Australia, and have two retails stores in Perth.\\n\\nTheir ethos is that happy feet make for happy customers, which is why they pride themselves on providing beautiful shoes that are as comfortable as they are fashionable.\\n\\nVangoh is the contraction of the name Vanessa Goh, the other half of the design duo."},
{"employer_url": "https://www.seek.com.au/companies/vanguard-logistics-801844", "employer_name": "Vanguard Logistics", "employer_info": "NACA Logistics (USA) Inc and OTS Logistics Group (HK) represent each other in various countries to provide an integrated and seamless network for logistics, cargo handling and information related to the movement of cargo. In addition to owned brands, an extensive network of 3rd party agents provides representation and completion of global coverage.\n\nThis global coverage now extends to over 177 own offices and agencies worldwide in more than 105 countries and over 200,000 TEU of ocean freight annually. Extensive pre-carriage, ocean freight and destination services allow the network to operate one of the largest point-to-point logistics service organizations in the world.\n\nBrands forming part of the network include AFS, Brennan, Conterm, DCL, Export Freight Services, GPS, OWS (Ocean World Shipping) and Vanguard Logistics.\nSource: this is an extract from the company’s own website"},
{"employer_url": "https://www.seek.com.au/companies/vanguard-investments-australia-806621", "employer_name": "Vanguard Investments Australia", "employer_info": "What sets Vanguard apart – and lets Vanguard put investors first around the world – is the ownership structure of The Vanguard Group, Inc., in the United States.\n\nRather than being publicly traded or owned by a small group of individuals, The Vanguard Group is owned by Vanguard's U.S.-domiciled funds and ETFs. Those funds, in turn, are owned by their investors.\n\nThis unique mutual structure aligns our interests with those of our investors and drives the culture, philosophy and policies throughout the Vanguard organization worldwide.\n\nIn Australia, Vanguard leverages the scale, experience and resources of our established global business. Vanguard's ownership structure means that our clients don't have to worry that we'll be acquired. The company they invest with today will continue to serve them in the future.\n\nRetail managed funds\n\nVanguard Investor Funds provide a cost-effective way to access a professionally managed, diversified mix of investments.\n\nWhether you're a personal, business or self managed superannuation fund investor, Vanguard Investor Funds can help you along the path to long-term wealth creation. You can start investing with as little as $5,000 per fund.\n\n\nWholesale managed funds\n\nInvestors with $500,000 or more to invest can access Vanguard Index Funds and enjoy low wholesale fees and an extensive choice of investment options.\n\nVanguard Index Funds provide an efficient and flexible way to implement your asset allocation or gain exposure to one or more investment market.\n\n\nExchange traded funds (ETFs)\n\nVanguard ETFs are diversified portfolios of securities constructed using an indexing approach that can be readily traded on the Australian Securities Exchange (ASX).\n\nWith all the benefits of index funds, and the flexibility to buy and sell on the ASX, ETFs are a cost-effective way to diversify your clients' portfolios.\nSource: this is an extract from the company’s own website."},
{"employer_url": "https://www.seek.com.au/companies/van-oord-436049", "employer_name": "Van Oord", "employer_info": "Our vision\nThe growing world population needs more space. The demand for energy is rising constantly and society is demanding a transition to a renewable energy system. Increasing world trade requires more and better port facilities and climate change is threatening coastal areas.\nOur mission\nWe are a leading international contractor specialising in dredging, marine engineering and offshore projects (oil,gas and wind). We work closely with our clients to create innovative, sustainable solutions and safe working conditions\nOur values\nMaritime entrepreneurship\nOur entrepreneurship has been shaped by the Netherlands’ centuries-long battle against water. This uniquely Dutch characteristic, the pioneering mindset, is rooted deep within us and makes us the best partner for our clients.\n\nProfessionalism and dedication\nWe are committed, and we always aim to achieve the best result. We are in business to win.\n\nPassion and inventiveness\nWe are driven by our passion for water and technology. As a team, we are eager to tackle marine challenges and find the pieces of the ingenious puzzles we’re solving.\n\nIntegrity, openness, respect, and team spirit\nThe knowledge, experience and teamwork of our ingenious people are the engine driving our prosperity.\n\nCare for people\nCare for people lies at the heart of our company. Working closely with our clients and partners, with respect for each other and the environment, we strive to earn a healthy profit. Our employees enjoy a safe working environment in which they continually embrace opportunities to learn.\nSource: this is an extract from the company’s own website."},
{"employer_url": "https://www.seek.com.au/companies/van-haandel-group-813453", "employer_name": "Van Haandel Group", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/van-eyk-marketing-solutions-437537", "employer_name": "Van Eyk Marketing Solutions", "employer_info": "Van-Eyk Marketing Solutions was incorporated in Sydney in August 2010 where we set out with the belief that success has no boundaries. Our company's success has be driven by the dynamic and supportive relationships between the sales, professional management and administration teams.\n \nOur objective at Van-Eyk Marketing Solutions is to provide an exceptional service to all our clients in order to meet and exceed expectations in all facets of direct marketing. We aim to provide a fun and professional environment to encourage and foster growth and opportunity for our fantastic team members.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/valvoline-816902", "employer_name": "Valvoline", "employer_info": "Leadership You Can Trust\nValvoline™ is a leading global producer, distributor and marketer of high quality lubricants and specialized automotive, commercial and industrial solutions.  Valvoline products, services and programs result from our relentless commitment to improve maintenance, add performance and reduce total cost of ownership for vehicle owners and businesses.  \nHeritage You Can Count On\nValvoline is the lubricant industry’s first brand, with over 140 year of heritage proven to extend engine life, increase reliability and deliver success.  Innovative tools and products make Valvoline a leading partner with workshops, dealers, retailers, original equipment manufacturers and end users.  Beyond industry-leading lubricants, Valvoline has an extensive range of professional, appearance and specialized solutions to enable your success.   \nResources You Can Depend On\nAs a division of Ashland Inc., Valvoline operates a global network of research and development laboratories, distribution and customer services in more than 140 countries. If quality, performance and results matter, join the millions of loyal customers that depend on Valvoline.  \n\nSource: This is an extract from the company’s own website."},
{"employer_url": "https://www.seek.com.au/companies/valtech-814361", "employer_name": "Valtech", "employer_info": "Valtech appoints European Director of Media Solutions\nWith the demands of today’s media consumer, the television and media industry is challenged like never before. With the appointment of Martin Eiler as the new European Director of Media Solutions, Valtech brings a new perspective to these challenges. “Valtech is a global digital agency with a clear message: We are independent of any software products. We provide digital services and advisory across the entire value chain with a mission to challenge the OTT-business beyond merely technology.”\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/valspar-435189", "employer_name": "Valspar", "employer_info": "The Valspar Corporation is one of the largest global coatings manufacturers in the world, providing coatings and coating intermediates to a wide variety of customers. Since 1806, Valspar has been dedicated to bringing customers the latest innovations, the finest quality, and the best customer service in the coatings industry.\n\nWith more than 9,500 employees in over 25 countries, Valspar is in a truly unique position to supply customers with the coating solutions they need."},
{"employer_url": "https://www.seek.com.au/companies/valmont-813284", "employer_name": "Valmont", "employer_info": "We design and construct interiors across the whole of Australia, creating efficient and productive environments for tenants, higher asset values for building owners and visual inspiration for all.\n\nOur unique ‘Intelligent Consulting‘ model fuses leadership, systems and people for seamless delivery, reduced cost and minimal risk to our clients, with the entire process managed in-house from planning to delivery.\n\nAnd it works: to date, we have successfully completed over 300,000m2 of commercial interior space for over 2,500 organisations in 8 major cities and 3 countries.\nSource: this is an extract from the company’s own website."},
{"employer_url": "https://www.seek.com.au/companies/valmec-816901", "employer_name": "Valmec", "employer_info": "VALMEC is an Australian energy and infrastructure services group providing specialised packaged equipment, construction, maintenance, commissioning and integrity maintenance services to the oil and gas, resources, energy and infrastructure sectors.\n\nWith a background in design and construction of mid-sized gas compression, treatment/processing projects and brownfields contracting, the Valmec team can also deliver a technologically diverse and competitive range of energy processing solutions to the Australian oil and gas industry.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/valley-motor-group-983505", "employer_name": "Valley Motor Group", "employer_info": "For more than 18 years Valley Motor Group have been selling and servicing new and used vehicles throughout the Gippsland area. Situated in central Gippsland, Valley Motor Group is a locally owned and operated Company, employing 75 people throughout our two locations in Traralgon and Morwell.\n\nOur focus is on providing excellent representation for our brands which include:- Ford, BMW, Chrysler, Jeep, Dodge, Honda, Kia and Great Wall, ensuring our customers feel their Purchase and Aftersales experience is unequalled.\nSource: This is an extract from the company's own website"},
{"employer_url": "https://www.seek.com.au/companies/victoria-point-state-high-school-819851", "employer_name": "Victoria Point State High School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/valiant-hire-860985", "employer_name": "Valiant Hire", "employer_info": "Welcome to the world of Valiant Style. For over 40 years, we have been Australia’s leader in providing stylish furniture hire solutions delivered with unparalleled customer service. Let Valiant transform your space.  \nOne of the most trusted leaders in furniture hire and styling in Australia, Valiant provides one of the widest ranges of stylish and customised furniture rental solutions delivered with unparalleled customer service. \n\nHaving been in the business since 1961, Valiant has grown to be the only furniture hire company in Australia to provide office furniture hire, event hire and styling, property styling, display home staging, relocation furniture hire and related services\nSource: this is an extract from the company’s own website."},
{"employer_url": "https://www.seek.com.au/companies/valley-longwall-international-435529", "employer_name": "Valley Longwall International", "employer_info": "OUR PEOPLE\nCAPABILITIES\nVLI boasts a team of highly motivated personnel who are extremely experienced in the specialised fields of diesel, drilling and conveyor products and services.\nWe are able to draw upon our abundant in-house expertise in engineering, drafting, project management, sales and marketing, manufacturing, servicing, maintenance, finance and administration in order to develop the most innovative and effective solutions specific to our customers requirements.\nThe depth of our in-house capability provides our customers with single-source accountability on each project. The close working relationship between our tradespeople, designers and field service professionals leads to stream-lined deliveries and communication on every job.\nThe result - products and services that are delivered on time, on budget and exceed our clients' highest expectations.\n \nEQUAL EMPLOYMENT OPPORTUNITY\nVLI has a strong commitment to equality in the workforce and we believe in treating our people with respect. We provide equal employment and advancement opportunities for all.\n\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/valkyrie-state-school-820067", "employer_name": "Valkyrie State School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/valeo-construction-813710", "employer_name": "Valeo Construction", "employer_info": "Valeo Constructions’ core business is the design and construction of new residential and commercial buildings.\n\nWe believe our expertise and track record in construction, combined with cutting edge design services and fast track programs, will ensure the successful delivery of each project.\n\nWe are predominantly active in the medium density residential accommodation market, providing entry level home ownership or investment accommodation in the form of boutique apartment developments.\n\nWe provide consultative services such as designers, architects and engineers to complete the design process and then deliver the actual construction through to completion.\n\nSource: This is an extract from the company’s own website."},
{"employer_url": "https://www.seek.com.au/companies/vale-view-state-school-820083", "employer_name": "Vale View State School", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/val-morgan-outdoor-983522", "employer_name": "Val Morgan Outdoor", "employer_info": "VMO is a leading digital media company. We specialise in Digital Out-of-Home and audience engagement. \nWe are not a traditional Outdoor business. VMO is a leader in audience engagement – a global-class provider of live, dynamic Digital Outdoor served from our agile ad serving system; Pulse. We also provide clients with smarter, more accountable audience metrics via our exclusive audience measurement system – DART (Digital Outdoor Audience in Real Time).\n\nIn the VMO Lab we take our clients ideas, find a bespoke digital technology solution and then offer the very best in audience engagement to solve the marketing objective.\n\nNo brief is too blue sky. We are ready to challenge the market with you.\nWe have a business and culture of success because we pursue excellence. Excellence in our people. And excellence in our category.\n\nNo brief is too complicated for us to find a creative, digital solution. We are a group of authentic, sales, marketing and technical folk that enjoy a challenge and at the core, want to do the very best work with brands, agencies and our partners.\nSource: This is an extract from the company's own website"},
{"employer_url": "https://www.seek.com.au/companies/vale-433244", "employer_name": "Vale", "employer_info": "\n\n"},
{"employer_url": "https://www.seek.com.au/companies/valcorp-fine-foods-801839", "employer_name": "Valcorp Fine Foods", "employer_info": "Valcorp Fine Foods was established in 1994 and is a privately owned family business.\n\nToday, Valcorp is a dynamic Australian business employing around 100 people, with offices in every capital city. We are responsible for the sales, marketing, distribution and customer service of some of Australia’s most loved premium food and beverage brands.\n\nValcorp prides itself on strong relationships with its brand principles and has the knowledge and vision needed to give emerging brands a strong presence in the market.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/vacmould-displays-983388", "employer_name": "Vacmould Displays", "employer_info": "Who we are\nVacmould Displays is a family owned business which has operated for in excess of thirty years. Over this time our extensive experience has helped us build a solid reputation as an industry leader in plastic moulding and fabrication producing Australian made products of the highest quality and standard. At our production facility located in Airport West, Melbourne, Australia we create everything from retail point of sale displays, through to large heavy-duty industrial mouldings and automotive-grade components.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/vae-group-834411", "employer_name": "VAE Group", "employer_info": "VAE Group is a specialist HVAC and BMS Engineering service provider.\n\n \n\nVAE stands for Value Added Engineering and we focus on adding value to every project across a broad range of applications. Our clients benefit from increased return on their asset investment. VAE Group has the people and the systems to analyse your building data to provide optimum performance to increase the value of your asset.\n\n \n\nVAE Group's capability spans the HVAC and energy services spectrum. From commercial buildings, light industrial and major infrastructure through to demanding mining and heavy engineering applications.\n\n \n\n \n\n \n\nPROFESSIONAL TEAM\n\n\n\n\n\nVAE Group's experienced team of industry professionals has the expertise to tackle and add value to every job we encounter.\n\n \n\nOur experienced senior management team, administration staff, account managers, refrigeration and BMS service technicians are all supported by VAE Group’s in-house mechanical engineers, automation engineers, design draftsmen and commissioning engineers. \n We built our reputation by taking on the harder jobs. Our experienced team of industry professionals has the expertise to tackle and add value to every job. \nSource: This is an extract from the company's own website"},
{"employer_url": "https://www.seek.com.au/companies/vagabond-cruises-799418", "employer_name": "Vagabond Cruises", "employer_info": "With over 3 decades experience, Vagabond Cruises is one of Sydney Harbour's longest established cruise companies! \n\nAs a family run business, we deliver a wide range of convenient and all inclusive packages including live entertainment lunch and dinner cruises, private functions for any personal or formal occasion such as Weddings, corporate events, harbour transfers, school formals, uni parties, birthdays, hens/bucks and much more! \n\nOur dedicated events team aims to make your event memorable for all the right reasons - choose your package and vessel and settle in for a great experience on Sydney Harbour. We boast a fleet of fully equipped vessels to accommodate 20 to 350 guests day or night!\n\nVagabond Cruises are equipped to host events of all styles and offer a tailored service taking into account your individual requirements and budget to fully realise a successful event! We offer flexible cruising options and guarantee to beat any comparable quote!\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/vacc-814751", "employer_name": "VACC", "employer_info": "HR managers, workplace lawyers, apprentice mentors, OHS managers, technical experts and marketing professionals. Most businesses don’t have the capacity to employ these people independently. That’s where VACC comes in.\nVACC members belong to a professional association that provides access to technical repair and service information, trained automotive technicians, environmental and safety specialists, workplace-relations lawyers, skills and training, research and information, plus a visiting business development manager.\nVACC membership provides you with a genuine edge, because non-members simply do not have this backing. That’s the difference VACC makes.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/vip-petfoods-995325", "employer_name": "V.I.P. Petfoods", "employer_info": "V.I.P. Petfoods is proud to be Australian owned and operated; and in the past 13 years has achieved the status of market leader in the fresh chilled petfood segment in not only Australia , but around the world. The quality of our products and the consistently high standard of service to our customers has been recognized by several industry awards over the past years.\n\nMore recently VIP Petfoods has launched into the USA, in particularly through the H.E.B grocery stores through out Texas. This strategic move was due to the need for more competition in the USA market, but also the demand for high quality fresh petfood from USA customers.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/vac-group-815176", "employer_name": "VAC Group", "employer_info": "The VAC Group provides solutions to protect the integrity of underground assets, by supplying underground asset location, mapping and safe, non-destructive excavation services.\nOur clients include ‘Blue Chip’ private companies as well as Federal, State and Local government organisations, undertaking predominantly major infrastructure projects, civil and building works.\nUniquely, we can offer a ‘One Stop Solution’ with an array of technologies and products designed to assess and mitigate underground utility related risks associated with the design and construction of civil and infrastructure works.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/v4-telecom-983371", "employer_name": "V4 Telecom", "employer_info": "V4 Telecom is one of the fastest growing startup Telecoms Supplier in Australia.\n\n100% Australian\nV4 Telecom is proudly 100% Australian and carries a die-hard belief in promoting Aussie excellence. Customers include major takeaway chains, solicitors, fitness companies and other small businesses across the country.\n\nAbout V4 Telecom\nV4 Telecom is amongst Australia’s fastest growing business telecom service providers. We specialize in providing phone and internet services to SOHOs, SMEs and corporate customers, guaranteeing attractive pricing and one-to-one account management services for all sized Australian businesses. Our products include inbound and outbound voice solutions, high-speed internet access solutions, telecom’s auditing, hardware and data solutions.\n\nOur company ethos is to do business on your terms. We tailor our offerings when needed to suit each individual business and continually seek to innovate, add value and simplify our product array. V4 Telecom combines its services with full management of all support related areas required to deliver the customer’s entire gamut of telecommunications services.\n\nV4 is dedicated to delivering high quality, low cost telecommunications solutions, together with a full management capability and simple easy to understand billing.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/v-constructions-801835", "employer_name": "V Constructions", "employer_info": null}
]