{
  "data": [
{"employer_url": "https://www.seek.com.au/companies/1001-optical-436897", "employer_name": "1001 Optical", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/99-bikes-806731", "employer_name": "99 Bikes", "employer_info": "We opened the doors of our first shop in May 2007. The Milton shop was led by Matt Turner and was a small 170m2 - only fitting 99 bikes into the building.\n\nA team of four kept the shop open seven days a week, twelve hours a day with one tiny room tripling as a workshop, office and stock room.\n\nThe integral team grew to 8 as our Milton shop flourished and our second shop was opened in Underwood. Most of the original team are still with us today.\n\nMatt continued to use the advice of his father, Graham ‘Skroo’ Turner to evolve systems and processes in alignment with Flight Centre - a business model which has demonstrated success since 1981.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/8hotels-815148", "employer_name": "8Hotels", "employer_info": "8Hotels began in 2003 by leasing a 14 room hotel in Sydney's Darlinghurst and by 2013 had grown into a market- leading boutique hotel management company with a collection of 21 hotels and over 1200 rooms located throughout Australia and abroad.\n\nThroughout 2014 & 2015 our company successfully completed a divestment strategy of selling some core hotel assets and terminating agreements on non core hotels. This further strengthened our balance sheet to embark on a new phase of growth through hotels service contracts, new development, ownership and management of key hotel assets via our fully integrated operating platform including architecture & design, finance, human resources & training, distribution & revenue management, information technology and food & beverage services.\n\nCurrently, new and existing hotels are being developed and or refurbished & repositioned in Haymarket, Surry Hills, Pyrmont, Green Square & Sydney Airport.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/4-pines-brewing-company-861291", "employer_name": "4 Pines Brewing Company", "employer_info": "4 Pines was born over a decade ago from a casual conversation between a father and son, post surf, who simply wanted an exceptional beer and options were limited. \nWe are made by our family and extended family, friends and the community who all help us do what we love. \nWe’re investing in the quest for exceptional beer, blowing people’s minds, the community we love, our mission for the world’s first space brew, chiselled jaw lines, a new swing king (as we hit ours over the fence at the last Christmas party) and having heaps of fun along the way. \nSource: this is an extract from the company’s own website."},
{"employer_url": "https://www.seek.com.au/companies/400-gradi-988517", "employer_name": "400 Gradi", "employer_info": "Real Neapolitan style pizza is\njust a beautiful thing\n\nJohnny Di Francesco –\nPizzaiolo, Chef, Restaurateur\n\n400 Gradi is the brainchild of chef and V.P.N. Principal Johnny Di Francesco, who’s family hail from Naples in Southern coastal Italy – the home of ‘world’s best’ pizza. Johnny has a series of Pizza and Calzone outlets with the 400 Gradi restaurant being the flagship of the group.\n\nThe 400 Gradi interiors are all about classic Italian textures, with walls of espresso ribbons of Stucco Veneziana and sweeping golden calligraphy. Black and antique gold pendant lights and a charcoal Terrazzo style polished floor all reflect a golden hue. A bar honed from a dark veined slab of 160 year old red gum, salumi cabinets and antique slicers are all part of the theatre… Outside there’s plenty more tables for dining where the usual sophistication of the ‘other’ end of Lygon Street is apparent.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/7-chefs-988577", "employer_name": "7 Chefs", "employer_info": "Casa Della Pasta was founded in 1986 and has grown from its humble beginnings using hand operated pasta machines. In those days the company was only producing small quantities of gourmet pasta out of a little shop in East Brunswick, Victoria.\n\nIn 1996, the Sperlinga family purchased the company. Using the knowledge they had gained over their 30 years’ experience in the food industry, they have grown the company to what it is today. In 2010, it was necessary to change the name to better reflect the developing areas and offerings of the company. 7 Chefs was born.\n\n7 Chefs is constantly improving its production techniques ensuring the finest quality traditional and gourmet pasta from the freshest of ingredients. Using state of the art cooking facilities which incorporate pasteurization and individual quick freeze technology, which in turn increases the shelf life of products without the needed for added preservatives.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/4mation-technologies-814083", "employer_name": "4mation Technologies", "employer_info": "We’re an elite team of 60+ designers, developers, producers and project managers, dedicated to ridding the world of poor quality web solutions. Our clients come from a range of industries with diverse requirements, the common thread being their requirement for high quality web solutions that they can depend on. We have a proven 14 year track record building and supporting websites and systems that are essential to our client’s businesses. We communicate clearly and deliver on time, on budget and bug free.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/4th-dimension-4d-999615", "employer_name": "4th Dimension (4D)", "employer_info": "4th Dimension (4D) represents the next generation of advisory services for the travel industry. We are an advisory service managed by industry professionals with proven track records in helping blue-chip corporates and government clients achieve outstanding results in travel.\n\nThe 4D team includes highly experienced travel, finance and procurement professionals led by global travel industry leader Felicity Burke. Our people are industry change leaders not followers of traditional solutions. We offer innovative strategies designed to meet the complex demands of the continually evolving procurement market.\n\n4D is supported by an international network and best-in-market local and global technologies and team.\n\nWe’re committed to developing long term, sustainable outcomes and our focus is on delivering solutions that generate significant return on your investment in travel. Source: this is an extract from the company’s own website."},
{"employer_url": "https://www.seek.com.au/companies/7-eleven-432826", "employer_name": "7 Eleven", "employer_info": "7-Eleven Stores Pty Ltd, Australia’s first choice in convenience, is a private company owned by the Withers and Barlow family.  The company has a license to operate and franchise 7-Eleven stores in Australia from the US based 7-Eleven Inc. \n\nThe first Australian store was opened in August 1977.  Today 7-Eleven Stores Pty Ltd. operates more than 630 stores in Queensland, New South Wales, Victoria, the Australian Capital Territory, and Western Australia.\n\nThrough its store network, 7-Eleven Stores Pty Ltd. conducts more than 190 million transactions a year, serving an average six customers per second, generating sales of approximately $3.6 billion.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/3m-434167", "employer_name": "3M", "employer_info": "3M is fundamentally a science-based company. We produce thousands of imaginative products, and we're a leader in scores of markets - from health care and highway safety to office products and abrasives and adhesives. Our success begins with our ability to apply our technologies - often in combination - to an endless array of real-world customer needs.\n\nSource: this is an extract from the company’s own website"},
{"employer_url": "https://www.seek.com.au/companies/3ina-806787", "employer_name": "3ina", "employer_info": "\n\n"},
{"employer_url": "https://www.seek.com.au/companies/3d-networks-436983", "employer_name": "3D Networks", "employer_info": null},
{"employer_url": "https://www.seek.com.au/companies/360-degree-fire-878341", "employer_name": "360 Degree Fire", "employer_info": "Encompass all aspects of your fire protection services.\n\n360 Degree Fire Pty Ltd is a provider of Fire Safety Solutions. Our goal is the protection of life, property and assets through technology and innovation.\n\nThe skilled workforce at 360 Degree Fire are committed to providing detailed and cost effective fire protection systems whilst maintaining compliance with the Australian Standards at all times.\n\nDesign, Construct, Maintain and Emergency Response – all of your Fire Safety needs are encompassed at 360 Degree Fire Pty Ltd.\n360 Degree Fire is a provider of all aspects of Fire Services Design. Our in house team of designers will create a detailed, integrated, comprehensive and compliant system design for your project. \nConstruct\n\n360 Degree Fire is a provider of all aspects of Fire Services Installation. Our team of in house professional and trade qualified staff can complete the installation of any aspect of your fire protection system in compliance with the Australian Standards and your site specific requirements.\n360 Degree Fire is a provider of all aspects of Fire Services Maintenance. Our team of in house professional and trade qualified staff can maintain any aspect of your fire protection system in compliance with the Australian Standards.  \nSource: This is an extract from the company's own website"},
{"employer_url": "https://www.seek.com.au/companies/2nds-world-861510", "employer_name": "2nds World", "employer_info": "We have been in business for over 35 years!\n \n2nds World is Australia's leading Factory Seconds Appliance Retailer, and because it is part of the largest buying group in Australia,\n2nds World is able to offer \"Great Brands for Less\" and has been helping bargain hunters save for over 35 years! 2nds World is a\nprivately owned family business based in Sydney.\n \nWe offer genuine Factory Second, Carton Damaged, New Run Out and Brand New appliance bargains - all directly from the\nmanufactures, complete with supplier warranty\n \nAt 2nds World, customers \"Choose the way you save\" on Factory Second (Yellow Price Ticket), Carton Damaged\n(Pink Price Ticket), New Run Out (Blue Price Ticket), Factory Refurbished (Orange Price Ticket) and Brand New Appliances\n(Green Price Ticket). Customers have a choice of delivery options ranging from Express Same Day Delivery to Next Day and\nRegional Delivery options. Old appliances can be removed and recycled for a small additional fee.\n \nAppliance Solutions Direct is the commercial arm of the business which specialises in the B2B sale of appliances to all commercial customers.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/20th-century-fox-437337", "employer_name": "20th Century Fox", "employer_info": "A DREAM IS BORN\n\n20th Century Fox’s story begins in a tiny theater on New York’s Lower East Side. In 1904, fresh from Hungary, 25-year-old William Fox amazed audiences with his magical hand-cranked films. The beginnings were humble – folding chairs, a painted wall for a screen -- but the desire to entertain and move people has been at the core of what 20th Century Fox has been doing ever since. By 1915 Fox’s five-cent movie shows were wildly popular and his single screen grew first into a chain of 25 theaters around New York City and then into a movie making business.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/360-finance-878349", "employer_name": "360 Finance", "employer_info": "360 Finance is a complete financing solution which gives you the most competitive interest rates and the widest range of car finance options. Why waste time shopping around for car finance when you can go directly to Australia’s best online finance broker to receive the best possible financing solution for your next car, bike, boat or caravan? Our friendly team of dedicated finance experts will work hard to tailor a low rate finance package for the purchase of your next family car, right through to securing a fleet of vehicles for your growing business.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/24x7-direct-435109", "employer_name": "24x7 Direct", "employer_info": "From humble beginnings back in 2001 running two phone lines from a converted milk bar in Ferntree Gully, we’ve grown our business one satisfied client at a time. Driven by a tireless work ethic and a genuine passion for our industry, we’ve established a reputation for being hungry, resourceful and results-focused.\n\nToday, our Melbourne CBD office houses a skilled sales force of over 100 full-time staff. We invest significant time and resources into recruiting, training and retaining every member of the 24×7 direct family, because we understand that happy, loyal staff lead to happy, loyal clients (you can read more about our team here).\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/1834-hospitality-814721", "employer_name": "1834 Hospitality", "employer_info": "More about 1834 Hospitality – tourism business management and hospitality consultants\n\n1834 Hospitality is a business management company specialising in the hospitality and tourism sectors. 1834 Hospitality manage all operations and undertake marketing for small to medium hospitality businesses, ranging from pubs, to city hotels, regional motels, clubs and resorts. 1834 Hospitality also provide a variety of business consultancy services.\n\nOur Goal\n\nAt 1834 Hospitality, we strive to assist owners in maximizing the value of their hospitality assets. We believe that with extensive operational analysis, marketing, capital expenditure planning, and precise asset positioning, we can optimize market performance and control costs to maximize ROI.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/2-creative-media-878282", "employer_name": "2 Creative Media", "employer_info": "2 Creative Media is a 360 degree, full service, end-to-end communications and marketing agency, full of creative, ‘out-of-the-box’ ideas people, generating a rich mix of powerful brands, design, digital, events and clever communications that work seamlessly together and that really connect - all with one goal in mind: to make your brand successful.\n\nSpecialising in understanding market trends, the team uses imagination, strategy and experience to create messages that excite, inspire and engage, to discover that infinitely powerful juncture of truth between a brand and its consumer.\n\nConstantly scanning the horizon to meet the ever-changing way information is consumed, we’re not limited to any one way of thinking. From brand and position, to print, digital, and experiential concepts and events - we develop strategies that reach your customers wherever they are. Big picture thinking and measurable results provide insights that give valuable direction for future business planning.\n\n2 Creative Media is a creative-driven agency, delivering on ideas that are clever, engaging and surprising. We ensure every campaign is communicated across all platforms consistently, creating a holistic look, feel, sound, taste and smell that is uniquely yours, and immediately recognisable.\n\n\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/20cube-logistics-797025", "employer_name": "20Cube Logistics", "employer_info": "At 20Cube, we believe that values can move more than consignments, they can move mountains.\n\nThe business of logistics is all about moving things swiftly and safely. Is it any wonder then that we are driven by values? And the values we believe in not only inspire us to work more efficiently, they help you run your business with a smile.\n\nSMILE sums up our values. And together they speak of our attitude, 'Leave it to us'.\nSource: this is an extract from the company’s own website."},
{"employer_url": "https://www.seek.com.au/companies/1300smiles-stadium-795827", "employer_name": "1300SMILES Stadium", "employer_info": "1300SMILES Stadium is one of nine major sporting and entertainment facilities owned and operated by Stadiums Queensland. Stadiums Queensland (SQ) has been established by the Queensland Government to manage, operate and promote the use of the State’s major sports, recreation and leisure facilities.  SQ is a statutory body overseen by a Board of Directors and has responsibility for the following venues:\n\nBrisbane Cricket Ground (The Gabba);\nSuncorp Stadium;\nSleeman Sports Complex;\nBrisbane Entertainment Centre; \nQueensland Sports and Athletic Centre;\nSkilled Park;\nQueensland Tennis Centre;\nMetricon Stadium; and\n1300SMILES Stadium.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/1300smiles-436755", "employer_name": "1300SMILES", "employer_info": "1300SMILES was founded by Dr Daryl Holmes and has been listed on the Australian Stock Exchange since early 2005. With twenty three full-service dental facilities in ten major population centres in Queensland, Sydney and Adelaide, it is easy to find affordable quality dental care near to your home or work. Our corporate and administrative offices are located in Townsville.\n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/13cabs-436898", "employer_name": "13CABS", "employer_info": "13CABS is the leading taxi cab company operating throughout greater Melbourne with more than 2500 taxi cabs in its network.\nService options include:\n\nautomated taxi cab bookings\ndoor-to-door personal transport\nFirst Choice Drivers\nMAXI Taxis\nMelbourne Airport transfers\nMobile Point Pickup\nparcel delivery\nSilver Service\nstation wagons\nTaxiTracker\ntransport solutions for businesses\nwheelchair accessible taxis \n\nSource: This is an extract from the company's own website."},
{"employer_url": "https://www.seek.com.au/companies/1300-flowers-878041", "employer_name": "1300 Flowers", "employer_info": "1300 FLOWERS™ is a leading Australian delivered flowers and gifts retailer. We are passionate about crafting and delivering beautiful flowers suitable for all events and occasions including birthdays, anniversaries, Mother's Day and Valentine's Day. We are proudly Australian owned and Australian run with a friendly customer service team based in Brisbane. When you order flowers from 1300 FLOWERS™, you can be confident that you are dealing with a trusted flowers and gifts retailer who is responsible for delivering happiness in the form of flowers to thousands of lucky recipients a month.\n\nSource: This is an extract from the company's own website."}
]}